nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * ADC_CFG2 - ADC Configuration Register 2
 ******************************************************************************/

/*!
 * @brief ADC_CFG2 - ADC Configuration Register 2 (RW)
 *
 * Reset value: 0x0000000CU
 *
 * Configuration Register 2 (CFG2) selects the long sample time duration during
 * long sample mode.
 */
/*!
 * @name Constants and macros for entire ADC_CFG2 register
 */
/*@{*/
#define ADC_RD_CFG2(base)        (ADC_CFG2_REG(base))
#define ADC_WR_CFG2(base, value) (ADC_CFG2_REG(base) = (value))
#define ADC_RMW_CFG2(base, mask, value) (ADC_WR_CFG2(base, (ADC_RD_CFG2(base) & ~(mask)) | (value)))
#define ADC_SET_CFG2(base, value) (ADC_WR_CFG2(base, ADC_RD_CFG2(base) |  (value)))
#define ADC_CLR_CFG2(base, value) (ADC_WR_CFG2(base, ADC_RD_CFG2(base) & ~(value)))
#define ADC_TOG_CFG2(base, value) (ADC_WR_CFG2(base, ADC_RD_CFG2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CFG2 bitfields
 */

/*!
 * @name Register ADC_CFG2, field SMPLTS[7:0] (RW)
 *
 * Selects a sample time of 2 to 256 ADCK clock cycles. The value written to
 * this register is the desired sample time minus 1. A sample time of 1 is not
 * supported. Allows higher impedance inputs to be accurately sampled or to maximize
 * conversion speed for lower impedance inputs. Longer sample times can also be
 * used to lower overall power consumption when continuous conversions are enabled
 * if high conversion rates are not required.
 */
/*@{*/
/*! @brief Read current value of the ADC_CFG2_SMPLTS field. */
#define ADC_RD_CFG2_SMPLTS(base) ((ADC_CFG2_REG(base) & ADC_CFG2_SMPLTS_MASK) >> ADC_CFG2_SMPLTS_SHIFT)
#define ADC_BRD_CFG2_SMPLTS(base) (ADC_RD_CFG2_SMPLTS(base))

/*! @brief Set the SMPLTS field to a new value. */
#define ADC_WR_CFG2_SMPLTS(base, value) (ADC_RMW_CFG2(base, ADC_CFG2_SMPLTS_MASK, ADC_CFG2_SMPLTS(value)))
#define ADC_BWR_CFG2_SMPLTS(base, value) (ADC_WR_CFG2_SMPLTS(base, value))
/*@}*/

/*******************************************************************************
 * ADC_R - ADC Data Result Register
 ******************************************************************************/

/*!
 * @brief ADC_R - ADC Data Result Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The data result registers (Rn) contain the result of an ADC conversion of the
 * channel selected by the corresponding status and channel control register
 * (SC1A:SC1n). For every status and channel control register, there is a
 * corresponding data result register. Unused bits in R n are cleared. The following table
 * describes the behavior of the data result registers in the different modes of
 * operation. Data result register description Conversion mode D12 D11 D10 D9 D8
 * D7 D6 D5 D4 D3 D2 D1 D0 Format 12-bit single-ended D D D D D D D D D D D D
 * Unsigned right-justified 10-bit single-ended 0 0 D D D D D D D D D D Unsigned
 * right-justified 8-bit single-ended 0 0 0 0 D D D D D D D D Unsigned
 * right-justified D: Data
 */
/*!
 * @name Constants and macros for entire ADC_R register
 */
/*@{*/
#define ADC_RD_R(base, index)    (ADC_R_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual ADC_R bitfields
 */

/*!
 * @name Register ADC_R, field D[11:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ADC_R_D field. */
#define ADC_RD_R_D(base, index) ((ADC_R_REG(base, index) & ADC_R_D_MASK) >> ADC_R_D_SHIFT)
#define ADC_BRD_R_D(base, index) (ADC_RD_R_D(base, index))
/*@}*/

/*******************************************************************************
 * ADC_CV - Compare Value Registers
 ******************************************************************************/

/*!
 * @brief ADC_CV - Compare Value Registers (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Compare Value Registers (CV1 and CV2) contain a compare value used to
 * compare the conversion result when the compare function is enabled, that is,
 * SC2[ACFE]=1. This register is formatted in the same way as the Rn registers.
 * Therefore, the compare function uses only the CVn fields that are related to the
 * ADC mode of operation. The compare value 2 register (CV2) is used only when the
 * compare range function is enabled, that is, SC2[ACREN]=1.
 */
/*!
 * @name Constants and macros for entire ADC_CV register
 */
/*@{*/
#define ADC_RD_CV(base, index)   (ADC_CV_REG(base, index))
#define ADC_WR_CV(base, index, value) (ADC_CV_REG(base, index) = (value))
#define ADC_RMW_CV(base, index, mask, value) (ADC_WR_CV(base, index, (ADC_RD_CV(base, index) & ~(mask)) | (value)))
#define ADC_SET_CV(base, index, value) (ADC_WR_CV(base, index, ADC_RD_CV(base, index) |  (value)))
#define ADC_CLR_CV(base, index, value) (ADC_WR_CV(base, index, ADC_RD_CV(base, index) & ~(value)))
#define ADC_TOG_CV(base, index, value) (ADC_WR_CV(base, index, ADC_RD_CV(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CV bitfields
 */

/*!
 * @name Register ADC_CV, field CV[11:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ADC_CV_CV field. */
#define ADC_RD_CV_CV(base, index) ((ADC_CV_REG(base, index) & ADC_CV_CV_MASK) >> ADC_CV_CV_SHIFT)
#define ADC_BRD_CV_CV(base, index) (ADC_RD_CV_CV(base, index))

/*! @brief Set the CV field to a new value. */
#define ADC_WR_CV_CV(base, index, value) (ADC_RMW_CV(base, index, ADC_CV_CV_MASK, ADC_CV_CV(value)))
#define ADC_BWR_CV_CV(base, index, value) (ADC_WR_CV_CV(base, index, value))
/*@}*/

/*******************************************************************************
 * ADC_SC2 - Status and Control Register 2
 ******************************************************************************/

/*!
 * @brief ADC_SC2 - Status and Control Register 2 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The status and control register 2 (SC2) contains the conversion active,
 * hardware/software trigger select, compare function, and voltage reference select of
 * the ADC module.
 */
/*!
 * @name Constants and macros for entire ADC_SC2 register
 */
/*@{*/
#define ADC_RD_SC2(base)         (ADC_SC2_REG(base))
#define ADC_WR_SC2(base, value)  (ADC_SC2_REG(base) = (value))
#define ADC_RMW_SC2(base, mask, value) (ADC_WR_SC2(base, (ADC_RD_SC2(base) & ~(mask)) | (value)))
#define ADC_SET_SC2(base, value) (ADC_WR_SC2(base, ADC_RD_SC2(base) |  (value)))
#define ADC_CLR_SC2(base, value) (ADC_WR_SC2(base, ADC_RD_SC2(base) & ~(value)))
#define ADC_TOG_SC2(base, value) (ADC_WR_SC2(base, ADC_RD_SC2(base) ^  (value)))
/*@}*/

