nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual ADC_BASE_OFS bitfields
 */

/*!
 * @name Register ADC_BASE_OFS, field BA_OFS[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ADC_BASE_OFS_BA_OFS field. */
#define ADC_RD_BASE_OFS_BA_OFS(base) ((ADC_BASE_OFS_REG(base) & ADC_BASE_OFS_BA_OFS_MASK) >> ADC_BASE_OFS_BA_OFS_SHIFT)
#define ADC_BRD_BASE_OFS_BA_OFS(base) (ADC_RD_BASE_OFS_BA_OFS(base))

/*! @brief Set the BA_OFS field to a new value. */
#define ADC_WR_BASE_OFS_BA_OFS(base, value) (ADC_RMW_BASE_OFS(base, ADC_BASE_OFS_BA_OFS_MASK, ADC_BASE_OFS_BA_OFS(value)))
#define ADC_BWR_BASE_OFS_BA_OFS(base, value) (ADC_WR_BASE_OFS_BA_OFS(base, value))
/*@}*/

/*******************************************************************************
 * ADC_OFS - ADC Offset Correction Register
 ******************************************************************************/

/*!
 * @brief ADC_OFS - ADC Offset Correction Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The ADC Offset Correction Register (OFS) contains the calibration-generated
 * offset error correction value (OFS). The value in (BA_OFF) is used in the
 * calibration algorithm to calculate the offset correction value that gets stored in
 * the (OFS) register. The value in OFS is subtracted from the conversion and the
 * result is transferred into the result registers, Rn. If the result is greater
 * than the maximum or less than the minimum result value, it is forced to the
 * appropriate limit for the current mode of operation.
 */
/*!
 * @name Constants and macros for entire ADC_OFS register
 */
/*@{*/
#define ADC_RD_OFS(base)         (ADC_OFS_REG(base))
#define ADC_WR_OFS(base, value)  (ADC_OFS_REG(base) = (value))
#define ADC_RMW_OFS(base, mask, value) (ADC_WR_OFS(base, (ADC_RD_OFS(base) & ~(mask)) | (value)))
#define ADC_SET_OFS(base, value) (ADC_WR_OFS(base, ADC_RD_OFS(base) |  (value)))
#define ADC_CLR_OFS(base, value) (ADC_WR_OFS(base, ADC_RD_OFS(base) & ~(value)))
#define ADC_TOG_OFS(base, value) (ADC_WR_OFS(base, ADC_RD_OFS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_OFS bitfields
 */

/*!
 * @name Register ADC_OFS, field OFS[11:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ADC_OFS_OFS field. */
#define ADC_RD_OFS_OFS(base) ((ADC_OFS_REG(base) & ADC_OFS_OFS_MASK) >> ADC_OFS_OFS_SHIFT)
#define ADC_BRD_OFS_OFS(base) (ADC_RD_OFS_OFS(base))

/*! @brief Set the OFS field to a new value. */
#define ADC_WR_OFS_OFS(base, value) (ADC_RMW_OFS(base, ADC_OFS_OFS_MASK, ADC_OFS_OFS(value)))
#define ADC_BWR_OFS_OFS(base, value) (ADC_WR_OFS_OFS(base, value))
/*@}*/

/*******************************************************************************
 * ADC_USR_OFS - ADC USER Offset Correction Register
 ******************************************************************************/

/*!
 * @brief ADC_USR_OFS - ADC USER Offset Correction Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The USER ADC Offset Correction Register (USR_OFS) contains the user defined
 * offset error correction value used in the conversion result error correction
 * algorithm.
 */
/*!
 * @name Constants and macros for entire ADC_USR_OFS register
 */
/*@{*/
#define ADC_RD_USR_OFS(base)     (ADC_USR_OFS_REG(base))
#define ADC_WR_USR_OFS(base, value) (ADC_USR_OFS_REG(base) = (value))
#define ADC_RMW_USR_OFS(base, mask, value) (ADC_WR_USR_OFS(base, (ADC_RD_USR_OFS(base) & ~(mask)) | (value)))
#define ADC_SET_USR_OFS(base, value) (ADC_WR_USR_OFS(base, ADC_RD_USR_OFS(base) |  (value)))
#define ADC_CLR_USR_OFS(base, value) (ADC_WR_USR_OFS(base, ADC_RD_USR_OFS(base) & ~(value)))
#define ADC_TOG_USR_OFS(base, value) (ADC_WR_USR_OFS(base, ADC_RD_USR_OFS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_USR_OFS bitfields
 */

/*!
 * @name Register ADC_USR_OFS, field USR_OFS[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ADC_USR_OFS_USR_OFS field. */
#define ADC_RD_USR_OFS_USR_OFS(base) ((ADC_USR_OFS_REG(base) & ADC_USR_OFS_USR_OFS_MASK) >> ADC_USR_OFS_USR_OFS_SHIFT)
#define ADC_BRD_USR_OFS_USR_OFS(base) (ADC_RD_USR_OFS_USR_OFS(base))

/*! @brief Set the USR_OFS field to a new value. */
#define ADC_WR_USR_OFS_USR_OFS(base, value) (ADC_RMW_USR_OFS(base, ADC_USR_OFS_USR_OFS_MASK, ADC_USR_OFS_USR_OFS(value)))
#define ADC_BWR_USR_OFS_USR_OFS(base, value) (ADC_WR_USR_OFS_USR_OFS(base, value))
/*@}*/

/*******************************************************************************
 * ADC_XOFS - ADC X Offset Correction Register
 ******************************************************************************/

/*!
 * @brief ADC_XOFS - ADC X Offset Correction Register (RW)
 *
 * Reset value: 0x00000006U
 *
 * The ADC X Offset Correction Register (XOFS) contains the X offset for offset
 * error correction used in the conversion result error correction algorithm.
 */
/*!
 * @name Constants and macros for entire ADC_XOFS register
 */
/*@{*/
#define ADC_RD_XOFS(base)        (ADC_XOFS_REG(base))
#define ADC_WR_XOFS(base, value) (ADC_XOFS_REG(base) = (value))
#define ADC_RMW_XOFS(base, mask, value) (ADC_WR_XOFS(base, (ADC_RD_XOFS(base) & ~(mask)) | (value)))
#define ADC_SET_XOFS(base, value) (ADC_WR_XOFS(base, ADC_RD_XOFS(base) |  (value)))
#define ADC_CLR_XOFS(base, value) (ADC_WR_XOFS(base, ADC_RD_XOFS(base) & ~(value)))
#define ADC_TOG_XOFS(base, value) (ADC_WR_XOFS(base, ADC_RD_XOFS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_XOFS bitfields
 */

/*!
 * @name Register ADC_XOFS, field OFS[5:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ADC_XOFS_OFS field. */
#define ADC_RD_XOFS_OFS(base) ((ADC_XOFS_REG(base) & ADC_XOFS_OFS_MASK) >> ADC_XOFS_OFS_SHIFT)
#define ADC_BRD_XOFS_OFS(base) (ADC_RD_XOFS_OFS(base))

/*! @brief Set the OFS field to a new value. */
#define ADC_WR_XOFS_OFS(base, value) (ADC_RMW_XOFS(base, ADC_XOFS_OFS_MASK, ADC_XOFS_OFS(value)))
#define ADC_BWR_XOFS_OFS(base, value) (ADC_WR_XOFS_OFS(base, value))
/*@}*/

