nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * ADC_YOFS - ADC Y Offset Correction Register
 ******************************************************************************/

/*!
 * @brief ADC_YOFS - ADC Y Offset Correction Register (RW)
 *
 * Reset value: 0x00000037U
 *
 * The ADC Y Offset Correction Register (YOFS) contains the offset for error
 * correction used in the conversion result error correction algorithm.
 */
/*!
 * @name Constants and macros for entire ADC_YOFS register
 */
/*@{*/
#define ADC_RD_YOFS(base)        (ADC_YOFS_REG(base))
#define ADC_WR_YOFS(base, value) (ADC_YOFS_REG(base) = (value))
#define ADC_RMW_YOFS(base, mask, value) (ADC_WR_YOFS(base, (ADC_RD_YOFS(base) & ~(mask)) | (value)))
#define ADC_SET_YOFS(base, value) (ADC_WR_YOFS(base, ADC_RD_YOFS(base) |  (value)))
#define ADC_CLR_YOFS(base, value) (ADC_WR_YOFS(base, ADC_RD_YOFS(base) & ~(value)))
#define ADC_TOG_YOFS(base, value) (ADC_WR_YOFS(base, ADC_RD_YOFS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_YOFS bitfields
 */

/*!
 * @name Register ADC_YOFS, field YOFS[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ADC_YOFS_YOFS field. */
#define ADC_RD_YOFS_YOFS(base) ((ADC_YOFS_REG(base) & ADC_YOFS_YOFS_MASK) >> ADC_YOFS_YOFS_SHIFT)
#define ADC_BRD_YOFS_YOFS(base) (ADC_RD_YOFS_YOFS(base))

/*! @brief Set the YOFS field to a new value. */
#define ADC_WR_YOFS_YOFS(base, value) (ADC_RMW_YOFS(base, ADC_YOFS_YOFS_MASK, ADC_YOFS_YOFS(value)))
#define ADC_BWR_YOFS_YOFS(base, value) (ADC_WR_YOFS_YOFS(base, value))
/*@}*/

/*******************************************************************************
 * ADC_G - ADC Gain Register
 ******************************************************************************/

/*!
 * @brief ADC_G - ADC Gain Register (RW)
 *
 * Reset value: 0x000002F0U
 *
 * The Gain Register (G) contains the gain error correction for the overall
 * conversion. G, a 12-bit real number in binary format, is the gain adjustment
 * factor. This register value is determined and uploaded by the calibration algorithm.
 */
/*!
 * @name Constants and macros for entire ADC_G register
 */
/*@{*/
#define ADC_RD_G(base)           (ADC_G_REG(base))
#define ADC_WR_G(base, value)    (ADC_G_REG(base) = (value))
#define ADC_RMW_G(base, mask, value) (ADC_WR_G(base, (ADC_RD_G(base) & ~(mask)) | (value)))
#define ADC_SET_G(base, value)   (ADC_WR_G(base, ADC_RD_G(base) |  (value)))
#define ADC_CLR_G(base, value)   (ADC_WR_G(base, ADC_RD_G(base) & ~(value)))
#define ADC_TOG_G(base, value)   (ADC_WR_G(base, ADC_RD_G(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_G bitfields
 */

/*!
 * @name Register ADC_G, field G[11:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ADC_G_G field. */
#define ADC_RD_G_G(base)     ((ADC_G_REG(base) & ADC_G_G_MASK) >> ADC_G_G_SHIFT)
#define ADC_BRD_G_G(base)    (ADC_RD_G_G(base))

/*! @brief Set the G field to a new value. */
#define ADC_WR_G_G(base, value) (ADC_RMW_G(base, ADC_G_G_MASK, ADC_G_G(value)))
#define ADC_BWR_G_G(base, value) (ADC_WR_G_G(base, value))
/*@}*/

/*******************************************************************************
 * ADC_UG - ADC User Gain Register
 ******************************************************************************/

/*!
 * @brief ADC_UG - ADC User Gain Register (RW)
 *
 * Reset value: 0x00000004U
 *
 * The User Gain Register (UG) contains the user gain error correction. Allow
 * user to adjust the final calibration gain value.
 */
/*!
 * @name Constants and macros for entire ADC_UG register
 */
/*@{*/
#define ADC_RD_UG(base)          (ADC_UG_REG(base))
#define ADC_WR_UG(base, value)   (ADC_UG_REG(base) = (value))
#define ADC_RMW_UG(base, mask, value) (ADC_WR_UG(base, (ADC_RD_UG(base) & ~(mask)) | (value)))
#define ADC_SET_UG(base, value)  (ADC_WR_UG(base, ADC_RD_UG(base) |  (value)))
#define ADC_CLR_UG(base, value)  (ADC_WR_UG(base, ADC_RD_UG(base) & ~(value)))
#define ADC_TOG_UG(base, value)  (ADC_WR_UG(base, ADC_RD_UG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_UG bitfields
 */

/*!
 * @name Register ADC_UG, field UG[9:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ADC_UG_UG field. */
#define ADC_RD_UG_UG(base)   ((ADC_UG_REG(base) & ADC_UG_UG_MASK) >> ADC_UG_UG_SHIFT)
#define ADC_BRD_UG_UG(base)  (ADC_RD_UG_UG(base))

/*! @brief Set the UG field to a new value. */
#define ADC_WR_UG_UG(base, value) (ADC_RMW_UG(base, ADC_UG_UG_MASK, ADC_UG_UG(value)))
#define ADC_BWR_UG_UG(base, value) (ADC_WR_UG_UG(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CLPS - ADC General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLPS - ADC General Calibration Value Register (RW)
 *
 * Reset value: 0x0000002EU
 *
 * The General Calibration Value Registers (CLPx) contain calibration
 * information that is generated by the calibration function. These registers contain seven
 * calibration values of varying widths: CLP0[5:0], CLP1[6:0], CLP2[7:0],
 * CLP3[8:0], CLP4[9:0], CLPS[5:0], and CLPD[5:0]. CLPx are automatically set when the
 * self-calibration sequence is done, that is, CAL is cleared. If these registers
 * are written by the user after calibration, the linearity error specifications
 * may not be met.
 */
/*!
 * @name Constants and macros for entire ADC_CLPS register
 */
/*@{*/
#define ADC_RD_CLPS(base)        (ADC_CLPS_REG(base))
#define ADC_WR_CLPS(base, value) (ADC_CLPS_REG(base) = (value))
#define ADC_RMW_CLPS(base, mask, value) (ADC_WR_CLPS(base, (ADC_RD_CLPS(base) & ~(mask)) | (value)))
#define ADC_SET_CLPS(base, value) (ADC_WR_CLPS(base, ADC_RD_CLPS(base) |  (value)))
#define ADC_CLR_CLPS(base, value) (ADC_WR_CLPS(base, ADC_RD_CLPS(base) & ~(value)))
#define ADC_TOG_CLPS(base, value) (ADC_WR_CLPS(base, ADC_RD_CLPS(base) ^  (value)))
/*@}*/

