nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual ADC_CLP0 bitfields
 */

/*!
 * @name Register ADC_CLP0, field CLP0[7:0] (RW)
 *
 * Calibration Value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLP0_CLP0 field. */
#define ADC_RD_CLP0_CLP0(base) ((ADC_CLP0_REG(base) & ADC_CLP0_CLP0_MASK) >> ADC_CLP0_CLP0_SHIFT)
#define ADC_BRD_CLP0_CLP0(base) (ADC_RD_CLP0_CLP0(base))

/*! @brief Set the CLP0 field to a new value. */
#define ADC_WR_CLP0_CLP0(base, value) (ADC_RMW_CLP0(base, ADC_CLP0_CLP0_MASK, ADC_CLP0_CLP0(value)))
#define ADC_BWR_CLP0_CLP0(base, value) (ADC_WR_CLP0_CLP0(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CLPX - ADC Plus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLPX - ADC Plus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x00000080U
 *
 * For more information, see CLPD register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLPX register
 */
/*@{*/
#define ADC_RD_CLPX(base)        (ADC_CLPX_REG(base))
#define ADC_WR_CLPX(base, value) (ADC_CLPX_REG(base) = (value))
#define ADC_RMW_CLPX(base, mask, value) (ADC_WR_CLPX(base, (ADC_RD_CLPX(base) & ~(mask)) | (value)))
#define ADC_SET_CLPX(base, value) (ADC_WR_CLPX(base, ADC_RD_CLPX(base) |  (value)))
#define ADC_CLR_CLPX(base, value) (ADC_WR_CLPX(base, ADC_RD_CLPX(base) & ~(value)))
#define ADC_TOG_CLPX(base, value) (ADC_WR_CLPX(base, ADC_RD_CLPX(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLPX bitfields
 */

/*!
 * @name Register ADC_CLPX, field CLPX[6:0] (RW)
 *
 * Calibration Value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLPX_CLPX field. */
#define ADC_RD_CLPX_CLPX(base) ((ADC_CLPX_REG(base) & ADC_CLPX_CLPX_MASK) >> ADC_CLPX_CLPX_SHIFT)
#define ADC_BRD_CLPX_CLPX(base) (ADC_RD_CLPX_CLPX(base))

/*! @brief Set the CLPX field to a new value. */
#define ADC_WR_CLPX_CLPX(base, value) (ADC_RMW_CLPX(base, ADC_CLPX_CLPX_MASK, ADC_CLPX_CLPX(value)))
#define ADC_BWR_CLPX_CLPX(base, value) (ADC_WR_CLPX_CLPX(base, value))
/*@}*/

/*!
 * @name Register ADC_CLPX, field CLPXEN[7] (RW)
 *
 * Controls how comparison of CLPX is evaluated to be a pass or fail.
 */
/*@{*/
/*! @brief Read current value of the ADC_CLPX_CLPXEN field. */
#define ADC_RD_CLPX_CLPXEN(base) ((ADC_CLPX_REG(base) & ADC_CLPX_CLPXEN_MASK) >> ADC_CLPX_CLPXEN_SHIFT)
#define ADC_BRD_CLPX_CLPXEN(base) (BITBAND_ACCESS32(&ADC_CLPX_REG(base), ADC_CLPX_CLPXEN_SHIFT))

/*! @brief Set the CLPXEN field to a new value. */
#define ADC_WR_CLPX_CLPXEN(base, value) (ADC_RMW_CLPX(base, ADC_CLPX_CLPXEN_MASK, ADC_CLPX_CLPXEN(value)))
#define ADC_BWR_CLPX_CLPXEN(base, value) (BITBAND_ACCESS32(&ADC_CLPX_REG(base), ADC_CLPX_CLPXEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ADC_CLP9 - ADC Plus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLP9 - ADC Plus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * For more information, see CLPD register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLP9 register
 */
/*@{*/
#define ADC_RD_CLP9(base)        (ADC_CLP9_REG(base))
#define ADC_WR_CLP9(base, value) (ADC_CLP9_REG(base) = (value))
#define ADC_RMW_CLP9(base, mask, value) (ADC_WR_CLP9(base, (ADC_RD_CLP9(base) & ~(mask)) | (value)))
#define ADC_SET_CLP9(base, value) (ADC_WR_CLP9(base, ADC_RD_CLP9(base) |  (value)))
#define ADC_CLR_CLP9(base, value) (ADC_WR_CLP9(base, ADC_RD_CLP9(base) & ~(value)))
#define ADC_TOG_CLP9(base, value) (ADC_WR_CLP9(base, ADC_RD_CLP9(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLP9 bitfields
 */

/*!
 * @name Register ADC_CLP9, field CLP9[6:0] (RW)
 *
 * Calibration Value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLP9_CLP9 field. */
#define ADC_RD_CLP9_CLP9(base) ((ADC_CLP9_REG(base) & ADC_CLP9_CLP9_MASK) >> ADC_CLP9_CLP9_SHIFT)
#define ADC_BRD_CLP9_CLP9(base) (ADC_RD_CLP9_CLP9(base))

/*! @brief Set the CLP9 field to a new value. */
#define ADC_WR_CLP9_CLP9(base, value) (ADC_RMW_CLP9(base, ADC_CLP9_CLP9_MASK, ADC_CLP9_CLP9(value)))
#define ADC_BWR_CLP9_CLP9(base, value) (ADC_WR_CLP9_CLP9(base, value))
/*@}*/

/*!
 * @name Register ADC_CLP9, field CLP9EN[7] (RW)
 *
 * Controls how comparison of CLP9 is evaluated to be a pass or fail.
 */
/*@{*/
/*! @brief Read current value of the ADC_CLP9_CLP9EN field. */
#define ADC_RD_CLP9_CLP9EN(base) ((ADC_CLP9_REG(base) & ADC_CLP9_CLP9EN_MASK) >> ADC_CLP9_CLP9EN_SHIFT)
#define ADC_BRD_CLP9_CLP9EN(base) (BITBAND_ACCESS32(&ADC_CLP9_REG(base), ADC_CLP9_CLP9EN_SHIFT))

/*! @brief Set the CLP9EN field to a new value. */
#define ADC_WR_CLP9_CLP9EN(base, value) (ADC_RMW_CLP9(base, ADC_CLP9_CLP9EN_MASK, ADC_CLP9_CLP9EN(value)))
#define ADC_BWR_CLP9_CLP9EN(base, value) (BITBAND_ACCESS32(&ADC_CLP9_REG(base), ADC_CLP9_CLP9EN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ADC_CLPS_OFS - ADC General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLPS_OFS - ADC General Calibration Value Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The General Calibration Value Registers (CLPx) contain calibration
 * information that is generated by the calibration function. These registers contain seven
 * calibration values of varying widths: CLP0[5:0], CLP1[6:0], CLP2[7:0],
 * CLP3[8:0], CLP4[9:0], CLPS[5:0], and CLPD[5:0]. CLPx are automatically set when the
 * self-calibration sequence is done, that is, CAL is cleared. If these registers
 * are written by the user after calibration, the linearity error specifications
 * may not be met.
 */
/*!
 * @name Constants and macros for entire ADC_CLPS_OFS register
 */
/*@{*/
#define ADC_RD_CLPS_OFS(base)    (ADC_CLPS_OFS_REG(base))
#define ADC_WR_CLPS_OFS(base, value) (ADC_CLPS_OFS_REG(base) = (value))
#define ADC_RMW_CLPS_OFS(base, mask, value) (ADC_WR_CLPS_OFS(base, (ADC_RD_CLPS_OFS(base) & ~(mask)) | (value)))
#define ADC_SET_CLPS_OFS(base, value) (ADC_WR_CLPS_OFS(base, ADC_RD_CLPS_OFS(base) |  (value)))
#define ADC_CLR_CLPS_OFS(base, value) (ADC_WR_CLPS_OFS(base, ADC_RD_CLPS_OFS(base) & ~(value)))
#define ADC_TOG_CLPS_OFS(base, value) (ADC_WR_CLPS_OFS(base, ADC_RD_CLPS_OFS(base) ^  (value)))
/*@}*/

