nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual ADC_CLPS_OFS bitfields
 */

/*!
 * @name Register ADC_CLPS_OFS, field CLPS_OFS[3:0] (RW)
 *
 * Capacitor offset correction value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLPS_OFS_CLPS_OFS field. */
#define ADC_RD_CLPS_OFS_CLPS_OFS(base) ((ADC_CLPS_OFS_REG(base) & ADC_CLPS_OFS_CLPS_OFS_MASK) >> ADC_CLPS_OFS_CLPS_OFS_SHIFT)
#define ADC_BRD_CLPS_OFS_CLPS_OFS(base) (ADC_RD_CLPS_OFS_CLPS_OFS(base))

/*! @brief Set the CLPS_OFS field to a new value. */
#define ADC_WR_CLPS_OFS_CLPS_OFS(base, value) (ADC_RMW_CLPS_OFS(base, ADC_CLPS_OFS_CLPS_OFS_MASK, ADC_CLPS_OFS_CLPS_OFS(value)))
#define ADC_BWR_CLPS_OFS_CLPS_OFS(base, value) (ADC_WR_CLPS_OFS_CLPS_OFS(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CLP3_OFS - ADC Plus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLP3_OFS - ADC Plus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * For more information, see CLP3 register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLP3_OFS register
 */
/*@{*/
#define ADC_RD_CLP3_OFS(base)    (ADC_CLP3_OFS_REG(base))
#define ADC_WR_CLP3_OFS(base, value) (ADC_CLP3_OFS_REG(base) = (value))
#define ADC_RMW_CLP3_OFS(base, mask, value) (ADC_WR_CLP3_OFS(base, (ADC_RD_CLP3_OFS(base) & ~(mask)) | (value)))
#define ADC_SET_CLP3_OFS(base, value) (ADC_WR_CLP3_OFS(base, ADC_RD_CLP3_OFS(base) |  (value)))
#define ADC_CLR_CLP3_OFS(base, value) (ADC_WR_CLP3_OFS(base, ADC_RD_CLP3_OFS(base) & ~(value)))
#define ADC_TOG_CLP3_OFS(base, value) (ADC_WR_CLP3_OFS(base, ADC_RD_CLP3_OFS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLP3_OFS bitfields
 */

/*!
 * @name Register ADC_CLP3_OFS, field CLP3_OFS[3:0] (RW)
 *
 * Capacitor offset correction value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLP3_OFS_CLP3_OFS field. */
#define ADC_RD_CLP3_OFS_CLP3_OFS(base) ((ADC_CLP3_OFS_REG(base) & ADC_CLP3_OFS_CLP3_OFS_MASK) >> ADC_CLP3_OFS_CLP3_OFS_SHIFT)
#define ADC_BRD_CLP3_OFS_CLP3_OFS(base) (ADC_RD_CLP3_OFS_CLP3_OFS(base))

/*! @brief Set the CLP3_OFS field to a new value. */
#define ADC_WR_CLP3_OFS_CLP3_OFS(base, value) (ADC_RMW_CLP3_OFS(base, ADC_CLP3_OFS_CLP3_OFS_MASK, ADC_CLP3_OFS_CLP3_OFS(value)))
#define ADC_BWR_CLP3_OFS_CLP3_OFS(base, value) (ADC_WR_CLP3_OFS_CLP3_OFS(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CLP2_OFS - ADC Plus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLP2_OFS - ADC Plus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * For more information, see CLP2 register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLP2_OFS register
 */
/*@{*/
#define ADC_RD_CLP2_OFS(base)    (ADC_CLP2_OFS_REG(base))
#define ADC_WR_CLP2_OFS(base, value) (ADC_CLP2_OFS_REG(base) = (value))
#define ADC_RMW_CLP2_OFS(base, mask, value) (ADC_WR_CLP2_OFS(base, (ADC_RD_CLP2_OFS(base) & ~(mask)) | (value)))
#define ADC_SET_CLP2_OFS(base, value) (ADC_WR_CLP2_OFS(base, ADC_RD_CLP2_OFS(base) |  (value)))
#define ADC_CLR_CLP2_OFS(base, value) (ADC_WR_CLP2_OFS(base, ADC_RD_CLP2_OFS(base) & ~(value)))
#define ADC_TOG_CLP2_OFS(base, value) (ADC_WR_CLP2_OFS(base, ADC_RD_CLP2_OFS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLP2_OFS bitfields
 */

/*!
 * @name Register ADC_CLP2_OFS, field CLP2_OFS[3:0] (RW)
 *
 * Capacitor offset correction value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLP2_OFS_CLP2_OFS field. */
#define ADC_RD_CLP2_OFS_CLP2_OFS(base) ((ADC_CLP2_OFS_REG(base) & ADC_CLP2_OFS_CLP2_OFS_MASK) >> ADC_CLP2_OFS_CLP2_OFS_SHIFT)
#define ADC_BRD_CLP2_OFS_CLP2_OFS(base) (ADC_RD_CLP2_OFS_CLP2_OFS(base))

/*! @brief Set the CLP2_OFS field to a new value. */
#define ADC_WR_CLP2_OFS_CLP2_OFS(base, value) (ADC_RMW_CLP2_OFS(base, ADC_CLP2_OFS_CLP2_OFS_MASK, ADC_CLP2_OFS_CLP2_OFS(value)))
#define ADC_BWR_CLP2_OFS_CLP2_OFS(base, value) (ADC_WR_CLP2_OFS_CLP2_OFS(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CLP1_OFS - ADC Plus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLP1_OFS - ADC Plus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * For more information, see CLP1 register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLP1_OFS register
 */
/*@{*/
#define ADC_RD_CLP1_OFS(base)    (ADC_CLP1_OFS_REG(base))
#define ADC_WR_CLP1_OFS(base, value) (ADC_CLP1_OFS_REG(base) = (value))
#define ADC_RMW_CLP1_OFS(base, mask, value) (ADC_WR_CLP1_OFS(base, (ADC_RD_CLP1_OFS(base) & ~(mask)) | (value)))
#define ADC_SET_CLP1_OFS(base, value) (ADC_WR_CLP1_OFS(base, ADC_RD_CLP1_OFS(base) |  (value)))
#define ADC_CLR_CLP1_OFS(base, value) (ADC_WR_CLP1_OFS(base, ADC_RD_CLP1_OFS(base) & ~(value)))
#define ADC_TOG_CLP1_OFS(base, value) (ADC_WR_CLP1_OFS(base, ADC_RD_CLP1_OFS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLP1_OFS bitfields
 */

/*!
 * @name Register ADC_CLP1_OFS, field CLP1_OFS[3:0] (RW)
 *
 * Capacitor offset correction value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLP1_OFS_CLP1_OFS field. */
#define ADC_RD_CLP1_OFS_CLP1_OFS(base) ((ADC_CLP1_OFS_REG(base) & ADC_CLP1_OFS_CLP1_OFS_MASK) >> ADC_CLP1_OFS_CLP1_OFS_SHIFT)
#define ADC_BRD_CLP1_OFS_CLP1_OFS(base) (ADC_RD_CLP1_OFS_CLP1_OFS(base))

/*! @brief Set the CLP1_OFS field to a new value. */
#define ADC_WR_CLP1_OFS_CLP1_OFS(base, value) (ADC_RMW_CLP1_OFS(base, ADC_CLP1_OFS_CLP1_OFS_MASK, ADC_CLP1_OFS_CLP1_OFS(value)))
#define ADC_BWR_CLP1_OFS_CLP1_OFS(base, value) (ADC_WR_CLP1_OFS_CLP1_OFS(base, value))
/*@}*/

