nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * ADC_CLP0_OFS - ADC Plus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLP0_OFS - ADC Plus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * For more information, see CLPD register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLP0_OFS register
 */
/*@{*/
#define ADC_RD_CLP0_OFS(base)    (ADC_CLP0_OFS_REG(base))
#define ADC_WR_CLP0_OFS(base, value) (ADC_CLP0_OFS_REG(base) = (value))
#define ADC_RMW_CLP0_OFS(base, mask, value) (ADC_WR_CLP0_OFS(base, (ADC_RD_CLP0_OFS(base) & ~(mask)) | (value)))
#define ADC_SET_CLP0_OFS(base, value) (ADC_WR_CLP0_OFS(base, ADC_RD_CLP0_OFS(base) |  (value)))
#define ADC_CLR_CLP0_OFS(base, value) (ADC_WR_CLP0_OFS(base, ADC_RD_CLP0_OFS(base) & ~(value)))
#define ADC_TOG_CLP0_OFS(base, value) (ADC_WR_CLP0_OFS(base, ADC_RD_CLP0_OFS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLP0_OFS bitfields
 */

/*!
 * @name Register ADC_CLP0_OFS, field CLP0_OFS[3:0] (RW)
 *
 * Capacitor offset correction value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLP0_OFS_CLP0_OFS field. */
#define ADC_RD_CLP0_OFS_CLP0_OFS(base) ((ADC_CLP0_OFS_REG(base) & ADC_CLP0_OFS_CLP0_OFS_MASK) >> ADC_CLP0_OFS_CLP0_OFS_SHIFT)
#define ADC_BRD_CLP0_OFS_CLP0_OFS(base) (ADC_RD_CLP0_OFS_CLP0_OFS(base))

/*! @brief Set the CLP0_OFS field to a new value. */
#define ADC_WR_CLP0_OFS_CLP0_OFS(base, value) (ADC_RMW_CLP0_OFS(base, ADC_CLP0_OFS_CLP0_OFS_MASK, ADC_CLP0_OFS_CLP0_OFS(value)))
#define ADC_BWR_CLP0_OFS_CLP0_OFS(base, value) (ADC_WR_CLP0_OFS_CLP0_OFS(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CLPX_OFS - ADC Plus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLPX_OFS - ADC Plus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x00000442U
 *
 * For more information, see CLPX_OFS register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLPX_OFS register
 */
/*@{*/
#define ADC_RD_CLPX_OFS(base)    (ADC_CLPX_OFS_REG(base))
#define ADC_WR_CLPX_OFS(base, value) (ADC_CLPX_OFS_REG(base) = (value))
#define ADC_RMW_CLPX_OFS(base, mask, value) (ADC_WR_CLPX_OFS(base, (ADC_RD_CLPX_OFS(base) & ~(mask)) | (value)))
#define ADC_SET_CLPX_OFS(base, value) (ADC_WR_CLPX_OFS(base, ADC_RD_CLPX_OFS(base) |  (value)))
#define ADC_CLR_CLPX_OFS(base, value) (ADC_WR_CLPX_OFS(base, ADC_RD_CLPX_OFS(base) & ~(value)))
#define ADC_TOG_CLPX_OFS(base, value) (ADC_WR_CLPX_OFS(base, ADC_RD_CLPX_OFS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLPX_OFS bitfields
 */

/*!
 * @name Register ADC_CLPX_OFS, field CLPX_OFS[11:0] (RW)
 *
 * Capacitor offset correction value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLPX_OFS_CLPX_OFS field. */
#define ADC_RD_CLPX_OFS_CLPX_OFS(base) ((ADC_CLPX_OFS_REG(base) & ADC_CLPX_OFS_CLPX_OFS_MASK) >> ADC_CLPX_OFS_CLPX_OFS_SHIFT)
#define ADC_BRD_CLPX_OFS_CLPX_OFS(base) (ADC_RD_CLPX_OFS_CLPX_OFS(base))

/*! @brief Set the CLPX_OFS field to a new value. */
#define ADC_WR_CLPX_OFS_CLPX_OFS(base, value) (ADC_RMW_CLPX_OFS(base, ADC_CLPX_OFS_CLPX_OFS_MASK, ADC_CLPX_OFS_CLPX_OFS(value)))
#define ADC_BWR_CLPX_OFS_CLPX_OFS(base, value) (ADC_WR_CLPX_OFS_CLPX_OFS(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CLP9_OFS - ADC Plus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief ADC_CLP9_OFS - ADC Plus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x00000243U
 *
 * For more information, see CLP9_OFS register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLP9_OFS register
 */
/*@{*/
#define ADC_RD_CLP9_OFS(base)    (ADC_CLP9_OFS_REG(base))
#define ADC_WR_CLP9_OFS(base, value) (ADC_CLP9_OFS_REG(base) = (value))
#define ADC_RMW_CLP9_OFS(base, mask, value) (ADC_WR_CLP9_OFS(base, (ADC_RD_CLP9_OFS(base) & ~(mask)) | (value)))
#define ADC_SET_CLP9_OFS(base, value) (ADC_WR_CLP9_OFS(base, ADC_RD_CLP9_OFS(base) |  (value)))
#define ADC_CLR_CLP9_OFS(base, value) (ADC_WR_CLP9_OFS(base, ADC_RD_CLP9_OFS(base) & ~(value)))
#define ADC_TOG_CLP9_OFS(base, value) (ADC_WR_CLP9_OFS(base, ADC_RD_CLP9_OFS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLP9_OFS bitfields
 */

/*!
 * @name Register ADC_CLP9_OFS, field CLP9_OFS[11:0] (RW)
 *
 * Capacitor offset correction value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLP9_OFS_CLP9_OFS field. */
#define ADC_RD_CLP9_OFS_CLP9_OFS(base) ((ADC_CLP9_OFS_REG(base) & ADC_CLP9_OFS_CLP9_OFS_MASK) >> ADC_CLP9_OFS_CLP9_OFS_SHIFT)
#define ADC_BRD_CLP9_OFS_CLP9_OFS(base) (ADC_RD_CLP9_OFS_CLP9_OFS(base))

/*! @brief Set the CLP9_OFS field to a new value. */
#define ADC_WR_CLP9_OFS_CLP9_OFS(base, value) (ADC_RMW_CLP9_OFS(base, ADC_CLP9_OFS_CLP9_OFS_MASK, ADC_CLP9_OFS_CLP9_OFS(value)))
#define ADC_BWR_CLP9_OFS_CLP9_OFS(base, value) (ADC_WR_CLP9_OFS_CLP9_OFS(base, value))
/*@}*/

/*
 * S32K144 AIPS
 *
 * AIPS-Lite Bridge
 *
 * Registers defined in this header file:
 * - AIPS_MPRA - Master Privilege Register A
 * - AIPS_PACR - Peripheral Access Control Register
 * - AIPS_OPACR - Off-Platform Peripheral Access Control Register
 * - AIPS_PACRU - Peripheral Access Control Register
 */

#define AIPS_INSTANCE_COUNT (1U) /*!< Number of instances of the AIPS module. */
#define AIPS_IDX (0U) /*!< Instance number for AIPS. */

/*******************************************************************************
 * AIPS_MPRA - Master Privilege Register A
 ******************************************************************************/

/*!
 * @brief AIPS_MPRA - Master Privilege Register A (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MPRA specifies identical 4-bit fields defining the access-privilege level
 * associated with a bus master to various peripherals on the chip. The register
 * provides one field per bus master. At reset, the default value loaded into
 * the MPRA fields is chip-specific. See the chip configuration details for the
 * value of a particular device. A register field that maps to an unimplemented
 * master or peripheral behaves as read-only-zero. Each master is assigned a logical
 * ID from 0 to 15. See the master logical ID assignment table in the
 * chip-specific AIPS information.
 */
/*!
 * @name Constants and macros for entire AIPS_MPRA register
 */
/*@{*/
#define AIPS_RD_MPRA(base)       (AIPS_MPRA_REG(base))
#define AIPS_WR_MPRA(base, value) (AIPS_MPRA_REG(base) = (value))
#define AIPS_RMW_MPRA(base, mask, value) (AIPS_WR_MPRA(base, (AIPS_RD_MPRA(base) & ~(mask)) | (value)))
#define AIPS_SET_MPRA(base, value) (AIPS_WR_MPRA(base, AIPS_RD_MPRA(base) |  (value)))
#define AIPS_CLR_MPRA(base, value) (AIPS_WR_MPRA(base, AIPS_RD_MPRA(base) & ~(value)))
#define AIPS_TOG_MPRA(base, value) (AIPS_WR_MPRA(base, AIPS_RD_MPRA(base) ^  (value)))
/*@}*/

