nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * AIPS_PACR - Peripheral Access Control Register
 ******************************************************************************/

/*!
 * @brief AIPS_PACR - Peripheral Access Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Each PACR register consists of eight 4-bit PACR fields. Each PACR field
 * defines the access levels for a particular on-platform peripheral. The peripheral
 * assignment to each PACR field is defined by the memory map slot of the
 * peripheral. See the chip-specific AIPS information for the field assignment of a
 * particular peripheral. Every PACR field to which no peripheral is assigned is
 * reserved. Reads to reserved locations return zeros, and writes are ignored. The
 * following table shows the location of each peripheral slot's PACR field in the
 * PACR registers. Offset Register [31:28] [27:24] [23:20] [19:16] [15:12] [11:8]
 * [7:4] [3:0] 0x20 PACRA PACR0 PACR1 PACR2 PACR3 PACR4 PACR5 PACR6 PACR7 0x24
 * PACRB PACR8 PACR9 PACR10 PACR11 PACR12 PACR13 PACR14 PACR15 0x28 PACRC PACR16
 * PACR17 PACR18 PACR19 PACR20 PACR21 PACR22 PACR23 0x2C PACRD PACR24 PACR25 PACR26
 * PACR27 PACR28 PACR29 PACR30 PACR31
 */
/*!
 * @name Constants and macros for entire AIPS_PACR register
 */
/*@{*/
#define AIPS_RD_PACR(base, index) (AIPS_PACR_REG(base, index))
#define AIPS_WR_PACR(base, index, value) (AIPS_PACR_REG(base, index) = (value))
#define AIPS_RMW_PACR(base, index, mask, value) (AIPS_WR_PACR(base, index, (AIPS_RD_PACR(base, index) & ~(mask)) | (value)))
#define AIPS_SET_PACR(base, index, value) (AIPS_WR_PACR(base, index, AIPS_RD_PACR(base, index) |  (value)))
#define AIPS_CLR_PACR(base, index, value) (AIPS_WR_PACR(base, index, AIPS_RD_PACR(base, index) & ~(value)))
#define AIPS_TOG_PACR(base, index, value) (AIPS_WR_PACR(base, index, AIPS_RD_PACR(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual AIPS_PACR bitfields
 */

/*!
 * @name Register AIPS_PACR, field TP7[0] (RW)
 *
 * Determines whether the peripheral allows accesses from an untrusted master.
 * When this field is set and an access is attempted by an untrusted master, the
 * access terminates with an error response and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - Accesses from an untrusted master are allowed.
 * - 0b1 - Accesses from an untrusted master are not allowed.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACR_TP7 field. */
#define AIPS_RD_PACR_TP7(base, index) ((AIPS_PACR_REG(base, index) & AIPS_PACR_TP7_MASK) >> AIPS_PACR_TP7_SHIFT)
#define AIPS_BRD_PACR_TP7(base, index) (BITBAND_ACCESS32(&AIPS_PACR_REG(base, index), AIPS_PACR_TP7_SHIFT))

/*! @brief Set the TP7 field to a new value. */
#define AIPS_WR_PACR_TP7(base, index, value) (AIPS_RMW_PACR(base, index, AIPS_PACR_TP7_MASK, AIPS_PACR_TP7(value)))
#define AIPS_BWR_PACR_TP7(base, index, value) (BITBAND_ACCESS32(&AIPS_PACR_REG(base, index), AIPS_PACR_TP7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_PACR, field WP7[1] (RW)
 *
 * Determines whether the peripheral allows write accesses. When this field is
 * set and a write access is attempted, access terminates with an error response
 * and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - This peripheral allows write accesses.
 * - 0b1 - This peripheral is write protected.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACR_WP7 field. */
#define AIPS_RD_PACR_WP7(base, index) ((AIPS_PACR_REG(base, index) & AIPS_PACR_WP7_MASK) >> AIPS_PACR_WP7_SHIFT)
#define AIPS_BRD_PACR_WP7(base, index) (BITBAND_ACCESS32(&AIPS_PACR_REG(base, index), AIPS_PACR_WP7_SHIFT))

/*! @brief Set the WP7 field to a new value. */
#define AIPS_WR_PACR_WP7(base, index, value) (AIPS_RMW_PACR(base, index, AIPS_PACR_WP7_MASK, AIPS_PACR_WP7(value)))
#define AIPS_BWR_PACR_WP7(base, index, value) (BITBAND_ACCESS32(&AIPS_PACR_REG(base, index), AIPS_PACR_WP7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_PACR, field SP7[2] (RW)
 *
 * Determines whether the peripheral requires supervisor privilege level for
 * accesses. When this field is set, the master privilege level must indicate the
 * supervisor access attribute, and the MPRx[MPLn] control field for the master
 * must be set. If not, access terminates with an error response and no peripheral
 * access initiates.
 *
 * Values:
 * - 0b0 - This peripheral does not require supervisor privilege level for
 *     accesses.
 * - 0b1 - This peripheral requires supervisor privilege level for accesses.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACR_SP7 field. */
#define AIPS_RD_PACR_SP7(base, index) ((AIPS_PACR_REG(base, index) & AIPS_PACR_SP7_MASK) >> AIPS_PACR_SP7_SHIFT)
#define AIPS_BRD_PACR_SP7(base, index) (BITBAND_ACCESS32(&AIPS_PACR_REG(base, index), AIPS_PACR_SP7_SHIFT))

/*! @brief Set the SP7 field to a new value. */
#define AIPS_WR_PACR_SP7(base, index, value) (AIPS_RMW_PACR(base, index, AIPS_PACR_SP7_MASK, AIPS_PACR_SP7(value)))
#define AIPS_BWR_PACR_SP7(base, index, value) (BITBAND_ACCESS32(&AIPS_PACR_REG(base, index), AIPS_PACR_SP7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_PACR, field TP6[4] (RW)
 *
 * Determines whether the peripheral allows accesses from an untrusted master.
 * When this field is set and an access is attempted by an untrusted master, the
 * access terminates with an error response and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - Accesses from an untrusted master are allowed.
 * - 0b1 - Accesses from an untrusted master are not allowed.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACR_TP6 field. */
#define AIPS_RD_PACR_TP6(base, index) ((AIPS_PACR_REG(base, index) & AIPS_PACR_TP6_MASK) >> AIPS_PACR_TP6_SHIFT)
#define AIPS_BRD_PACR_TP6(base, index) (BITBAND_ACCESS32(&AIPS_PACR_REG(base, index), AIPS_PACR_TP6_SHIFT))

/*! @brief Set the TP6 field to a new value. */
#define AIPS_WR_PACR_TP6(base, index, value) (AIPS_RMW_PACR(base, index, AIPS_PACR_TP6_MASK, AIPS_PACR_TP6(value)))
#define AIPS_BWR_PACR_TP6(base, index, value) (BITBAND_ACCESS32(&AIPS_PACR_REG(base, index), AIPS_PACR_TP6_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_PACR, field WP6[5] (RW)
 *
 * Determines whether the peripheral allows write accesses. When this field is
 * set and a write access is attempted, access terminates with an error response
 * and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - This peripheral allows write accesses.
 * - 0b1 - This peripheral is write protected.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACR_WP6 field. */
#define AIPS_RD_PACR_WP6(base, index) ((AIPS_PACR_REG(base, index) & AIPS_PACR_WP6_MASK) >> AIPS_PACR_WP6_SHIFT)
#define AIPS_BRD_PACR_WP6(base, index) (BITBAND_ACCESS32(&AIPS_PACR_REG(base, index), AIPS_PACR_WP6_SHIFT))

