nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * AIPS_OPACR - Off-Platform Peripheral Access Control Register
 ******************************************************************************/

/*!
 * @brief AIPS_OPACR - Off-Platform Peripheral Access Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Each OPACR register consists of eight 4-bit OPACR fields. Each OPACR field
 * defines the access levels for a particular off-platform peripheral. The
 * peripheral assignment to each OPACR field is defined by the memory map slot of the
 * peripheral. See the chip-specific AIPS information for the field assignment of a
 * particular peripheral. Every OPACR field to which no peripheral is assigned is
 * reserved. Reads to reserved locations return zeros, and writes are ignored.
 * The following table shows the location of each peripheral slot's OPACR field in
 * the OPACR registers. Offset Register [31:28] [27:24] [23:20] [19:16] [15:12]
 * [11:8] [7:4] [3:0] 0x40 OPACRA OPACR0 OPACR1 OPACR2 OPACR3 OPACR4 OPACR5
 * OPACR6 OPACR7 0x44 OPACRB OPACR8 OPACR9 OPACR10 OPACR11 OPACR12 OPACR13 OPACR14
 * OPACR15 0x48 OPACRC OPACR16 OPACR17 OPACR18 OPACR19 OPACR20 OPACR21 OPACR22
 * OPACR23 0x4C OPACRD OPACR24 OPACR25 OPACR26 OPACR27 OPACR28 OPACR29 OPACR30 OPACR31
 * 0x50 OPACRE OPACR32 OPACR33 OPACR34 OPACR35 OPACR36 OPACR37 OPACR38 OPACR39
 * 0x54 OPACRF OPACR40 OPACR41 OPACR42 OPACR43 OPACR44 OPACR45 OPACR46 OPACR47
 * 0x58 OPACRG OPACR48 OPACR49 OPACR50 OPACR51 OPACR52 OPACR53 OPACR54 OPACR55 0x5C
 * OPACRH OPACR56 OPACR57 OPACR58 OPACR59 OPACR60 OPACR61 OPACR62 OPACR63 0x60
 * OPACRI OPACR64 OPACR65 OPACR66 OPACR67 OPACR68 OPACR69 OPACR70 OPACR71 0x64
 * OPACRJ OPACR72 OPACR73 OPACR74 OPACR75 OPACR76 OPACR77 OPACR78 OPACR79 0x68 OPACRK
 * OPACR80 OPACR81 OPACR82 OPACR83 OPACR84 OPACR85 OPACR86 OPACR87 0x6C OPACRL
 * OPACR88 OPACR89 OPACR90 OPACR91 OPACR92 OPACR93 OPACR94 OPACR95 0x70 OPACRM
 * OPACR96 OPACR97 OPACR98 OPACR99 OPACR100 OPACR101 OPACR102 OPACR103 0x74 OPACRN
 * OPACR104 OPACR105 OPACR106 OPACR107 OPACR108 OPACR109 OPACR110 OPACR111 0x78
 * OPACRO OPACR112 OPACR113 OPACR114 OPACR115 OPACR116 OPACR117 OPACR118 OPACR119
 * 0x7C OPACRP OPACR120 OPACR121 OPACR122 OPACR123 OPACR124 OPACR125 OPACR126
 * OPACR127
 */
/*!
 * @name Constants and macros for entire AIPS_OPACR register
 */
/*@{*/
#define AIPS_RD_OPACR(base, index) (AIPS_OPACR_REG(base, index))
#define AIPS_WR_OPACR(base, index, value) (AIPS_OPACR_REG(base, index) = (value))
#define AIPS_RMW_OPACR(base, index, mask, value) (AIPS_WR_OPACR(base, index, (AIPS_RD_OPACR(base, index) & ~(mask)) | (value)))
#define AIPS_SET_OPACR(base, index, value) (AIPS_WR_OPACR(base, index, AIPS_RD_OPACR(base, index) |  (value)))
#define AIPS_CLR_OPACR(base, index, value) (AIPS_WR_OPACR(base, index, AIPS_RD_OPACR(base, index) & ~(value)))
#define AIPS_TOG_OPACR(base, index, value) (AIPS_WR_OPACR(base, index, AIPS_RD_OPACR(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual AIPS_OPACR bitfields
 */

/*!
 * @name Register AIPS_OPACR, field TP7[0] (RW)
 *
 * Determines whether the peripheral allows accesses from an untrusted master.
 * When this field is set and an access is attempted by an untrusted master, the
 * access terminates with an error response and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - Accesses from an untrusted master are allowed.
 * - 0b1 - Accesses from an untrusted master are not allowed.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_TP7 field. */
#define AIPS_RD_OPACR_TP7(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_TP7_MASK) >> AIPS_OPACR_TP7_SHIFT)
#define AIPS_BRD_OPACR_TP7(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP7_SHIFT))

/*! @brief Set the TP7 field to a new value. */
#define AIPS_WR_OPACR_TP7(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_TP7_MASK, AIPS_OPACR_TP7(value)))
#define AIPS_BWR_OPACR_TP7(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field WP7[1] (RW)
 *
 * Determines whether the peripheral allows write accesses. When this field is
 * set and a write access is attempted, access terminates with an error response
 * and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - This peripheral allows write accesses.
 * - 0b1 - This peripheral is write protected.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_WP7 field. */
#define AIPS_RD_OPACR_WP7(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_WP7_MASK) >> AIPS_OPACR_WP7_SHIFT)
#define AIPS_BRD_OPACR_WP7(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP7_SHIFT))

/*! @brief Set the WP7 field to a new value. */
#define AIPS_WR_OPACR_WP7(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_WP7_MASK, AIPS_OPACR_WP7(value)))
#define AIPS_BWR_OPACR_WP7(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field SP7[2] (RW)
 *
 * Determines whether the peripheral requires supervisor privilege level for
 * accesses. When this field is set, the master privilege level must indicate the
 * supervisor access attribute, and the MPRx[MPLn] control field for the master
 * must be set. If not, access terminates with an error response and no peripheral
 * access initiates.
 *
 * Values:
 * - 0b0 - This peripheral does not require supervisor privilege level for
 *     accesses.
 * - 0b1 - This peripheral requires supervisor privilege level for accesses.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_SP7 field. */
#define AIPS_RD_OPACR_SP7(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_SP7_MASK) >> AIPS_OPACR_SP7_SHIFT)
#define AIPS_BRD_OPACR_SP7(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP7_SHIFT))

/*! @brief Set the SP7 field to a new value. */
#define AIPS_WR_OPACR_SP7(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_SP7_MASK, AIPS_OPACR_SP7(value)))
#define AIPS_BWR_OPACR_SP7(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field TP6[4] (RW)
 *
 * Determines whether the peripheral allows accesses from an untrusted master.
 * When this field is set and an access is attempted by an untrusted master, the
 * access terminates with an error response and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - Accesses from an untrusted master are allowed.
 * - 0b1 - Accesses from an untrusted master are not allowed.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_TP6 field. */
#define AIPS_RD_OPACR_TP6(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_TP6_MASK) >> AIPS_OPACR_TP6_SHIFT)
#define AIPS_BRD_OPACR_TP6(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP6_SHIFT))

/*! @brief Set the TP6 field to a new value. */
#define AIPS_WR_OPACR_TP6(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_TP6_MASK, AIPS_OPACR_TP6(value)))
#define AIPS_BWR_OPACR_TP6(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP6_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field WP6[5] (RW)
 *
 * Determines whether the peripheral allows write accesses. When this field is
 * set and a write access is attempted, access terminates with an error response
 * and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - This peripheral allows write accesses.
 * - 0b1 - This peripheral is write protected.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_WP6 field. */
#define AIPS_RD_OPACR_WP6(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_WP6_MASK) >> AIPS_OPACR_WP6_SHIFT)
#define AIPS_BRD_OPACR_WP6(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP6_SHIFT))

