nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the WP6 field to a new value. */
#define AIPS_WR_OPACR_WP6(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_WP6_MASK, AIPS_OPACR_WP6(value)))
#define AIPS_BWR_OPACR_WP6(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP6_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field SP6[6] (RW)
 *
 * Determines whether the peripheral requires supervisor privilege level for
 * accesses. When this field is set, the master privilege level must indicate the
 * supervisor access attribute, and the MPRx[MPLn] control field for the master
 * must be set. If not, access terminates with an error response and no peripheral
 * access initiates.
 *
 * Values:
 * - 0b0 - This peripheral does not require supervisor privilege level for
 *     accesses.
 * - 0b1 - This peripheral requires supervisor privilege level for accesses.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_SP6 field. */
#define AIPS_RD_OPACR_SP6(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_SP6_MASK) >> AIPS_OPACR_SP6_SHIFT)
#define AIPS_BRD_OPACR_SP6(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP6_SHIFT))

/*! @brief Set the SP6 field to a new value. */
#define AIPS_WR_OPACR_SP6(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_SP6_MASK, AIPS_OPACR_SP6(value)))
#define AIPS_BWR_OPACR_SP6(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP6_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field TP5[8] (RW)
 *
 * Determines whether the peripheral allows accesses from an untrusted master.
 * When this field is set and an access is attempted by an untrusted master, the
 * access terminates with an error response and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - Accesses from an untrusted master are allowed.
 * - 0b1 - Accesses from an untrusted master are not allowed.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_TP5 field. */
#define AIPS_RD_OPACR_TP5(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_TP5_MASK) >> AIPS_OPACR_TP5_SHIFT)
#define AIPS_BRD_OPACR_TP5(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP5_SHIFT))

/*! @brief Set the TP5 field to a new value. */
#define AIPS_WR_OPACR_TP5(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_TP5_MASK, AIPS_OPACR_TP5(value)))
#define AIPS_BWR_OPACR_TP5(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP5_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field WP5[9] (RW)
 *
 * Determines whether the peripheral allows write accesses. When this field is
 * set and a write access is attempted, access terminates with an error response
 * and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - This peripheral allows write accesses.
 * - 0b1 - This peripheral is write protected.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_WP5 field. */
#define AIPS_RD_OPACR_WP5(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_WP5_MASK) >> AIPS_OPACR_WP5_SHIFT)
#define AIPS_BRD_OPACR_WP5(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP5_SHIFT))

/*! @brief Set the WP5 field to a new value. */
#define AIPS_WR_OPACR_WP5(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_WP5_MASK, AIPS_OPACR_WP5(value)))
#define AIPS_BWR_OPACR_WP5(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP5_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field SP5[10] (RW)
 *
 * Determines whether the peripheral requires supervisor privilege level for
 * accesses. When this field is set, the master privilege level must indicate the
 * supervisor access attribute, and the MPRx[MPLn] control field for the master
 * must be set. If not, access terminates with an error response and no peripheral
 * access initiates.
 *
 * Values:
 * - 0b0 - This peripheral does not require supervisor privilege level for
 *     accesses.
 * - 0b1 - This peripheral requires supervisor privilege level for accesses.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_SP5 field. */
#define AIPS_RD_OPACR_SP5(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_SP5_MASK) >> AIPS_OPACR_SP5_SHIFT)
#define AIPS_BRD_OPACR_SP5(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP5_SHIFT))

/*! @brief Set the SP5 field to a new value. */
#define AIPS_WR_OPACR_SP5(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_SP5_MASK, AIPS_OPACR_SP5(value)))
#define AIPS_BWR_OPACR_SP5(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP5_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field TP4[12] (RW)
 *
 * Determines whether the peripheral allows accesses from an untrusted master.
 * When this bit is set and an access is attempted by an untrusted master, the
 * access terminates with an error response and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - Accesses from an untrusted master are allowed.
 * - 0b1 - Accesses from an untrusted master are not allowed.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_TP4 field. */
#define AIPS_RD_OPACR_TP4(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_TP4_MASK) >> AIPS_OPACR_TP4_SHIFT)
#define AIPS_BRD_OPACR_TP4(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP4_SHIFT))

/*! @brief Set the TP4 field to a new value. */
#define AIPS_WR_OPACR_TP4(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_TP4_MASK, AIPS_OPACR_TP4(value)))
#define AIPS_BWR_OPACR_TP4(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP4_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field WP4[13] (RW)
 *
 * Determines whether the peripheral allows write accesses. When this field is
 * set and a write access is attempted, access terminates with an error response
 * and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - This peripheral allows write accesses.
 * - 0b1 - This peripheral is write protected.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_WP4 field. */
#define AIPS_RD_OPACR_WP4(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_WP4_MASK) >> AIPS_OPACR_WP4_SHIFT)
#define AIPS_BRD_OPACR_WP4(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP4_SHIFT))

/*! @brief Set the WP4 field to a new value. */
#define AIPS_WR_OPACR_WP4(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_WP4_MASK, AIPS_OPACR_WP4(value)))
#define AIPS_BWR_OPACR_WP4(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP4_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field SP4[14] (RW)
 *
 * Determines whether the peripheral requires supervisor privilege level for
 * access. When this bit is set, the master privilege level must indicate the
 * supervisor access attribute, and the MPRx[MPLn] control bit for the master must be
 * set. If not, access terminates with an error response and no peripheral access
 * initiates.
 *
 * Values:
 * - 0b0 - This peripheral does not require supervisor privilege level for
 *     accesses.
 * - 0b1 - This peripheral requires supervisor privilege level for accesses.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_SP4 field. */
#define AIPS_RD_OPACR_SP4(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_SP4_MASK) >> AIPS_OPACR_SP4_SHIFT)
#define AIPS_BRD_OPACR_SP4(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP4_SHIFT))

/*! @brief Set the SP4 field to a new value. */
#define AIPS_WR_OPACR_SP4(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_SP4_MASK, AIPS_OPACR_SP4(value)))
#define AIPS_BWR_OPACR_SP4(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP4_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field TP3[16] (RW)
 *
 * Determines whether the peripheral allows accesses from an untrusted master.
 * When this field is set and an access is attempted by an untrusted master, the
 * access terminates with an error response and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - Accesses from an untrusted master are allowed.
 * - 0b1 - Accesses from an untrusted master are not allowed.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_TP3 field. */
#define AIPS_RD_OPACR_TP3(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_TP3_MASK) >> AIPS_OPACR_TP3_SHIFT)
#define AIPS_BRD_OPACR_TP3(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP3_SHIFT))

/*! @brief Set the TP3 field to a new value. */
#define AIPS_WR_OPACR_TP3(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_TP3_MASK, AIPS_OPACR_TP3(value)))
#define AIPS_BWR_OPACR_TP3(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field WP3[17] (RW)
 *
 * Determines whether the peripheral allows write accesss. When this bit is set
 * and a write access is attempted, access terminates with an error response and
 * no peripheral access initiates.
 *
 * Values:
 * - 0b0 - This peripheral allows write accesses.
 * - 0b1 - This peripheral is write protected.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_WP3 field. */
#define AIPS_RD_OPACR_WP3(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_WP3_MASK) >> AIPS_OPACR_WP3_SHIFT)
#define AIPS_BRD_OPACR_WP3(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP3_SHIFT))

/*! @brief Set the WP3 field to a new value. */
#define AIPS_WR_OPACR_WP3(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_WP3_MASK, AIPS_OPACR_WP3(value)))
#define AIPS_BWR_OPACR_WP3(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field SP3[18] (RW)
 *
 * Determines whether the peripheral requires supervisor privilege level for
 * accesses. When this field is set, the master privilege level must indicate the
 * supervisor access attribute, and the MPRx[MPLn] control field for the master
 * must be set. If not, access terminates with an error response and no peripheral
 * access initiates.
 *
 * Values:
 * - 0b0 - This peripheral does not require supervisor privilege level for
 *     accesses.
 * - 0b1 - This peripheral requires supervisor privilege level for accesses.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_SP3 field. */
#define AIPS_RD_OPACR_SP3(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_SP3_MASK) >> AIPS_OPACR_SP3_SHIFT)
#define AIPS_BRD_OPACR_SP3(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP3_SHIFT))

/*! @brief Set the SP3 field to a new value. */
#define AIPS_WR_OPACR_SP3(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_SP3_MASK, AIPS_OPACR_SP3(value)))
#define AIPS_BWR_OPACR_SP3(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field TP2[20] (RW)
 *
 * Determines whether the peripheral allows accesses from an untrusted master.
 * When this bit is set and an access is attempted by an untrusted master, the
 * access terminates with an error response and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - Accesses from an untrusted master are allowed.
 * - 0b1 - Accesses from an untrusted master are not allowed.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_TP2 field. */
#define AIPS_RD_OPACR_TP2(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_TP2_MASK) >> AIPS_OPACR_TP2_SHIFT)
#define AIPS_BRD_OPACR_TP2(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP2_SHIFT))

/*! @brief Set the TP2 field to a new value. */
#define AIPS_WR_OPACR_TP2(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_TP2_MASK, AIPS_OPACR_TP2(value)))
#define AIPS_BWR_OPACR_TP2(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field WP2[21] (RW)
 *
 * Determines whether the peripheral allows write accesses. When this field is
 * set and a write access is attempted, access terminates with an error response
 * and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - This peripheral allows write accesses.
 * - 0b1 - This peripheral is write protected.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_WP2 field. */
#define AIPS_RD_OPACR_WP2(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_WP2_MASK) >> AIPS_OPACR_WP2_SHIFT)
#define AIPS_BRD_OPACR_WP2(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP2_SHIFT))

/*! @brief Set the WP2 field to a new value. */
#define AIPS_WR_OPACR_WP2(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_WP2_MASK, AIPS_OPACR_WP2(value)))
#define AIPS_BWR_OPACR_WP2(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field SP2[22] (RW)
 *
 * Determines whether the peripheral requires supervisor privilege level for
 * access. When this bit is set, the master privilege level must indicate the
 * supervisor access attribute, and the MPRx[MPLn] control bit for the master must be
 * set. If not, access terminates with an error response and no peripheral access
 * initiates.
 *
 * Values:
 * - 0b0 - This peripheral does not require supervisor privilege level for
 *     accesses.
 * - 0b1 - This peripheral requires supervisor privilege level for accesses.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_SP2 field. */
#define AIPS_RD_OPACR_SP2(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_SP2_MASK) >> AIPS_OPACR_SP2_SHIFT)
#define AIPS_BRD_OPACR_SP2(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP2_SHIFT))

/*! @brief Set the SP2 field to a new value. */
#define AIPS_WR_OPACR_SP2(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_SP2_MASK, AIPS_OPACR_SP2(value)))
#define AIPS_BWR_OPACR_SP2(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field TP1[24] (RW)
 *
 * Determines whether the peripheral allows accesses from an untrusted master.
 * When this field is set and an access is attempted by an untrusted master, the
 * access terminates with an error response and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - Accesses from an untrusted master are allowed.
 * - 0b1 - Accesses from an untrusted master are not allowed.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_TP1 field. */
#define AIPS_RD_OPACR_TP1(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_TP1_MASK) >> AIPS_OPACR_TP1_SHIFT)
#define AIPS_BRD_OPACR_TP1(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP1_SHIFT))

/*! @brief Set the TP1 field to a new value. */
#define AIPS_WR_OPACR_TP1(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_TP1_MASK, AIPS_OPACR_TP1(value)))
#define AIPS_BWR_OPACR_TP1(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field WP1[25] (RW)
 *
 * Determines whether the peripheral allows write accesses. When this field is
 * set and a write access is attempted, access terminates with an error response
 * and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - This peripheral allows write accesses.
 * - 0b1 - This peripheral is write protected.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_WP1 field. */
#define AIPS_RD_OPACR_WP1(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_WP1_MASK) >> AIPS_OPACR_WP1_SHIFT)
#define AIPS_BRD_OPACR_WP1(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP1_SHIFT))

/*! @brief Set the WP1 field to a new value. */
#define AIPS_WR_OPACR_WP1(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_WP1_MASK, AIPS_OPACR_WP1(value)))
#define AIPS_BWR_OPACR_WP1(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field SP1[26] (RW)
 *
 * Determines whether the peripheral requires supervisor privilege level for
 * access. When this field is set, the master privilege level must indicate the
 * supervisor access attribute, and the MPRx[MPLn] control field for the master must
 * be set. If not, access terminates with an error response and no peripheral
 * access initiates.
 *
 * Values:
 * - 0b0 - This peripheral does not require supervisor privilege level for
 *     accesses.
 * - 0b1 - This peripheral requires supervisor privilege level for accesses.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_SP1 field. */
#define AIPS_RD_OPACR_SP1(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_SP1_MASK) >> AIPS_OPACR_SP1_SHIFT)
#define AIPS_BRD_OPACR_SP1(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP1_SHIFT))

/*! @brief Set the SP1 field to a new value. */
#define AIPS_WR_OPACR_SP1(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_SP1_MASK, AIPS_OPACR_SP1(value)))
#define AIPS_BWR_OPACR_SP1(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field TP0[28] (RW)
 *
 * Determines whether the peripheral allows accesses from an untrusted master.
 * When this bit is set and an access is attempted by an untrusted master, the
 * access terminates with an error response and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - Accesses from an untrusted master are allowed.
 * - 0b1 - Accesses from an untrusted master are not allowed.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_TP0 field. */
#define AIPS_RD_OPACR_TP0(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_TP0_MASK) >> AIPS_OPACR_TP0_SHIFT)
#define AIPS_BRD_OPACR_TP0(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP0_SHIFT))

/*! @brief Set the TP0 field to a new value. */
#define AIPS_WR_OPACR_TP0(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_TP0_MASK, AIPS_OPACR_TP0(value)))
#define AIPS_BWR_OPACR_TP0(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_TP0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field WP0[29] (RW)
 *
 * Determines whether the peripheral allows write accesses. When this field is
 * set and a write access is attempted, access terminates with an error response
 * and no peripheral access initiates.
 *
 * Values:
 * - 0b0 - This peripheral allows write accesses.
 * - 0b1 - This peripheral is write protected.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_WP0 field. */
#define AIPS_RD_OPACR_WP0(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_WP0_MASK) >> AIPS_OPACR_WP0_SHIFT)
#define AIPS_BRD_OPACR_WP0(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP0_SHIFT))

/*! @brief Set the WP0 field to a new value. */
#define AIPS_WR_OPACR_WP0(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_WP0_MASK, AIPS_OPACR_WP0(value)))
#define AIPS_BWR_OPACR_WP0(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_WP0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register AIPS_OPACR, field SP0[30] (RW)
 *
 * Determines whether the peripheral requires supervisor privilege level for
 * accesses. When this field is set, the master privilege level must indicate the
 * supervisor access attribute, and the MPRx[MPLn] control field for the master
 * must be set. If not, access terminates with an error response and no peripheral
 * access initiates.
 *
 * Values:
 * - 0b0 - This peripheral does not require supervisor privilege level for
 *     accesses.
 * - 0b1 - This peripheral requires supervisor privilege level for accesses.
 */
/*@{*/
/*! @brief Read current value of the AIPS_OPACR_SP0 field. */
#define AIPS_RD_OPACR_SP0(base, index) ((AIPS_OPACR_REG(base, index) & AIPS_OPACR_SP0_MASK) >> AIPS_OPACR_SP0_SHIFT)
#define AIPS_BRD_OPACR_SP0(base, index) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP0_SHIFT))

/*! @brief Set the SP0 field to a new value. */
#define AIPS_WR_OPACR_SP0(base, index, value) (AIPS_RMW_OPACR(base, index, AIPS_OPACR_SP0_MASK, AIPS_OPACR_SP0(value)))
#define AIPS_BWR_OPACR_SP0(base, index, value) (BITBAND_ACCESS32(&AIPS_OPACR_REG(base, index), AIPS_OPACR_SP0_SHIFT) = (value))
/*@}*/

