nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * S32K144 CAN
 *
 * Flex Controller Area Network module
 *
 * Registers defined in this header file:
 * - CAN_MCR - Module Configuration Register
 * - CAN_CTRL1 - Control 1 register
 * - CAN_TIMER - Free Running Timer
 * - CAN_RXMGMASK - Rx Mailboxes Global Mask Register
 * - CAN_RX14MASK - Rx 14 Mask register
 * - CAN_RX15MASK - Rx 15 Mask register
 * - CAN_ECR - Error Counter
 * - CAN_ESR1 - Error and Status 1 register
 * - CAN_IMASK1 - Interrupt Masks 1 register
 * - CAN_IFLAG1 - Interrupt Flags 1 register
 * - CAN_CTRL2 - Control 2 register
 * - CAN_ESR2 - Error and Status 2 register
 * - CAN_CRCR - CRC Register
 * - CAN_RXFGMASK - Rx FIFO Global Mask register
 * - CAN_RXFIR - Rx FIFO Information Register
 * - CAN_CBT - CAN Bit Timing Register
 * - CAN_RXIMR - Rx Individual Mask Registers
 * - CAN_CTRL1_PN - Pretended Networking Control 1 Register
 * - CAN_CTRL2_PN - Pretended Networking Control 2 Register
 * - CAN_WU_MTC - Pretended Networking Wake Up Match Register
 * - CAN_FLT_ID1 - Pretended Networking ID Filter 1 Register
 * - CAN_FLT_DLC - Pretended Networking DLC Filter Register
 * - CAN_PL1_LO - Pretended Networking Payload Low Filter 1 Register
 * - CAN_PL1_HI - Pretended Networking Payload High Filter 1 Register
 * - CAN_FLT_ID2_IDMASK - Pretended Networking ID Filter 2 Register / ID Mask Register
 * - CAN_PL2_PLMASK_LO - Pretended Networking Payload Low Filter 2 Register / Payload Low Mask Register
 * - CAN_PL2_PLMASK_HI - Pretended Networking Payload High Filter 2 low order bits / Payload High Mask Register
 * - CAN_WMB0_CS - Wake Up Message Buffer Register for C/S
 * - CAN_WMB0_ID - Wake Up Message Buffer Register for ID
 * - CAN_WMB0_D03 - Wake Up Message Buffer Register for Data 0-3
 * - CAN_WMB0_D47 - Wake Up Message Buffer Register Data 4-7
 * - CAN_WMB1_CS - Wake Up Message Buffer Register for C/S
 * - CAN_WMB1_ID - Wake Up Message Buffer Register for ID
 * - CAN_WMB1_D03 - Wake Up Message Buffer Register for Data 0-3
 * - CAN_WMB1_D47 - Wake Up Message Buffer Register Data 4-7
 * - CAN_WMB2_CS - Wake Up Message Buffer Register for C/S
 * - CAN_WMB2_ID - Wake Up Message Buffer Register for ID
 * - CAN_WMB2_D03 - Wake Up Message Buffer Register for Data 0-3
 * - CAN_WMB2_D47 - Wake Up Message Buffer Register Data 4-7
 * - CAN_WMB3_CS - Wake Up Message Buffer Register for C/S
 * - CAN_WMB3_ID - Wake Up Message Buffer Register for ID
 * - CAN_WMB3_D03 - Wake Up Message Buffer Register for Data 0-3
 * - CAN_WMB3_D47 - Wake Up Message Buffer Register Data 4-7
 * - CAN_FDCTRL - CAN FD Control Register
 * - CAN_FDCBT - CAN FD Bit Timing Register
 * - CAN_FDCRC - CAN FD CRC Register
 */

#define CAN_INSTANCE_COUNT (3U) /*!< Number of instances of the CAN module. */
#define CAN0_IDX (0U) /*!< Instance number for CAN0. */
#define CAN1_IDX (1U) /*!< Instance number for CAN1. */
#define CAN2_IDX (2U) /*!< Instance number for CAN2. */

/*******************************************************************************
 * CAN_MCR - Module Configuration Register
 ******************************************************************************/

/*!
 * @brief CAN_MCR - Module Configuration Register (RW)
 *
 * Reset value: 0xD890000FU
 *
 * This register defines global system configurations, such as the module
 * operation modes and the maximum message buffer configuration.
 */
/*!
 * @name Constants and macros for entire CAN_MCR register
 */
/*@{*/
#define CAN_RD_MCR(base)         (CAN_MCR_REG(base))
#define CAN_WR_MCR(base, value)  (CAN_MCR_REG(base) = (value))
#define CAN_RMW_MCR(base, mask, value) (CAN_WR_MCR(base, (CAN_RD_MCR(base) & ~(mask)) | (value)))
#define CAN_SET_MCR(base, value) (CAN_WR_MCR(base, CAN_RD_MCR(base) |  (value)))
#define CAN_CLR_MCR(base, value) (CAN_WR_MCR(base, CAN_RD_MCR(base) & ~(value)))
#define CAN_TOG_MCR(base, value) (CAN_WR_MCR(base, CAN_RD_MCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_MCR bitfields
 */

/*!
 * @name Register CAN_MCR, field MAXMB[6:0] (RW)
 *
 * This 7-bit field defines the number of the last Message Buffers that will
 * take part in the matching and arbitration processes. The reset value (0x0F) is
 * equivalent to a 16 MB configuration. This field can be written only in Freeze
 * mode because it is blocked by hardware in other modes. Number of the last MB =
 * MAXMB MAXMB must be programmed with a value smaller than or equal to the number
 * of available Message Buffers, as described in FlexCAN Memory Partition for
 * CAN FD . Additionally, the definition of MAXMB value must take into account the
 * region of MBs occupied by Rx FIFO and its ID filters table space defined by
 * RFFN bit in CAN_CTRL2 register. MAXMB also impacts the definition of the minimum
 * number of peripheral clocks per CAN bit as described in Table "Minimum Ratio
 * Between Peripheral Clock Frequency and CAN Bit Rate" (see Arbitration and
 * matching timing).
 */
/*@{*/
/*! @brief Read current value of the CAN_MCR_MAXMB field. */
#define CAN_RD_MCR_MAXMB(base) ((CAN_MCR_REG(base) & CAN_MCR_MAXMB_MASK) >> CAN_MCR_MAXMB_SHIFT)
#define CAN_BRD_MCR_MAXMB(base) (CAN_RD_MCR_MAXMB(base))

/*! @brief Set the MAXMB field to a new value. */
#define CAN_WR_MCR_MAXMB(base, value) (CAN_RMW_MCR(base, CAN_MCR_MAXMB_MASK, CAN_MCR_MAXMB(value)))
#define CAN_BWR_MCR_MAXMB(base, value) (CAN_WR_MCR_MAXMB(base, value))
/*@}*/

/*!
 * @name Register CAN_MCR, field IDAM[9:8] (RW)
 *
 * This 2-bit field identifies the format of the Rx FIFO ID Filter Table
 * elements. Note that all elements of the table are configured at the same time by this
 * field (they are all the same format). See Section "Rx FIFO Structure". This
 * field can be written only in Freeze mode because it is blocked by hardware in
 * other modes.
 *
 * Values:
 * - 0b00 - Format A: One full ID (standard and extended) per ID Filter Table
 *     element.
 * - 0b01 - Format B: Two full standard IDs or two partial 14-bit (standard and
 *     extended) IDs per ID Filter Table element.
 * - 0b10 - Format C: Four partial 8-bit Standard IDs per ID Filter Table
 *     element.
 * - 0b11 - Format D: All frames rejected.
 */
/*@{*/
/*! @brief Read current value of the CAN_MCR_IDAM field. */
#define CAN_RD_MCR_IDAM(base) ((CAN_MCR_REG(base) & CAN_MCR_IDAM_MASK) >> CAN_MCR_IDAM_SHIFT)
#define CAN_BRD_MCR_IDAM(base) (CAN_RD_MCR_IDAM(base))

/*! @brief Set the IDAM field to a new value. */
#define CAN_WR_MCR_IDAM(base, value) (CAN_RMW_MCR(base, CAN_MCR_IDAM_MASK, CAN_MCR_IDAM(value)))
#define CAN_BWR_MCR_IDAM(base, value) (CAN_WR_MCR_IDAM(base, value))
/*@}*/

/*!
 * @name Register CAN_MCR, field FDEN[11] (RW)
 *
 * This bit enables the CAN with Flexible Data rate (CAN FD) operation. This bit
 * can be written in Freeze mode only.The Rx FIFO Enable (RFEN) bit cannot be
 * set if FDEN is asserted.
 *
 * Values:
 * - 0b1 - CAN FD is enabled. FlexCAN is able to receive and transmit messages
 *     in both CAN FD and CAN 2.0 formats.
 * - 0b0 - CAN FD is disabled. FlexCAN is able to receive and transmit messages
 *     in CAN 2.0 format.
 */
/*@{*/
/*! @brief Read current value of the CAN_MCR_FDEN field. */
#define CAN_RD_MCR_FDEN(base) ((CAN_MCR_REG(base) & CAN_MCR_FDEN_MASK) >> CAN_MCR_FDEN_SHIFT)
#define CAN_BRD_MCR_FDEN(base) (BITBAND_ACCESS32(&CAN_MCR_REG(base), CAN_MCR_FDEN_SHIFT))

/*! @brief Set the FDEN field to a new value. */
#define CAN_WR_MCR_FDEN(base, value) (CAN_RMW_MCR(base, CAN_MCR_FDEN_MASK, CAN_MCR_FDEN(value)))
#define CAN_BWR_MCR_FDEN(base, value) (BITBAND_ACCESS32(&CAN_MCR_REG(base), CAN_MCR_FDEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_MCR, field AEN[12] (RW)
 *
 * When asserted, this bit enables the Tx abort mechanism. This mechanism
 * guarantees a safe procedure for aborting a pending transmission, so that no frame is
 * sent in the CAN bus without notification. This bit can be written only in
 * Freeze mode because it is blocked by hardware in other modes. When CAN_MCR[AEN]
 * is asserted, only the abort mechanism (see Transmission abort mechanism) must
 * be used for updating Mailboxes configured for transmission. Writing the Abort
 * code into Rx Mailboxes can cause unpredictable results when the CAN_MCR[AEN] is
 * asserted.
 *
 * Values:
 * - 0b0 - Abort disabled.
 * - 0b1 - Abort enabled.
 */
/*@{*/
/*! @brief Read current value of the CAN_MCR_AEN field. */
#define CAN_RD_MCR_AEN(base) ((CAN_MCR_REG(base) & CAN_MCR_AEN_MASK) >> CAN_MCR_AEN_SHIFT)
#define CAN_BRD_MCR_AEN(base) (BITBAND_ACCESS32(&CAN_MCR_REG(base), CAN_MCR_AEN_SHIFT))

/*! @brief Set the AEN field to a new value. */
#define CAN_WR_MCR_AEN(base, value) (CAN_RMW_MCR(base, CAN_MCR_AEN_MASK, CAN_MCR_AEN(value)))
#define CAN_BWR_MCR_AEN(base, value) (BITBAND_ACCESS32(&CAN_MCR_REG(base), CAN_MCR_AEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_MCR, field LPRIOEN[13] (RW)
 *
 * This bit is provided for backwards compatibility with legacy applications. It
 * controls whether the local priority feature is enabled or not. It is used to
 * expand the ID used during the arbitration process. With this expanded ID
 * concept, the arbitration process is done based on the full 32-bit word, but the
 * actual transmitted ID still has 11-bit for standard frames and 29-bit for
 * extended frames. This bit can be written only in Freeze mode because it is blocked by
 * hardware in other modes.
 *
 * Values:
 * - 0b0 - Local Priority disabled.
 * - 0b1 - Local Priority enabled.
 */
/*@{*/
/*! @brief Read current value of the CAN_MCR_LPRIOEN field. */
#define CAN_RD_MCR_LPRIOEN(base) ((CAN_MCR_REG(base) & CAN_MCR_LPRIOEN_MASK) >> CAN_MCR_LPRIOEN_SHIFT)
#define CAN_BRD_MCR_LPRIOEN(base) (BITBAND_ACCESS32(&CAN_MCR_REG(base), CAN_MCR_LPRIOEN_SHIFT))

/*! @brief Set the LPRIOEN field to a new value. */
#define CAN_WR_MCR_LPRIOEN(base, value) (CAN_RMW_MCR(base, CAN_MCR_LPRIOEN_MASK, CAN_MCR_LPRIOEN(value)))
#define CAN_BWR_MCR_LPRIOEN(base, value) (BITBAND_ACCESS32(&CAN_MCR_REG(base), CAN_MCR_LPRIOEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_MCR, field PNET_EN[14] (RW)
 *
 * This bit enables the Pretended Networking functionality. Once in Doze mode or
 * Stop mode, CAN_PE sub-block is kept operational, able to process Rx message
 * filtering as defined by the Pretended Networking configuration registers. See
 * Receive Process under Pretended Networking Mode. This bit can be written in
 * Freeze mode only.
 *
 * Values:
 * - 0b0 - Pretended Networking mode is disabled.
 * - 0b1 - Pretended Networking mode is enabled.
 */
/*@{*/
/*! @brief Read current value of the CAN_MCR_PNET_EN field. */
#define CAN_RD_MCR_PNET_EN(base) ((CAN_MCR_REG(base) & CAN_MCR_PNET_EN_MASK) >> CAN_MCR_PNET_EN_SHIFT)
#define CAN_BRD_MCR_PNET_EN(base) (BITBAND_ACCESS32(&CAN_MCR_REG(base), CAN_MCR_PNET_EN_SHIFT))

/*! @brief Set the PNET_EN field to a new value. */
#define CAN_WR_MCR_PNET_EN(base, value) (CAN_RMW_MCR(base, CAN_MCR_PNET_EN_MASK, CAN_MCR_PNET_EN(value)))
#define CAN_BWR_MCR_PNET_EN(base, value) (BITBAND_ACCESS32(&CAN_MCR_REG(base), CAN_MCR_PNET_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_MCR, field DMA[15] (RW)
 *
 * The DMA Enable bit controls whether the DMA feature is enabled or not. The
 * DMA feature can only be used in Rx FIFO, consequently the bit CAN_MCR[RFEN] must
 * be asserted. When DMA and RFEN are set, the CAN_IFLAG1[BUF5I] generates the
 * DMA request and no RX FIFO interrupt is generated. This bit can be written in
 * Freeze mode only as it is blocked by hardware in other modes.
 *
 * Values:
 * - 0b0 - DMA feature for RX FIFO disabled.
 * - 0b1 - DMA feature for RX FIFO enabled.
 */
/*@{*/
/*! @brief Read current value of the CAN_MCR_DMA field. */
#define CAN_RD_MCR_DMA(base) ((CAN_MCR_REG(base) & CAN_MCR_DMA_MASK) >> CAN_MCR_DMA_SHIFT)
#define CAN_BRD_MCR_DMA(base) (BITBAND_ACCESS32(&CAN_MCR_REG(base), CAN_MCR_DMA_SHIFT))

