nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * CAN_ECR - Error Counter
 ******************************************************************************/

/*!
 * @brief CAN_ECR - Error Counter (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register has four 8-bit fields reflecting the value of the FlexCAN error
 * counters: Transmit Error Counter (TXERRCNT field) Receive Error Counter
 * (RXERRCNT field) Transmit Error Counter for errors detected in the Data Phase of
 * CAN FD messages with the BRS bit set (TXERRCNT_FAST field) Receive Error Counter
 * for errors detected in the Data Phase of CAN FD messages with the BRS bit set
 * (RXERRCNT_FAST field) The TXERRCNT and RXERRCNT counters take into account
 * all errors in both CAN FD and non-FD message formats. TXERRCNT_FAST and
 * RXERRCNT_FAST are dedicated to count only the errors occurred in the Data Phase of CAN
 * FD frames with the BRS bit set. The Fault Confinement State (FLTCONF field in
 * Error and Status Register 1 - CAN_ESR1) is updated based on TXERRCNT and
 * RXERRCNT counters only. TXERRCNT and RXERRCNT counters can be written in Freeze
 * mode only. TXERRCNT_FAST and RXERRCNT_FAST counters are read-only except in
 * Freeze mode where the CPU can write value zero. The rules for increasing and
 * decreasing these counters are described in the CAN protocol and are completely
 * implemented in the FlexCAN module. The following are the basic rules for FlexCAN
 * bus state transitions: If the value of TXERRCNT or RXERRCNT increases to be
 * greater than or equal to 128, the FLTCONF field in the Error and Status Register
 * is updated to reflect "Error Passive" state. If the FlexCAN state is "Error
 * Passive", and either TXERRCNT or RXERRCNT decrements to a value less than or
 * equal to 127 while the other already satisfies this condition, the FLTCONF field
 * in the Error and Status Register is updated to reflect "Error Active" state.
 * If the value of TXERRCNT increases to be greater than 255, the FLTCONF field in
 * the Error and Status Register is updated to reflect "Bus Off" state, and an
 * interrupt may be issued. The value of TXERRCNT is then reset to zero. If
 * FlexCAN is in "Bus Off' state, then TXERRCNT is cascaded together with another
 * internal counter to count the 128th occurrences of 11 consecutive recessive bits on
 * the bus. Hence, TXERRCNT is reset to zero and counts in a manner where the
 * internal counter counts 11 such bits and then wraps around while incrementing
 * the TXERRCNT. When TXERRCNT reaches the value of 128, the FLTCONF field in the
 * Error and Status Register is updated to be "Error Active" and both error
 * counters are reset to zero. At any instance of dominant bit following a stream of
 * less than 11 consecutive recessive bits, the internal counter resets itself to
 * zero without affecting the TXERRCNT value. The TXERRCNT_FAST counter is frozen
 * during busoff. If during system start-up, only one node is operating, then its
 * TXERRCNT increases in each message it is trying to transmit, as a result of
 * acknowledge errors (indicated by the ACKERR bit in the Error and Status
 * Register). After the transition to "Error Passive" state, the TXERRCNT does not
 * increment anymore by acknowledge errors. Therefore the device never goes to the
 * "Bus Off" state. If the RXERRCNT increases to a value greater than 127, it is not
 * incremented further, even if more errors are detected while being a receiver.
 * At the next successful message reception, the counter is set to a value
 * between 119 and 127 to resume to "Error Active" state. TXERRCNT_FAST and
 * RXERRCNT_FAST error counters values increment and decrement based on errors detected
 * only in the Data Phase of CAN FD frames with the BRS bit set, following the same
 * increment and decrement rules as TXERRCNT and RXERRCNT counters. These
 * counters do not wrap around and get stuck at their maximum value (255). They stop
 * counting and keep their values frozen while FlexCAN is in "Bus Off" state. They
 * are reset when FlexCAN leaves "Bus Off" state and restart counting once FlexCAN
 * resumes to "Error Active" state. When FlexCAN is in Pretended Networking
 * mode, the RXERRCNT and RXERRCNT_FAST keep counting errors and error flags are
 * stored. The TXERRCNT and TXERRCNT_FAST preserve their values and do not change,
 * since no transmission occurs under Pretended Networking mode. Error counters and
 * error flags that changed values while in Pretended Networking mode are
 * updated in CAN_ECR and CAN_ESR1 when FlexCAN resumes back to Normal mode. The FAST
 * error flags in CAN_ESR1 register will not be set if FlexCAN is in Pretended
 * Networking mode.
 */
/*!
 * @name Constants and macros for entire CAN_ECR register
 */
/*@{*/
#define CAN_RD_ECR(base)         (CAN_ECR_REG(base))
#define CAN_WR_ECR(base, value)  (CAN_ECR_REG(base) = (value))
#define CAN_RMW_ECR(base, mask, value) (CAN_WR_ECR(base, (CAN_RD_ECR(base) & ~(mask)) | (value)))
#define CAN_SET_ECR(base, value) (CAN_WR_ECR(base, CAN_RD_ECR(base) |  (value)))
#define CAN_CLR_ECR(base, value) (CAN_WR_ECR(base, CAN_RD_ECR(base) & ~(value)))
#define CAN_TOG_ECR(base, value) (CAN_WR_ECR(base, CAN_RD_ECR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_ECR bitfields
 */

/*!
 * @name Register CAN_ECR, field TXERRCNT[7:0] (RW)
 *
 * Transmit Error Counter for all errors detected in transmitted messages. The
 * TXERRCNT counter is read-only except in Freeze mode, where it can be written by
 * the CPU.
 */
/*@{*/
/*! @brief Read current value of the CAN_ECR_TXERRCNT field. */
#define CAN_RD_ECR_TXERRCNT(base) ((CAN_ECR_REG(base) & CAN_ECR_TXERRCNT_MASK) >> CAN_ECR_TXERRCNT_SHIFT)
#define CAN_BRD_ECR_TXERRCNT(base) (CAN_RD_ECR_TXERRCNT(base))

/*! @brief Set the TXERRCNT field to a new value. */
#define CAN_WR_ECR_TXERRCNT(base, value) (CAN_RMW_ECR(base, CAN_ECR_TXERRCNT_MASK, CAN_ECR_TXERRCNT(value)))
#define CAN_BWR_ECR_TXERRCNT(base, value) (CAN_WR_ECR_TXERRCNT(base, value))
/*@}*/

/*!
 * @name Register CAN_ECR, field RXERRCNT[15:8] (RW)
 *
 * Receive Error Counter for all errors detected in received messages. The
 * RXERRCNT counter is read-only except in Freeze mode, where it can be written by the
 * CPU.
 */
/*@{*/
/*! @brief Read current value of the CAN_ECR_RXERRCNT field. */
#define CAN_RD_ECR_RXERRCNT(base) ((CAN_ECR_REG(base) & CAN_ECR_RXERRCNT_MASK) >> CAN_ECR_RXERRCNT_SHIFT)
#define CAN_BRD_ECR_RXERRCNT(base) (CAN_RD_ECR_RXERRCNT(base))

/*! @brief Set the RXERRCNT field to a new value. */
#define CAN_WR_ECR_RXERRCNT(base, value) (CAN_RMW_ECR(base, CAN_ECR_RXERRCNT_MASK, CAN_ECR_RXERRCNT(value)))
#define CAN_BWR_ECR_RXERRCNT(base, value) (CAN_WR_ECR_RXERRCNT(base, value))
/*@}*/

/*!
 * @name Register CAN_ECR, field TXERRCNT_FAST[23:16] (RW)
 *
 * Transmit Error Counter for errors detected in the Data Phase of transmitted
 * CAN FD messages with the BRS bit set. The TXERRCNT_FAST counter is read-only
 * except in Freeze mode, where the CPU can write a 8-bit zero value only.
 */
/*@{*/
/*! @brief Read current value of the CAN_ECR_TXERRCNT_FAST field. */
#define CAN_RD_ECR_TXERRCNT_FAST(base) ((CAN_ECR_REG(base) & CAN_ECR_TXERRCNT_FAST_MASK) >> CAN_ECR_TXERRCNT_FAST_SHIFT)
#define CAN_BRD_ECR_TXERRCNT_FAST(base) (CAN_RD_ECR_TXERRCNT_FAST(base))

