nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the TXERRCNT_FAST field to a new value. */
#define CAN_WR_ECR_TXERRCNT_FAST(base, value) (CAN_RMW_ECR(base, CAN_ECR_TXERRCNT_FAST_MASK, CAN_ECR_TXERRCNT_FAST(value)))
#define CAN_BWR_ECR_TXERRCNT_FAST(base, value) (CAN_WR_ECR_TXERRCNT_FAST(base, value))
/*@}*/

/*!
 * @name Register CAN_ECR, field RXERRCNT_FAST[31:24] (RW)
 *
 * Receive Error Counter for errors detected in the Data Phase of received CAN
 * FD messages with the BRS bit set. The RXERRCNT_FAST counter is read-only except
 * in Freeze mode, where the CPU can write a 8-bit zero value only.
 */
/*@{*/
/*! @brief Read current value of the CAN_ECR_RXERRCNT_FAST field. */
#define CAN_RD_ECR_RXERRCNT_FAST(base) ((CAN_ECR_REG(base) & CAN_ECR_RXERRCNT_FAST_MASK) >> CAN_ECR_RXERRCNT_FAST_SHIFT)
#define CAN_BRD_ECR_RXERRCNT_FAST(base) (CAN_RD_ECR_RXERRCNT_FAST(base))

/*! @brief Set the RXERRCNT_FAST field to a new value. */
#define CAN_WR_ECR_RXERRCNT_FAST(base, value) (CAN_RMW_ECR(base, CAN_ECR_RXERRCNT_FAST_MASK, CAN_ECR_RXERRCNT_FAST(value)))
#define CAN_BWR_ECR_RXERRCNT_FAST(base, value) (CAN_WR_ECR_RXERRCNT_FAST(base, value))
/*@}*/

/*******************************************************************************
 * CAN_ESR1 - Error and Status 1 register
 ******************************************************************************/

/*!
 * @brief CAN_ESR1 - Error and Status 1 register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register reports various error conditions detected in the reception and
 * transmission of a CAN frame, some general status of the device and it is the
 * source of some interrupts to the CPU. The reported error conditions are
 * BIT1ERR, BIT0ERR, ACKKERR, CRCERR, FRMERR and STFERR, for errors detected in CAN
 * frames of any format, and BIT1ERR_FAST, BIT0ERR_FAST, CRCERR_FAST, FRMERR_FAST and
 * STFERR_FAST for errors detected in the Data Phase of CAN FD frames with the
 * BRS bit set only. An error detected in a single CAN frame may be reported by
 * one or more error flags. Also, error reporting is cummulative in case more error
 * events happen in the next frames while the CPU does not attempt to read this
 * register. TXWRN, RXWRN, IDLE, TX, FLTCONF, RX and SYNCH are status bits.
 * BOFFINT, BOFFDONEINT, ERRINT, ERRINT_FAST , WAKINT, TWRNINT and RWRNINT are
 * interrupt bits. It is recommended the CPU to use the following procedure when
 * servicing interrupt requests generated by these bits: Read this register to capture
 * all error condition and status bits. This action clear the respective bits that
 * were set since the last read access. Write 1 to clear the interrupt bit that
 * has triggered the interrupt request. Write 1 to clear the ERR_OVR bit if it is
 * set. Starting from all error flags cleared, a first error event sets either
 * the ERRINT or the ERRINT_FAST (provided the corresponding mask bit is
 * asserted). If other error events in subsequent frames happen before the CPU to serve
 * the interrupt request, the ERR_OVR bit is set to indicate that errors from
 * different frames had accumulated. SYNCH IDLE TX RX FlexCAN State 0 0 0 0 Not
 * synchronized to CAN bus 1 1 x x Idle 1 0 1 0 Transmitting 1 0 0 1 Receiving
 */
/*!
 * @name Constants and macros for entire CAN_ESR1 register
 */
/*@{*/
#define CAN_RD_ESR1(base)        (CAN_ESR1_REG(base))
#define CAN_WR_ESR1(base, value) (CAN_ESR1_REG(base) = (value))
#define CAN_RMW_ESR1(base, mask, value) (CAN_WR_ESR1(base, (CAN_RD_ESR1(base) & ~(mask)) | (value)))
#define CAN_SET_ESR1(base, value) (CAN_WR_ESR1(base, CAN_RD_ESR1(base) |  (value)))
#define CAN_CLR_ESR1(base, value) (CAN_WR_ESR1(base, CAN_RD_ESR1(base) & ~(value)))
#define CAN_TOG_ESR1(base, value) (CAN_WR_ESR1(base, CAN_RD_ESR1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_ESR1 bitfields
 */

/*!
 * @name Register CAN_ESR1, field WAKINT[0] (W1C)
 *
 * This field applies when FlexCAN is in low-power mode under Self Wake Up
 * mechanism: Stop mode When a recessive-to-dominant transition is detected on the CAN
 * bus and if the CAN_MCR[WAKMSK] bit is set, an interrupt is generated to the
 * CPU. This bit is cleared by writing it to 1. When CAN_MCR[SLFWAK] is negated,
 * this flag is masked. The CPU must clear this flag before disabling the bit.
 * Otherwise it will be set when the SLFWAK is set again. Writing 0 has no effect.
 *
 * Values:
 * - 0b0 - No such occurrence.
 * - 0b1 - Indicates a recessive to dominant transition was received on the CAN
 *     bus.
 */
/*@{*/
/*! @brief Read current value of the CAN_ESR1_WAKINT field. */
#define CAN_RD_ESR1_WAKINT(base) ((CAN_ESR1_REG(base) & CAN_ESR1_WAKINT_MASK) >> CAN_ESR1_WAKINT_SHIFT)
#define CAN_BRD_ESR1_WAKINT(base) (BITBAND_ACCESS32(&CAN_ESR1_REG(base), CAN_ESR1_WAKINT_SHIFT))

/*! @brief Set the WAKINT field to a new value. */
#define CAN_WR_ESR1_WAKINT(base, value) (CAN_RMW_ESR1(base, (CAN_ESR1_WAKINT_MASK | CAN_ESR1_ERRINT_MASK | CAN_ESR1_BOFFINT_MASK | CAN_ESR1_RWRNINT_MASK | CAN_ESR1_TWRNINT_MASK | CAN_ESR1_BOFFDONEINT_MASK | CAN_ESR1_ERRINT_FAST_MASK | CAN_ESR1_ERROVR_MASK), CAN_ESR1_WAKINT(value)))
#define CAN_BWR_ESR1_WAKINT(base, value) (BITBAND_ACCESS32(&CAN_ESR1_REG(base), CAN_ESR1_WAKINT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_ESR1, field ERRINT[1] (W1C)
 *
 * This bit indicates that at least one of the Error Bits (BIT1ERR, BIT0ERR,
 * ACKERR. CRCERR, FRMERR or STFERR) is set. If the corresponding mask bit
 * CAN_CTRL1[ERRMSK] is set, an interrupt is generated to the CPU. This bit is cleared by
 * writing it to 1. Writing 0 has no effect.
 *
 * Values:
 * - 0b0 - No such occurrence.
 * - 0b1 - Indicates setting of any Error Bit in the Error and Status Register.
 */
/*@{*/
/*! @brief Read current value of the CAN_ESR1_ERRINT field. */
#define CAN_RD_ESR1_ERRINT(base) ((CAN_ESR1_REG(base) & CAN_ESR1_ERRINT_MASK) >> CAN_ESR1_ERRINT_SHIFT)
#define CAN_BRD_ESR1_ERRINT(base) (BITBAND_ACCESS32(&CAN_ESR1_REG(base), CAN_ESR1_ERRINT_SHIFT))

