nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the ERROVR field to a new value. */
#define CAN_WR_ESR1_ERROVR(base, value) (CAN_RMW_ESR1(base, (CAN_ESR1_ERROVR_MASK | CAN_ESR1_WAKINT_MASK | CAN_ESR1_ERRINT_MASK | CAN_ESR1_BOFFINT_MASK | CAN_ESR1_RWRNINT_MASK | CAN_ESR1_TWRNINT_MASK | CAN_ESR1_BOFFDONEINT_MASK | CAN_ESR1_ERRINT_FAST_MASK), CAN_ESR1_ERROVR(value)))
#define CAN_BWR_ESR1_ERROVR(base, value) (BITBAND_ACCESS32(&CAN_ESR1_REG(base), CAN_ESR1_ERROVR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_ESR1, field STFERR_FAST[26] (RO)
 *
 * This bit indicates that a Stuffing Error has been detected in the Data Phase
 * of CAN FD frames with the BRS bit set.
 *
 * Values:
 * - 0b0 - No such occurrence.
 * - 0b1 - A Stuffing Error occurred since last read of this register.
 */
/*@{*/
/*! @brief Read current value of the CAN_ESR1_STFERR_FAST field. */
#define CAN_RD_ESR1_STFERR_FAST(base) ((CAN_ESR1_REG(base) & CAN_ESR1_STFERR_FAST_MASK) >> CAN_ESR1_STFERR_FAST_SHIFT)
#define CAN_BRD_ESR1_STFERR_FAST(base) (BITBAND_ACCESS32(&CAN_ESR1_REG(base), CAN_ESR1_STFERR_FAST_SHIFT))
/*@}*/

/*!
 * @name Register CAN_ESR1, field FRMERR_FAST[27] (RO)
 *
 * This bit indicates that a Form Error has been detected by the receiver node
 * in the Data Phase of CAN FD frames with the BRS bit set, that is, a fixed-form
 * bit field contains at least one illegal bit.
 *
 * Values:
 * - 0b0 - No such occurrence.
 * - 0b1 - A Form Error occurred since last read of this register.
 */
/*@{*/
/*! @brief Read current value of the CAN_ESR1_FRMERR_FAST field. */
#define CAN_RD_ESR1_FRMERR_FAST(base) ((CAN_ESR1_REG(base) & CAN_ESR1_FRMERR_FAST_MASK) >> CAN_ESR1_FRMERR_FAST_SHIFT)
#define CAN_BRD_ESR1_FRMERR_FAST(base) (BITBAND_ACCESS32(&CAN_ESR1_REG(base), CAN_ESR1_FRMERR_FAST_SHIFT))
/*@}*/

/*!
 * @name Register CAN_ESR1, field CRCERR_FAST[28] (RO)
 *
 * This bit indicates that a CRC Error has been detected by the receiver node in
 * the CRC field of CAN FD frames with the BRS bit set, that is, the calculated
 * CRC is different from the received.
 *
 * Values:
 * - 0b0 - No such occurrence.
 * - 0b1 - A CRC error occurred since last read of this register.
 */
/*@{*/
/*! @brief Read current value of the CAN_ESR1_CRCERR_FAST field. */
#define CAN_RD_ESR1_CRCERR_FAST(base) ((CAN_ESR1_REG(base) & CAN_ESR1_CRCERR_FAST_MASK) >> CAN_ESR1_CRCERR_FAST_SHIFT)
#define CAN_BRD_ESR1_CRCERR_FAST(base) (BITBAND_ACCESS32(&CAN_ESR1_REG(base), CAN_ESR1_CRCERR_FAST_SHIFT))
/*@}*/

/*!
 * @name Register CAN_ESR1, field BIT0ERR_FAST[30] (RO)
 *
 * This bit indicates when an inconsistency occurs between the transmitted and
 * the received bit in the Data Phase of CAN FD frames with the BRS bit set.
 *
 * Values:
 * - 0b0 - No such occurrence.
 * - 0b1 - At least one bit sent as dominant is received as recessive.
 */
/*@{*/
/*! @brief Read current value of the CAN_ESR1_BIT0ERR_FAST field. */
#define CAN_RD_ESR1_BIT0ERR_FAST(base) ((CAN_ESR1_REG(base) & CAN_ESR1_BIT0ERR_FAST_MASK) >> CAN_ESR1_BIT0ERR_FAST_SHIFT)
#define CAN_BRD_ESR1_BIT0ERR_FAST(base) (BITBAND_ACCESS32(&CAN_ESR1_REG(base), CAN_ESR1_BIT0ERR_FAST_SHIFT))
/*@}*/

/*!
 * @name Register CAN_ESR1, field BIT1ERR_FAST[31] (RO)
 *
 * This bit indicates when an inconsistency occurs between the transmitted and
 * the received bit in the Data Phase of CAN FD frames with the BRS bit set.
 *
 * Values:
 * - 0b0 - No such occurrence.
 * - 0b1 - At least one bit sent as recessive is received as dominant.
 */
/*@{*/
/*! @brief Read current value of the CAN_ESR1_BIT1ERR_FAST field. */
#define CAN_RD_ESR1_BIT1ERR_FAST(base) ((CAN_ESR1_REG(base) & CAN_ESR1_BIT1ERR_FAST_MASK) >> CAN_ESR1_BIT1ERR_FAST_SHIFT)
#define CAN_BRD_ESR1_BIT1ERR_FAST(base) (BITBAND_ACCESS32(&CAN_ESR1_REG(base), CAN_ESR1_BIT1ERR_FAST_SHIFT))
/*@}*/

/*******************************************************************************
 * CAN_IMASK1 - Interrupt Masks 1 register
 ******************************************************************************/

/*!
 * @brief CAN_IMASK1 - Interrupt Masks 1 register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register allows any number of a range of the 32 Message Buffer
 * Interrupts to be enabled or disabled for MB31 to MB0. It contains one interrupt mask
 * bit per buffer, enabling the CPU to determine which buffer generates an
 * interrupt after a successful transmission or reception, that is, when the
 * corresponding CAN_IFLAG1 bit is set.
 */
/*!
 * @name Constants and macros for entire CAN_IMASK1 register
 */
/*@{*/
#define CAN_RD_IMASK1(base)      (CAN_IMASK1_REG(base))
#define CAN_WR_IMASK1(base, value) (CAN_IMASK1_REG(base) = (value))
#define CAN_RMW_IMASK1(base, mask, value) (CAN_WR_IMASK1(base, (CAN_RD_IMASK1(base) & ~(mask)) | (value)))
#define CAN_SET_IMASK1(base, value) (CAN_WR_IMASK1(base, CAN_RD_IMASK1(base) |  (value)))
#define CAN_CLR_IMASK1(base, value) (CAN_WR_IMASK1(base, CAN_RD_IMASK1(base) & ~(value)))
#define CAN_TOG_IMASK1(base, value) (CAN_WR_IMASK1(base, CAN_RD_IMASK1(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * CAN_IFLAG1 - Interrupt Flags 1 register
 ******************************************************************************/

/*!
 * @brief CAN_IFLAG1 - Interrupt Flags 1 register (W1C)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the flags for the32 Message Buffer interrupts for MB31
 * to MB0. It contains one interrupt flag bit per buffer. Each successful
 * transmission or reception sets the corresponding CAN_IFLAG1 bit. If the corresponding
 * CAN_IMASK1 bit is set, an interrupt will be generated. The interrupt flag
 * must be cleared by writing 1 to it. Writing 0 has no effect. There is an
 * exception when DMA for Rx FIFO is enabled, as described below. The BUF7I to BUF5I
 * flags are also used to represent FIFO interrupts when the Rx FIFO is enabled. When
 * the bit CAN_MCR[RFEN] is set and the bit CAN_MCR[DMA] is negated, the
 * function of the 8 least significant interrupt flags changes: BUF7I, BUF6I and BUF5I
 * indicate operating conditions of the FIFO, BUF0I is used to empty FIFO, and
 * BUF4I to BUF1I bits are reserved. Before enabling the CAN_MCR[RFEN], the CPU must
 * service the IFLAG bits asserted in the Rx FIFO region; see Section "Rx FIFO".
 * Otherwise, these IFLAG bits will mistakenly show the related MBs now
 * belonging to FIFO as having contents to be serviced. When the CAN_MCR[RFEN] bit is
 * negated, the FIFO flags must be cleared. The same care must be taken when an
 * CAN_CTRL2[RFFN] value is selected extending Rx FIFO filters beyond MB7. For
 * example, when RFFN is 0x8, the MB0-23 range is occupied by Rx FIFO filters and
 * related IFLAG bits must be cleared. When both the CAN_MCR[RFEN] and CAN_MCR[DMA]
 * bits are asserted (DMA feature for Rx FIFO enabled), the function of the 8 least
 * significant interrupt flags (BUF7I - BUF0I) are changed to support the DMA
 * operation. BUF7I and BUF6I are not used, as well as, BUF4I to BUF1I. BUF5I
 * indicates operating condition of FIFO, and BUF0I is used to empty FIFO. Moreover,
 * BUF5I does not generate a CPU interrupt, but generates a DMA request. IMASK1
 * bits in Rx FIFO region are not considered when bit CAN_MCR[DMA] is enabled. In
 * addition the CPU must not clear the flag BUF5I when DMA is enabled. Before
 * enabling the bit CAN_MCR[DMA], the CPU must service the IFLAGs asserted in the Rx
 * FIFO region. When the bit CAN_MCR[DMA] is negated, the FIFO must be empty.
 * FIFO must be disabled when FDEN bit in CAN_MCR register is enabled. Before
 * updating CAN_MCR[MAXMB] field, CPU must service the CAN_IFLAG1 bits whose MB value
 * is greater than the CAN_MCR[MAXMB] to be updated; otherwise, they will remain
 * set and be inconsistent with the number of MBs available.
 */
/*!
 * @name Constants and macros for entire CAN_IFLAG1 register
 */
/*@{*/
#define CAN_RD_IFLAG1(base)      (CAN_IFLAG1_REG(base))
#define CAN_WR_IFLAG1(base, value) (CAN_IFLAG1_REG(base) = (value))
#define CAN_RMW_IFLAG1(base, mask, value) (CAN_WR_IFLAG1(base, (CAN_RD_IFLAG1(base) & ~(mask)) | (value)))
#define CAN_SET_IFLAG1(base, value) (CAN_WR_IFLAG1(base, CAN_RD_IFLAG1(base) |  (value)))
#define CAN_CLR_IFLAG1(base, value) (CAN_WR_IFLAG1(base, CAN_RD_IFLAG1(base) & ~(value)))
#define CAN_TOG_IFLAG1(base, value) (CAN_WR_IFLAG1(base, CAN_RD_IFLAG1(base) ^  (value)))
/*@}*/

