nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * CAN_CTRL2 - Control 2 register
 ******************************************************************************/

/*!
 * @brief CAN_CTRL2 - Control 2 register (RW)
 *
 * Reset value: 0x00B00000U
 *
 * This register complements Control1 Register providing control bits for memory
 * write access in Freeze Mode, for extending FIFO filter quantity, and for
 * adjust the operation of internal FlexCAN processes like matching and arbitration.
 * The contents of this register are not affected by soft reset.
 */
/*!
 * @name Constants and macros for entire CAN_CTRL2 register
 */
/*@{*/
#define CAN_RD_CTRL2(base)       (CAN_CTRL2_REG(base))
#define CAN_WR_CTRL2(base, value) (CAN_CTRL2_REG(base) = (value))
#define CAN_RMW_CTRL2(base, mask, value) (CAN_WR_CTRL2(base, (CAN_RD_CTRL2(base) & ~(mask)) | (value)))
#define CAN_SET_CTRL2(base, value) (CAN_WR_CTRL2(base, CAN_RD_CTRL2(base) |  (value)))
#define CAN_CLR_CTRL2(base, value) (CAN_WR_CTRL2(base, CAN_RD_CTRL2(base) & ~(value)))
#define CAN_TOG_CTRL2(base, value) (CAN_WR_CTRL2(base, CAN_RD_CTRL2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_CTRL2 bitfields
 */

/*!
 * @name Register CAN_CTRL2, field EDFLTDIS[11] (RW)
 *
 * This bit disables the Edge Filter used during the bus integration state. When
 * the Edge Filter is enabled, two consecutive nominal time quanta with dominant
 * bus state are required to detect an edge that causes synchronization. When
 * synchronization occurs, the counting of the sequence of eleven consecutive
 * recessive bits is restarted. The Edge Filter prevents the dominant pulses that are
 * shorter than a nominal bit time (present during the data phase of an FD Frame)
 * from being mistaken for an idle condition.
 *
 * Values:
 * - 0b0 - Edge Filter is enabled.
 * - 0b1 - Edge Filter is disabled.
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL2_EDFLTDIS field. */
#define CAN_RD_CTRL2_EDFLTDIS(base) ((CAN_CTRL2_REG(base) & CAN_CTRL2_EDFLTDIS_MASK) >> CAN_CTRL2_EDFLTDIS_SHIFT)
#define CAN_BRD_CTRL2_EDFLTDIS(base) (BITBAND_ACCESS32(&CAN_CTRL2_REG(base), CAN_CTRL2_EDFLTDIS_SHIFT))

/*! @brief Set the EDFLTDIS field to a new value. */
#define CAN_WR_CTRL2_EDFLTDIS(base, value) (CAN_RMW_CTRL2(base, CAN_CTRL2_EDFLTDIS_MASK, CAN_CTRL2_EDFLTDIS(value)))
#define CAN_BWR_CTRL2_EDFLTDIS(base, value) (BITBAND_ACCESS32(&CAN_CTRL2_REG(base), CAN_CTRL2_EDFLTDIS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_CTRL2, field STFCNTEN[12] (RW)
 *
 * This bit enables the count of variable stuff bits inserted from the Start of
 * Frame bit to the last bit of Data field. Also, the modulo 8 count of variable
 * stuff bits plus the respective parity bit (even parity calculated over the
 * 3-bit modulo 8 count) are combined as the 4-bit Stuff Count field and inserted
 * before the CRC Sequence field. CRC calculation extends beyound the end of Data
 * field and takes the Stuff Count field bits into account.
 *
 * Values:
 * - 0b0 - Stuff Count feature is disabled. Stuff Count bit field is not
 *     inserted before the CRC Sequence field.
 * - 0b1 - Stuff Count feature is enabled. Stuff Count bit field is inserted
 *     before the CRC Sequence field.
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL2_STFCNTEN field. */
#define CAN_RD_CTRL2_STFCNTEN(base) ((CAN_CTRL2_REG(base) & CAN_CTRL2_STFCNTEN_MASK) >> CAN_CTRL2_STFCNTEN_SHIFT)
#define CAN_BRD_CTRL2_STFCNTEN(base) (BITBAND_ACCESS32(&CAN_CTRL2_REG(base), CAN_CTRL2_STFCNTEN_SHIFT))

/*! @brief Set the STFCNTEN field to a new value. */
#define CAN_WR_CTRL2_STFCNTEN(base, value) (CAN_RMW_CTRL2(base, CAN_CTRL2_STFCNTEN_MASK, CAN_CTRL2_STFCNTEN(value)))
#define CAN_BWR_CTRL2_STFCNTEN(base, value) (BITBAND_ACCESS32(&CAN_CTRL2_REG(base), CAN_CTRL2_STFCNTEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_CTRL2, field PREXCEN[14] (RW)
 *
 * This bit enables the Protocol Exception feature.
 *
 * Values:
 * - 0b0 - Protocol Exception is disabled.
 * - 0b1 - Protocol Exception is enabled.
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL2_PREXCEN field. */
#define CAN_RD_CTRL2_PREXCEN(base) ((CAN_CTRL2_REG(base) & CAN_CTRL2_PREXCEN_MASK) >> CAN_CTRL2_PREXCEN_SHIFT)
#define CAN_BRD_CTRL2_PREXCEN(base) (BITBAND_ACCESS32(&CAN_CTRL2_REG(base), CAN_CTRL2_PREXCEN_SHIFT))

/*! @brief Set the PREXCEN field to a new value. */
#define CAN_WR_CTRL2_PREXCEN(base, value) (CAN_RMW_CTRL2(base, CAN_CTRL2_PREXCEN_MASK, CAN_CTRL2_PREXCEN(value)))
#define CAN_BWR_CTRL2_PREXCEN(base, value) (BITBAND_ACCESS32(&CAN_CTRL2_REG(base), CAN_CTRL2_PREXCEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_CTRL2, field TIMER_SRC[15] (RW)
 *
 * Selects the time tick source used for incrementing the Free Running Timer
 * counter. This bit can be written in Freeze mode only.
 *
 * Values:
 * - 0b0 - The Free Running Timer is clocked by the CAN bit clock, which defines
 *     the baud rate on the CAN bus.
 * - 0b1 - The Free Running Timer is clocked by an external time tick. The
 *     period can be either adjusted to be equal to the baud rate on the CAN bus, or a
 *     different value as required. See the device specific section for details
 *     about the external time tick.
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL2_TIMER_SRC field. */
#define CAN_RD_CTRL2_TIMER_SRC(base) ((CAN_CTRL2_REG(base) & CAN_CTRL2_TIMER_SRC_MASK) >> CAN_CTRL2_TIMER_SRC_SHIFT)
#define CAN_BRD_CTRL2_TIMER_SRC(base) (BITBAND_ACCESS32(&CAN_CTRL2_REG(base), CAN_CTRL2_TIMER_SRC_SHIFT))

/*! @brief Set the TIMER_SRC field to a new value. */
#define CAN_WR_CTRL2_TIMER_SRC(base, value) (CAN_RMW_CTRL2(base, CAN_CTRL2_TIMER_SRC_MASK, CAN_CTRL2_TIMER_SRC(value)))
#define CAN_BWR_CTRL2_TIMER_SRC(base, value) (BITBAND_ACCESS32(&CAN_CTRL2_REG(base), CAN_CTRL2_TIMER_SRC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_CTRL2, field EACEN[16] (RW)
 *
 * This bit controls the comparison of IDE and RTR bits within Rx Mailboxes
 * filters with their corresponding bits in the incoming frame by the matching
 * process. This bit does not affect matching for Rx FIFO. This bit can be written only
 * in Freeze mode because it is blocked by hardware in other modes.
 *
 * Values:
 * - 0b0 - Rx Mailbox filter's IDE bit is always compared and RTR is never
 *     compared despite mask bits.
 * - 0b1 - Enables the comparison of both Rx Mailbox filter's IDE and RTR bit
 *     with their corresponding bits within the incoming frame. Mask bits do apply.
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL2_EACEN field. */
#define CAN_RD_CTRL2_EACEN(base) ((CAN_CTRL2_REG(base) & CAN_CTRL2_EACEN_MASK) >> CAN_CTRL2_EACEN_SHIFT)
#define CAN_BRD_CTRL2_EACEN(base) (BITBAND_ACCESS32(&CAN_CTRL2_REG(base), CAN_CTRL2_EACEN_SHIFT))

/*! @brief Set the EACEN field to a new value. */
#define CAN_WR_CTRL2_EACEN(base, value) (CAN_RMW_CTRL2(base, CAN_CTRL2_EACEN_MASK, CAN_CTRL2_EACEN(value)))
#define CAN_BWR_CTRL2_EACEN(base, value) (BITBAND_ACCESS32(&CAN_CTRL2_REG(base), CAN_CTRL2_EACEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_CTRL2, field RRS[17] (RW)
 *
 * If this bit is asserted Remote Request Frame is submitted to a matching
 * process and stored in the corresponding Message Buffer in the same fashion of a
 * Data Frame. No automatic Remote Response Frame will be generated. If this bit is
 * negated the Remote Request Frame is submitted to a matching process and an
 * automatic Remote Response Frame is generated if a Message Buffer with CODE=0b1010
 * is found with the same ID. This bit can be written only in Freeze mode
 * because it is blocked by hardware in other modes.
 *
 * Values:
 * - 0b0 - Remote Response Frame is generated.
 * - 0b1 - Remote Request Frame is stored.
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL2_RRS field. */
#define CAN_RD_CTRL2_RRS(base) ((CAN_CTRL2_REG(base) & CAN_CTRL2_RRS_MASK) >> CAN_CTRL2_RRS_SHIFT)
#define CAN_BRD_CTRL2_RRS(base) (BITBAND_ACCESS32(&CAN_CTRL2_REG(base), CAN_CTRL2_RRS_SHIFT))

