nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual CAN_CTRL1_PN bitfields
 */

/*!
 * @name Register CAN_CTRL1_PN, field FCS[1:0] (RW)
 *
 * This 2-bit field selects the filtering criteria to be applied when FlexCAN is
 * under Pretended Networking mode. See Receive Process under Pretended
 * Networking Mode for more details.
 *
 * Values:
 * - 0b00 - Message ID filtering only
 * - 0b01 - Message ID filtering and payload filtering
 * - 0b10 - Message ID filtering occurring a specified number of times.
 * - 0b11 - Message ID filtering and payload filtering a specified number of
 *     times
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL1_PN_FCS field. */
#define CAN_RD_CTRL1_PN_FCS(base) ((CAN_CTRL1_PN_REG(base) & CAN_CTRL1_PN_FCS_MASK) >> CAN_CTRL1_PN_FCS_SHIFT)
#define CAN_BRD_CTRL1_PN_FCS(base) (CAN_RD_CTRL1_PN_FCS(base))

/*! @brief Set the FCS field to a new value. */
#define CAN_WR_CTRL1_PN_FCS(base, value) (CAN_RMW_CTRL1_PN(base, CAN_CTRL1_PN_FCS_MASK, CAN_CTRL1_PN_FCS(value)))
#define CAN_BWR_CTRL1_PN_FCS(base, value) (CAN_WR_CTRL1_PN_FCS(base, value))
/*@}*/

/*!
 * @name Register CAN_CTRL1_PN, field IDFS[3:2] (RW)
 *
 * This 2-bit field selects the level of ID filtering to be applied when FlexCAN
 * is under Pretended Networking mode. In ID filtering, the IDE and RTR bits are
 * also considered as part of reception filter if IDE_MSK and RTR_MSK bits inthe
 * CAN_FLT_ID2_IDMASK register are set.
 *
 * Values:
 * - 0b00 - Match upon a ID contents against an exact target value
 * - 0b01 - Match upon a ID value greater than or equal to a specified target
 *     value
 * - 0b10 - Match upon a ID value smaller than or equal to a specified target
 *     value
 * - 0b11 - Match upon a ID value inside a range, greater than or equal to a
 *     specified lower limit and smaller than or equal a specified upper limit
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL1_PN_IDFS field. */
#define CAN_RD_CTRL1_PN_IDFS(base) ((CAN_CTRL1_PN_REG(base) & CAN_CTRL1_PN_IDFS_MASK) >> CAN_CTRL1_PN_IDFS_SHIFT)
#define CAN_BRD_CTRL1_PN_IDFS(base) (CAN_RD_CTRL1_PN_IDFS(base))

/*! @brief Set the IDFS field to a new value. */
#define CAN_WR_CTRL1_PN_IDFS(base, value) (CAN_RMW_CTRL1_PN(base, CAN_CTRL1_PN_IDFS_MASK, CAN_CTRL1_PN_IDFS(value)))
#define CAN_BWR_CTRL1_PN_IDFS(base, value) (CAN_WR_CTRL1_PN_IDFS(base, value))
/*@}*/

/*!
 * @name Register CAN_CTRL1_PN, field PLFS[5:4] (RW)
 *
 * This 2-bit field selects the level of payload filtering to be applied when
 * FlexCAN is under Pretended Networking mode. Filtering does not accept remote
 * messages (RTR=1) when payload filtering is active.
 *
 * Values:
 * - 0b00 - Match upon a payload contents against an exact target value
 * - 0b01 - Match upon a payload value greater than or equal to a specified
 *     target value
 * - 0b10 - Match upon a payload value smaller than or equal to a specified
 *     target value
 * - 0b11 - Match upon a payload value inside a range, greater than or equal to
 *     a specified lower limit and smaller than or equal a specified upper limit
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL1_PN_PLFS field. */
#define CAN_RD_CTRL1_PN_PLFS(base) ((CAN_CTRL1_PN_REG(base) & CAN_CTRL1_PN_PLFS_MASK) >> CAN_CTRL1_PN_PLFS_SHIFT)
#define CAN_BRD_CTRL1_PN_PLFS(base) (CAN_RD_CTRL1_PN_PLFS(base))

/*! @brief Set the PLFS field to a new value. */
#define CAN_WR_CTRL1_PN_PLFS(base, value) (CAN_RMW_CTRL1_PN(base, CAN_CTRL1_PN_PLFS_MASK, CAN_CTRL1_PN_PLFS(value)))
#define CAN_BWR_CTRL1_PN_PLFS(base, value) (CAN_WR_CTRL1_PN_PLFS(base, value))
/*@}*/

/*!
 * @name Register CAN_CTRL1_PN, field NMATCH[15:8] (RW)
 *
 * This 8-bit field defines the number of times a given message must match the
 * predefined filtering criteria for ID and/or PL before generating a wake up
 * event. This quantity can be configured in the 1 to 255 range by using values from
 * 0x01 to 0xFF, respectively.
 *
 * Values:
 * - 0b00000001 - Received message must match the predefined filtering criteria
 *     for ID and/or PL once before generating a wake up event.
 * - 0b00000010 - Received message must match the predefined filtering criteria
 *     for ID and/or PL twice before generating a wake up event.
 * - 0b11111111 - Received message must match the predefined filtering criteria
 *     for ID and/or PL 255 times before generating a wake up event.
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL1_PN_NMATCH field. */
#define CAN_RD_CTRL1_PN_NMATCH(base) ((CAN_CTRL1_PN_REG(base) & CAN_CTRL1_PN_NMATCH_MASK) >> CAN_CTRL1_PN_NMATCH_SHIFT)
#define CAN_BRD_CTRL1_PN_NMATCH(base) (CAN_RD_CTRL1_PN_NMATCH(base))

/*! @brief Set the NMATCH field to a new value. */
#define CAN_WR_CTRL1_PN_NMATCH(base, value) (CAN_RMW_CTRL1_PN(base, CAN_CTRL1_PN_NMATCH_MASK, CAN_CTRL1_PN_NMATCH(value)))
#define CAN_BWR_CTRL1_PN_NMATCH(base, value) (CAN_WR_CTRL1_PN_NMATCH(base, value))
/*@}*/

/*!
 * @name Register CAN_CTRL1_PN, field WUMF_MSK[16] (RW)
 *
 * This bit masks the generation of a wake up event originated by a successful
 * filtered Rx message.
 *
 * Values:
 * - 0b0 - Wake up match event is disabled
 * - 0b1 - Wake up match event is enabled
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL1_PN_WUMF_MSK field. */
#define CAN_RD_CTRL1_PN_WUMF_MSK(base) ((CAN_CTRL1_PN_REG(base) & CAN_CTRL1_PN_WUMF_MSK_MASK) >> CAN_CTRL1_PN_WUMF_MSK_SHIFT)
#define CAN_BRD_CTRL1_PN_WUMF_MSK(base) (BITBAND_ACCESS32(&CAN_CTRL1_PN_REG(base), CAN_CTRL1_PN_WUMF_MSK_SHIFT))

/*! @brief Set the WUMF_MSK field to a new value. */
#define CAN_WR_CTRL1_PN_WUMF_MSK(base, value) (CAN_RMW_CTRL1_PN(base, CAN_CTRL1_PN_WUMF_MSK_MASK, CAN_CTRL1_PN_WUMF_MSK(value)))
#define CAN_BWR_CTRL1_PN_WUMF_MSK(base, value) (BITBAND_ACCESS32(&CAN_CTRL1_PN_REG(base), CAN_CTRL1_PN_WUMF_MSK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_CTRL1_PN, field WTOF_MSK[17] (RW)
 *
 * This bit masks the generation of a wake up event originated by a timeout.
 *
 * Values:
 * - 0b0 - Timeout wake up event is disabled
 * - 0b1 - Timeout wake up event is enabled
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL1_PN_WTOF_MSK field. */
#define CAN_RD_CTRL1_PN_WTOF_MSK(base) ((CAN_CTRL1_PN_REG(base) & CAN_CTRL1_PN_WTOF_MSK_MASK) >> CAN_CTRL1_PN_WTOF_MSK_SHIFT)
#define CAN_BRD_CTRL1_PN_WTOF_MSK(base) (BITBAND_ACCESS32(&CAN_CTRL1_PN_REG(base), CAN_CTRL1_PN_WTOF_MSK_SHIFT))

/*! @brief Set the WTOF_MSK field to a new value. */
#define CAN_WR_CTRL1_PN_WTOF_MSK(base, value) (CAN_RMW_CTRL1_PN(base, CAN_CTRL1_PN_WTOF_MSK_MASK, CAN_CTRL1_PN_WTOF_MSK(value)))
#define CAN_BWR_CTRL1_PN_WTOF_MSK(base, value) (BITBAND_ACCESS32(&CAN_CTRL1_PN_REG(base), CAN_CTRL1_PN_WTOF_MSK_SHIFT) = (value))
/*@}*/

