nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * CAN_CTRL2_PN - Pretended Networking Control 2 Register
 ******************************************************************************/

/*!
 * @brief CAN_CTRL2_PN - Pretended Networking Control 2 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains configuration bits for the timeout value under
 * Pretended Networking mode. It can be written in Freeze mode only.
 */
/*!
 * @name Constants and macros for entire CAN_CTRL2_PN register
 */
/*@{*/
#define CAN_RD_CTRL2_PN(base)    (CAN_CTRL2_PN_REG(base))
#define CAN_WR_CTRL2_PN(base, value) (CAN_CTRL2_PN_REG(base) = (value))
#define CAN_RMW_CTRL2_PN(base, mask, value) (CAN_WR_CTRL2_PN(base, (CAN_RD_CTRL2_PN(base) & ~(mask)) | (value)))
#define CAN_SET_CTRL2_PN(base, value) (CAN_WR_CTRL2_PN(base, CAN_RD_CTRL2_PN(base) |  (value)))
#define CAN_CLR_CTRL2_PN(base, value) (CAN_WR_CTRL2_PN(base, CAN_RD_CTRL2_PN(base) & ~(value)))
#define CAN_TOG_CTRL2_PN(base, value) (CAN_WR_CTRL2_PN(base, CAN_RD_CTRL2_PN(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_CTRL2_PN bitfields
 */

/*!
 * @name Register CAN_CTRL2_PN, field MATCHTO[15:0] (RW)
 *
 * This 16-bit field defines a timeout value that generates a wake up event if
 * CAN_MCR[PNET_EN] is asserted. If the timeout counter reaches the target value,
 * when FlexCAN is under Pretended Networking mode, then a wake up event is
 * generated. The timeout limit can be configured from 1 to 65535 to control an
 * internal 16-bit up-count timer to produce a trigger upon reaching this configured
 * value. The internal timer is incremented based on periodic time ticks, which
 * period is 64 times the CAN Bit Time unit. When MATCHTO is configured with 0x0000
 * the timeout is disabled.
 */
/*@{*/
/*! @brief Read current value of the CAN_CTRL2_PN_MATCHTO field. */
#define CAN_RD_CTRL2_PN_MATCHTO(base) ((CAN_CTRL2_PN_REG(base) & CAN_CTRL2_PN_MATCHTO_MASK) >> CAN_CTRL2_PN_MATCHTO_SHIFT)
#define CAN_BRD_CTRL2_PN_MATCHTO(base) (CAN_RD_CTRL2_PN_MATCHTO(base))

/*! @brief Set the MATCHTO field to a new value. */
#define CAN_WR_CTRL2_PN_MATCHTO(base, value) (CAN_RMW_CTRL2_PN(base, CAN_CTRL2_PN_MATCHTO_MASK, CAN_CTRL2_PN_MATCHTO(value)))
#define CAN_BWR_CTRL2_PN_MATCHTO(base, value) (CAN_WR_CTRL2_PN_MATCHTO(base, value))
/*@}*/

/*******************************************************************************
 * CAN_WU_MTC - Pretended Networking Wake Up Match Register
 ******************************************************************************/

/*!
 * @brief CAN_WU_MTC - Pretended Networking Wake Up Match Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This read-only register contains wake up information related to the matching
 * processes performed while FlexCAN receives frames under Pretended Networking
 * mode.
 */
/*!
 * @name Constants and macros for entire CAN_WU_MTC register
 */
/*@{*/
#define CAN_RD_WU_MTC(base)      (CAN_WU_MTC_REG(base))
#define CAN_WR_WU_MTC(base, value) (CAN_WU_MTC_REG(base) = (value))
#define CAN_RMW_WU_MTC(base, mask, value) (CAN_WR_WU_MTC(base, (CAN_RD_WU_MTC(base) & ~(mask)) | (value)))
#define CAN_SET_WU_MTC(base, value) (CAN_WR_WU_MTC(base, CAN_RD_WU_MTC(base) |  (value)))
#define CAN_CLR_WU_MTC(base, value) (CAN_WR_WU_MTC(base, CAN_RD_WU_MTC(base) & ~(value)))
#define CAN_TOG_WU_MTC(base, value) (CAN_WR_WU_MTC(base, CAN_RD_WU_MTC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_WU_MTC bitfields
 */

/*!
 * @name Register CAN_WU_MTC, field MCOUNTER[15:8] (RO)
 *
 * This 8-bit field reports the number of times a given message have been
 * matched the predefined filtering criteria for ID and/or PL before a wake up event.
 * This register is reset by FlexCAN when it enters in Pretended Networing mode,
 * and is not affected by soft reset.
 */
/*@{*/
/*! @brief Read current value of the CAN_WU_MTC_MCOUNTER field. */
#define CAN_RD_WU_MTC_MCOUNTER(base) ((CAN_WU_MTC_REG(base) & CAN_WU_MTC_MCOUNTER_MASK) >> CAN_WU_MTC_MCOUNTER_SHIFT)
#define CAN_BRD_WU_MTC_MCOUNTER(base) (CAN_RD_WU_MTC_MCOUNTER(base))
/*@}*/

/*!
 * @name Register CAN_WU_MTC, field WUMF[16] (W1C)
 *
 * This bit identifies whether the FlexCAN has detected a matching Rx incoming
 * message, which passed the filtering criteria specified in CAN_CTRL1_PN
 * register. This flag generates a wake up event if CAN_CTRL1_PN[WUMF_MSK] is enabled.
 *
 * Values:
 * - 0b0 - No wake up by match event detected
 * - 0b1 - Wake up by match event detected
 */
/*@{*/
/*! @brief Read current value of the CAN_WU_MTC_WUMF field. */
#define CAN_RD_WU_MTC_WUMF(base) ((CAN_WU_MTC_REG(base) & CAN_WU_MTC_WUMF_MASK) >> CAN_WU_MTC_WUMF_SHIFT)
#define CAN_BRD_WU_MTC_WUMF(base) (BITBAND_ACCESS32(&CAN_WU_MTC_REG(base), CAN_WU_MTC_WUMF_SHIFT))

/*! @brief Set the WUMF field to a new value. */
#define CAN_WR_WU_MTC_WUMF(base, value) (CAN_RMW_WU_MTC(base, (CAN_WU_MTC_WUMF_MASK | CAN_WU_MTC_WTOF_MASK), CAN_WU_MTC_WUMF(value)))
#define CAN_BWR_WU_MTC_WUMF(base, value) (BITBAND_ACCESS32(&CAN_WU_MTC_REG(base), CAN_WU_MTC_WUMF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_WU_MTC, field WTOF[17] (W1C)
 *
 * This bit identifies whether the FlexCAN has detected a timeout event during a
 * time interval defined by CAN_CTRL2_PN[MATCHTO]. This flag generates a wake up
 * event if CAN_CTRL1_PN[WTOF_MSK] is enabled.
 *
 * Values:
 * - 0b0 - No wake up by timeout event detected
 * - 0b1 - Wake up by timeout event detected
 */
/*@{*/
/*! @brief Read current value of the CAN_WU_MTC_WTOF field. */
#define CAN_RD_WU_MTC_WTOF(base) ((CAN_WU_MTC_REG(base) & CAN_WU_MTC_WTOF_MASK) >> CAN_WU_MTC_WTOF_SHIFT)
#define CAN_BRD_WU_MTC_WTOF(base) (BITBAND_ACCESS32(&CAN_WU_MTC_REG(base), CAN_WU_MTC_WTOF_SHIFT))

/*! @brief Set the WTOF field to a new value. */
#define CAN_WR_WU_MTC_WTOF(base, value) (CAN_RMW_WU_MTC(base, (CAN_WU_MTC_WTOF_MASK | CAN_WU_MTC_WUMF_MASK), CAN_WU_MTC_WTOF(value)))
#define CAN_BWR_WU_MTC_WTOF(base, value) (BITBAND_ACCESS32(&CAN_WU_MTC_REG(base), CAN_WU_MTC_WTOF_SHIFT) = (value))
/*@}*/

