nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * CAN_FLT_ID1 - Pretended Networking ID Filter 1 Register
 ******************************************************************************/

/*!
 * @brief CAN_FLT_ID1 - Pretended Networking ID Filter 1 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains FLT_ID1 target value, as well as, IDE and RTR target
 * values used to filter incoming message ID. The FLT_ID1 is used either for equal
 * to, smaller than, greater than comparisons, or as the lower limit value in a
 * ID range detection. It can be written in Freeze mode only.
 */
/*!
 * @name Constants and macros for entire CAN_FLT_ID1 register
 */
/*@{*/
#define CAN_RD_FLT_ID1(base)     (CAN_FLT_ID1_REG(base))
#define CAN_WR_FLT_ID1(base, value) (CAN_FLT_ID1_REG(base) = (value))
#define CAN_RMW_FLT_ID1(base, mask, value) (CAN_WR_FLT_ID1(base, (CAN_RD_FLT_ID1(base) & ~(mask)) | (value)))
#define CAN_SET_FLT_ID1(base, value) (CAN_WR_FLT_ID1(base, CAN_RD_FLT_ID1(base) |  (value)))
#define CAN_CLR_FLT_ID1(base, value) (CAN_WR_FLT_ID1(base, CAN_RD_FLT_ID1(base) & ~(value)))
#define CAN_TOG_FLT_ID1(base, value) (CAN_WR_FLT_ID1(base, CAN_RD_FLT_ID1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_FLT_ID1 bitfields
 */

/*!
 * @name Register CAN_FLT_ID1, field FLT_ID1[28:0] (RW)
 *
 * This 29-bit field defines either the 29 bits of a extended frame format,
 * considering all bits, or the 11 bits of a standard frame format, considering just
 * the 11 leftmost bits.
 */
/*@{*/
/*! @brief Read current value of the CAN_FLT_ID1_FLT_ID1 field. */
#define CAN_RD_FLT_ID1_FLT_ID1(base) ((CAN_FLT_ID1_REG(base) & CAN_FLT_ID1_FLT_ID1_MASK) >> CAN_FLT_ID1_FLT_ID1_SHIFT)
#define CAN_BRD_FLT_ID1_FLT_ID1(base) (CAN_RD_FLT_ID1_FLT_ID1(base))

/*! @brief Set the FLT_ID1 field to a new value. */
#define CAN_WR_FLT_ID1_FLT_ID1(base, value) (CAN_RMW_FLT_ID1(base, CAN_FLT_ID1_FLT_ID1_MASK, CAN_FLT_ID1_FLT_ID1(value)))
#define CAN_BWR_FLT_ID1_FLT_ID1(base, value) (CAN_WR_FLT_ID1_FLT_ID1(base, value))
/*@}*/

/*!
 * @name Register CAN_FLT_ID1, field FLT_RTR[29] (RW)
 *
 * This bit identifies whether the frame is remote or not. It is used as part of
 * the ID reception filter.
 *
 * Values:
 * - 0b0 - Reject remote frame (accept data frame)
 * - 0b1 - Accept remote frame
 */
/*@{*/
/*! @brief Read current value of the CAN_FLT_ID1_FLT_RTR field. */
#define CAN_RD_FLT_ID1_FLT_RTR(base) ((CAN_FLT_ID1_REG(base) & CAN_FLT_ID1_FLT_RTR_MASK) >> CAN_FLT_ID1_FLT_RTR_SHIFT)
#define CAN_BRD_FLT_ID1_FLT_RTR(base) (BITBAND_ACCESS32(&CAN_FLT_ID1_REG(base), CAN_FLT_ID1_FLT_RTR_SHIFT))

/*! @brief Set the FLT_RTR field to a new value. */
#define CAN_WR_FLT_ID1_FLT_RTR(base, value) (CAN_RMW_FLT_ID1(base, CAN_FLT_ID1_FLT_RTR_MASK, CAN_FLT_ID1_FLT_RTR(value)))
#define CAN_BWR_FLT_ID1_FLT_RTR(base, value) (BITBAND_ACCESS32(&CAN_FLT_ID1_REG(base), CAN_FLT_ID1_FLT_RTR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_FLT_ID1, field FLT_IDE[30] (RW)
 *
 * This bit identifies whether the frame format is standard or extended. It is
 * used as part of the ID reception filter.
 *
 * Values:
 * - 0b0 - Accept standard frame format
 * - 0b1 - Accept extended frame format
 */
/*@{*/
/*! @brief Read current value of the CAN_FLT_ID1_FLT_IDE field. */
#define CAN_RD_FLT_ID1_FLT_IDE(base) ((CAN_FLT_ID1_REG(base) & CAN_FLT_ID1_FLT_IDE_MASK) >> CAN_FLT_ID1_FLT_IDE_SHIFT)
#define CAN_BRD_FLT_ID1_FLT_IDE(base) (BITBAND_ACCESS32(&CAN_FLT_ID1_REG(base), CAN_FLT_ID1_FLT_IDE_SHIFT))

/*! @brief Set the FLT_IDE field to a new value. */
#define CAN_WR_FLT_ID1_FLT_IDE(base, value) (CAN_RMW_FLT_ID1(base, CAN_FLT_ID1_FLT_IDE_MASK, CAN_FLT_ID1_FLT_IDE(value)))
#define CAN_BWR_FLT_ID1_FLT_IDE(base, value) (BITBAND_ACCESS32(&CAN_FLT_ID1_REG(base), CAN_FLT_ID1_FLT_IDE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * CAN_FLT_DLC - Pretended Networking DLC Filter Register
 ******************************************************************************/

/*!
 * @brief CAN_FLT_DLC - Pretended Networking DLC Filter Register (RW)
 *
 * Reset value: 0x00000008U
 *
 * This register contains the DLC inside range target values (FLT_DLC_LO and
 * FLT_DLC_HI) used to filter incoming message. The DLC range is used only for
 * payload filtering. It can be written in Freeze mode only. When a fixed quantity of
 * data bytes is required, both FLT_DLC_LO and FLT_DLC_HI need to be configured
 * with the same value, otherwise a range of DLC is considered for filtering (see
 * Receive Process under Pretended Networking Mode).
 */
/*!
 * @name Constants and macros for entire CAN_FLT_DLC register
 */
/*@{*/
#define CAN_RD_FLT_DLC(base)     (CAN_FLT_DLC_REG(base))
#define CAN_WR_FLT_DLC(base, value) (CAN_FLT_DLC_REG(base) = (value))
#define CAN_RMW_FLT_DLC(base, mask, value) (CAN_WR_FLT_DLC(base, (CAN_RD_FLT_DLC(base) & ~(mask)) | (value)))
#define CAN_SET_FLT_DLC(base, value) (CAN_WR_FLT_DLC(base, CAN_RD_FLT_DLC(base) |  (value)))
#define CAN_CLR_FLT_DLC(base, value) (CAN_WR_FLT_DLC(base, CAN_RD_FLT_DLC(base) & ~(value)))
#define CAN_TOG_FLT_DLC(base, value) (CAN_WR_FLT_DLC(base, CAN_RD_FLT_DLC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_FLT_DLC bitfields
 */

/*!
 * @name Register CAN_FLT_DLC, field FLT_DLC_HI[3:0] (RW)
 *
 * This field specifies the upper limit for the number of data bytes considered
 * valid for payload comparison. It is used as part of payload reception filter.
 */
/*@{*/
/*! @brief Read current value of the CAN_FLT_DLC_FLT_DLC_HI field. */
#define CAN_RD_FLT_DLC_FLT_DLC_HI(base) ((CAN_FLT_DLC_REG(base) & CAN_FLT_DLC_FLT_DLC_HI_MASK) >> CAN_FLT_DLC_FLT_DLC_HI_SHIFT)
#define CAN_BRD_FLT_DLC_FLT_DLC_HI(base) (CAN_RD_FLT_DLC_FLT_DLC_HI(base))

/*! @brief Set the FLT_DLC_HI field to a new value. */
#define CAN_WR_FLT_DLC_FLT_DLC_HI(base, value) (CAN_RMW_FLT_DLC(base, CAN_FLT_DLC_FLT_DLC_HI_MASK, CAN_FLT_DLC_FLT_DLC_HI(value)))
#define CAN_BWR_FLT_DLC_FLT_DLC_HI(base, value) (CAN_WR_FLT_DLC_FLT_DLC_HI(base, value))
/*@}*/

/*!
 * @name Register CAN_FLT_DLC, field FLT_DLC_LO[19:16] (RW)
 *
 * This field specifies the lower limit for the number of data bytes considered
 * valid for payload comparison. It is used as part of payload reception filter.
 */
/*@{*/
/*! @brief Read current value of the CAN_FLT_DLC_FLT_DLC_LO field. */
#define CAN_RD_FLT_DLC_FLT_DLC_LO(base) ((CAN_FLT_DLC_REG(base) & CAN_FLT_DLC_FLT_DLC_LO_MASK) >> CAN_FLT_DLC_FLT_DLC_LO_SHIFT)
#define CAN_BRD_FLT_DLC_FLT_DLC_LO(base) (CAN_RD_FLT_DLC_FLT_DLC_LO(base))

/*! @brief Set the FLT_DLC_LO field to a new value. */
#define CAN_WR_FLT_DLC_FLT_DLC_LO(base, value) (CAN_RMW_FLT_DLC(base, CAN_FLT_DLC_FLT_DLC_LO_MASK, CAN_FLT_DLC_FLT_DLC_LO(value)))
#define CAN_BWR_FLT_DLC_FLT_DLC_LO(base, value) (CAN_WR_FLT_DLC_FLT_DLC_LO(base, value))
/*@}*/

