nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * CAN_PL1_LO - Pretended Networking Payload Low Filter 1 Register
 ******************************************************************************/

/*!
 * @brief CAN_PL1_LO - Pretended Networking Payload Low Filter 1 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains Payload Filter 1 low order bits of the target value
 * used to filter incoming message payload. It is used either for "equal to",
 * "smaller than or equal", "greater than or equal" comparisons, or as the lower limit
 * value in a payload range detection. It can be written in Freeze mode only.
 */
/*!
 * @name Constants and macros for entire CAN_PL1_LO register
 */
/*@{*/
#define CAN_RD_PL1_LO(base)      (CAN_PL1_LO_REG(base))
#define CAN_WR_PL1_LO(base, value) (CAN_PL1_LO_REG(base) = (value))
#define CAN_RMW_PL1_LO(base, mask, value) (CAN_WR_PL1_LO(base, (CAN_RD_PL1_LO(base) & ~(mask)) | (value)))
#define CAN_SET_PL1_LO(base, value) (CAN_WR_PL1_LO(base, CAN_RD_PL1_LO(base) |  (value)))
#define CAN_CLR_PL1_LO(base, value) (CAN_WR_PL1_LO(base, CAN_RD_PL1_LO(base) & ~(value)))
#define CAN_TOG_PL1_LO(base, value) (CAN_WR_PL1_LO(base, CAN_RD_PL1_LO(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_PL1_LO bitfields
 */

/*!
 * @name Register CAN_PL1_LO, field Data_byte_3[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_PL1_LO_Data_byte_3 field. */
#define CAN_RD_PL1_LO_Data_byte_3(base) ((CAN_PL1_LO_REG(base) & CAN_PL1_LO_Data_byte_3_MASK) >> CAN_PL1_LO_Data_byte_3_SHIFT)
#define CAN_BRD_PL1_LO_Data_byte_3(base) (CAN_RD_PL1_LO_Data_byte_3(base))

/*! @brief Set the Data_byte_3 field to a new value. */
#define CAN_WR_PL1_LO_Data_byte_3(base, value) (CAN_RMW_PL1_LO(base, CAN_PL1_LO_Data_byte_3_MASK, CAN_PL1_LO_Data_byte_3(value)))
#define CAN_BWR_PL1_LO_Data_byte_3(base, value) (CAN_WR_PL1_LO_Data_byte_3(base, value))
/*@}*/

/*!
 * @name Register CAN_PL1_LO, field Data_byte_2[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_PL1_LO_Data_byte_2 field. */
#define CAN_RD_PL1_LO_Data_byte_2(base) ((CAN_PL1_LO_REG(base) & CAN_PL1_LO_Data_byte_2_MASK) >> CAN_PL1_LO_Data_byte_2_SHIFT)
#define CAN_BRD_PL1_LO_Data_byte_2(base) (CAN_RD_PL1_LO_Data_byte_2(base))

/*! @brief Set the Data_byte_2 field to a new value. */
#define CAN_WR_PL1_LO_Data_byte_2(base, value) (CAN_RMW_PL1_LO(base, CAN_PL1_LO_Data_byte_2_MASK, CAN_PL1_LO_Data_byte_2(value)))
#define CAN_BWR_PL1_LO_Data_byte_2(base, value) (CAN_WR_PL1_LO_Data_byte_2(base, value))
/*@}*/

/*!
 * @name Register CAN_PL1_LO, field Data_byte_1[23:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_PL1_LO_Data_byte_1 field. */
#define CAN_RD_PL1_LO_Data_byte_1(base) ((CAN_PL1_LO_REG(base) & CAN_PL1_LO_Data_byte_1_MASK) >> CAN_PL1_LO_Data_byte_1_SHIFT)
#define CAN_BRD_PL1_LO_Data_byte_1(base) (CAN_RD_PL1_LO_Data_byte_1(base))

/*! @brief Set the Data_byte_1 field to a new value. */
#define CAN_WR_PL1_LO_Data_byte_1(base, value) (CAN_RMW_PL1_LO(base, CAN_PL1_LO_Data_byte_1_MASK, CAN_PL1_LO_Data_byte_1(value)))
#define CAN_BWR_PL1_LO_Data_byte_1(base, value) (CAN_WR_PL1_LO_Data_byte_1(base, value))
/*@}*/

/*!
 * @name Register CAN_PL1_LO, field Data_byte_0[31:24] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_PL1_LO_Data_byte_0 field. */
#define CAN_RD_PL1_LO_Data_byte_0(base) ((CAN_PL1_LO_REG(base) & CAN_PL1_LO_Data_byte_0_MASK) >> CAN_PL1_LO_Data_byte_0_SHIFT)
#define CAN_BRD_PL1_LO_Data_byte_0(base) (CAN_RD_PL1_LO_Data_byte_0(base))

/*! @brief Set the Data_byte_0 field to a new value. */
#define CAN_WR_PL1_LO_Data_byte_0(base, value) (CAN_RMW_PL1_LO(base, CAN_PL1_LO_Data_byte_0_MASK, CAN_PL1_LO_Data_byte_0(value)))
#define CAN_BWR_PL1_LO_Data_byte_0(base, value) (CAN_WR_PL1_LO_Data_byte_0(base, value))
/*@}*/

/*******************************************************************************
 * CAN_PL1_HI - Pretended Networking Payload High Filter 1 Register
 ******************************************************************************/

/*!
 * @brief CAN_PL1_HI - Pretended Networking Payload High Filter 1 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains Payload Filter 1 high order bits of the target value
 * used to filter incoming message payload. It is used either for "equal to",
 * "smaller than or equal to", "greater than or equal to" comparisons, or as the
 * lower limit value in a payload range detection. It can be written in Freeze mode
 * only.
 */
/*!
 * @name Constants and macros for entire CAN_PL1_HI register
 */
/*@{*/
#define CAN_RD_PL1_HI(base)      (CAN_PL1_HI_REG(base))
#define CAN_WR_PL1_HI(base, value) (CAN_PL1_HI_REG(base) = (value))
#define CAN_RMW_PL1_HI(base, mask, value) (CAN_WR_PL1_HI(base, (CAN_RD_PL1_HI(base) & ~(mask)) | (value)))
#define CAN_SET_PL1_HI(base, value) (CAN_WR_PL1_HI(base, CAN_RD_PL1_HI(base) |  (value)))
#define CAN_CLR_PL1_HI(base, value) (CAN_WR_PL1_HI(base, CAN_RD_PL1_HI(base) & ~(value)))
#define CAN_TOG_PL1_HI(base, value) (CAN_WR_PL1_HI(base, CAN_RD_PL1_HI(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_PL1_HI bitfields
 */

/*!
 * @name Register CAN_PL1_HI, field Data_byte_7[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_PL1_HI_Data_byte_7 field. */
#define CAN_RD_PL1_HI_Data_byte_7(base) ((CAN_PL1_HI_REG(base) & CAN_PL1_HI_Data_byte_7_MASK) >> CAN_PL1_HI_Data_byte_7_SHIFT)
#define CAN_BRD_PL1_HI_Data_byte_7(base) (CAN_RD_PL1_HI_Data_byte_7(base))

/*! @brief Set the Data_byte_7 field to a new value. */
#define CAN_WR_PL1_HI_Data_byte_7(base, value) (CAN_RMW_PL1_HI(base, CAN_PL1_HI_Data_byte_7_MASK, CAN_PL1_HI_Data_byte_7(value)))
#define CAN_BWR_PL1_HI_Data_byte_7(base, value) (CAN_WR_PL1_HI_Data_byte_7(base, value))
/*@}*/

/*!
 * @name Register CAN_PL1_HI, field Data_byte_6[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_PL1_HI_Data_byte_6 field. */
#define CAN_RD_PL1_HI_Data_byte_6(base) ((CAN_PL1_HI_REG(base) & CAN_PL1_HI_Data_byte_6_MASK) >> CAN_PL1_HI_Data_byte_6_SHIFT)
#define CAN_BRD_PL1_HI_Data_byte_6(base) (CAN_RD_PL1_HI_Data_byte_6(base))

/*! @brief Set the Data_byte_6 field to a new value. */
#define CAN_WR_PL1_HI_Data_byte_6(base, value) (CAN_RMW_PL1_HI(base, CAN_PL1_HI_Data_byte_6_MASK, CAN_PL1_HI_Data_byte_6(value)))
#define CAN_BWR_PL1_HI_Data_byte_6(base, value) (CAN_WR_PL1_HI_Data_byte_6(base, value))
/*@}*/

/*!
 * @name Register CAN_PL1_HI, field Data_byte_5[23:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_PL1_HI_Data_byte_5 field. */
#define CAN_RD_PL1_HI_Data_byte_5(base) ((CAN_PL1_HI_REG(base) & CAN_PL1_HI_Data_byte_5_MASK) >> CAN_PL1_HI_Data_byte_5_SHIFT)
#define CAN_BRD_PL1_HI_Data_byte_5(base) (CAN_RD_PL1_HI_Data_byte_5(base))

/*! @brief Set the Data_byte_5 field to a new value. */
#define CAN_WR_PL1_HI_Data_byte_5(base, value) (CAN_RMW_PL1_HI(base, CAN_PL1_HI_Data_byte_5_MASK, CAN_PL1_HI_Data_byte_5(value)))
#define CAN_BWR_PL1_HI_Data_byte_5(base, value) (CAN_WR_PL1_HI_Data_byte_5(base, value))
/*@}*/

/*!
 * @name Register CAN_PL1_HI, field Data_byte_4[31:24] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_PL1_HI_Data_byte_4 field. */
#define CAN_RD_PL1_HI_Data_byte_4(base) ((CAN_PL1_HI_REG(base) & CAN_PL1_HI_Data_byte_4_MASK) >> CAN_PL1_HI_Data_byte_4_SHIFT)
#define CAN_BRD_PL1_HI_Data_byte_4(base) (CAN_RD_PL1_HI_Data_byte_4(base))

/*! @brief Set the Data_byte_4 field to a new value. */
#define CAN_WR_PL1_HI_Data_byte_4(base, value) (CAN_RMW_PL1_HI(base, CAN_PL1_HI_Data_byte_4_MASK, CAN_PL1_HI_Data_byte_4(value)))
#define CAN_BWR_PL1_HI_Data_byte_4(base, value) (CAN_WR_PL1_HI_Data_byte_4(base, value))
/*@}*/

