nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * CAN_FLT_ID2_IDMASK - Pretended Networking ID Filter 2 Register / ID Mask Register
 ******************************************************************************/

/*!
 * @brief CAN_FLT_ID2_IDMASK - Pretended Networking ID Filter 2 Register / ID Mask Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains FLT_ID2 target value used only as the upper limit
 * value in ID range detection. Also, when exact ID filtering criteria is selected,
 * this register is used to store the ID mask. IDE_MSK and RTR_MSK bits are used
 * in both ID filtering (exact and range) to enable FLT_IDE and FLT_RTR
 * respectively to be used as part of ID reception filter. This register can be written in
 * Freeze mode only.
 */
/*!
 * @name Constants and macros for entire CAN_FLT_ID2_IDMASK register
 */
/*@{*/
#define CAN_RD_FLT_ID2_IDMASK(base) (CAN_FLT_ID2_IDMASK_REG(base))
#define CAN_WR_FLT_ID2_IDMASK(base, value) (CAN_FLT_ID2_IDMASK_REG(base) = (value))
#define CAN_RMW_FLT_ID2_IDMASK(base, mask, value) (CAN_WR_FLT_ID2_IDMASK(base, (CAN_RD_FLT_ID2_IDMASK(base) & ~(mask)) | (value)))
#define CAN_SET_FLT_ID2_IDMASK(base, value) (CAN_WR_FLT_ID2_IDMASK(base, CAN_RD_FLT_ID2_IDMASK(base) |  (value)))
#define CAN_CLR_FLT_ID2_IDMASK(base, value) (CAN_WR_FLT_ID2_IDMASK(base, CAN_RD_FLT_ID2_IDMASK(base) & ~(value)))
#define CAN_TOG_FLT_ID2_IDMASK(base, value) (CAN_WR_FLT_ID2_IDMASK(base, CAN_RD_FLT_ID2_IDMASK(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_FLT_ID2_IDMASK bitfields
 */

/*!
 * @name Register CAN_FLT_ID2_IDMASK, field FLT_ID2_IDMASK[28:0] (RW)
 *
 * This register is used to define either the ID filter value in extended frame
 * format (29 bits), considering the FLT_ID2[28:0], or the ID filter value in
 * standard frame format (11 bits), considering the FLT_ID2[28:18] (other bits in
 * the [17:0] range have no meaning). Used only in range of ID filtering. It can
 * also be used to define either the mask values for the extended frame format (29
 * bits), considering the IDMASK[28:0], or for the standard frame format (11
 * bits), considering the IDMASK[28:18] (other bits in the [17:0] range have no
 * meaning). Used only in exact ID filtering.
 */
/*@{*/
/*! @brief Read current value of the CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK field. */
#define CAN_RD_FLT_ID2_IDMASK_FLT_ID2_IDMASK(base) ((CAN_FLT_ID2_IDMASK_REG(base) & CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_MASK) >> CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_SHIFT)
#define CAN_BRD_FLT_ID2_IDMASK_FLT_ID2_IDMASK(base) (CAN_RD_FLT_ID2_IDMASK_FLT_ID2_IDMASK(base))

/*! @brief Set the FLT_ID2_IDMASK field to a new value. */
#define CAN_WR_FLT_ID2_IDMASK_FLT_ID2_IDMASK(base, value) (CAN_RMW_FLT_ID2_IDMASK(base, CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_MASK, CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK(value)))
#define CAN_BWR_FLT_ID2_IDMASK_FLT_ID2_IDMASK(base, value) (CAN_WR_FLT_ID2_IDMASK_FLT_ID2_IDMASK(base, value))
/*@}*/

/*!
 * @name Register CAN_FLT_ID2_IDMASK, field RTR_MSK[29] (RW)
 *
 * This bit indicates whether the frame type (data / remote) is part of the ID
 * reception filter.
 *
 * Values:
 * - 0b0 - The corresponding bit in the filter is "don't care"
 * - 0b1 - The corresponding bit in the filter is checked
 */
/*@{*/
/*! @brief Read current value of the CAN_FLT_ID2_IDMASK_RTR_MSK field. */
#define CAN_RD_FLT_ID2_IDMASK_RTR_MSK(base) ((CAN_FLT_ID2_IDMASK_REG(base) & CAN_FLT_ID2_IDMASK_RTR_MSK_MASK) >> CAN_FLT_ID2_IDMASK_RTR_MSK_SHIFT)
#define CAN_BRD_FLT_ID2_IDMASK_RTR_MSK(base) (BITBAND_ACCESS32(&CAN_FLT_ID2_IDMASK_REG(base), CAN_FLT_ID2_IDMASK_RTR_MSK_SHIFT))

/*! @brief Set the RTR_MSK field to a new value. */
#define CAN_WR_FLT_ID2_IDMASK_RTR_MSK(base, value) (CAN_RMW_FLT_ID2_IDMASK(base, CAN_FLT_ID2_IDMASK_RTR_MSK_MASK, CAN_FLT_ID2_IDMASK_RTR_MSK(value)))
#define CAN_BWR_FLT_ID2_IDMASK_RTR_MSK(base, value) (BITBAND_ACCESS32(&CAN_FLT_ID2_IDMASK_REG(base), CAN_FLT_ID2_IDMASK_RTR_MSK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_FLT_ID2_IDMASK, field IDE_MSK[30] (RW)
 *
 * This bit indicates whether the frame format (standard / extended) is used as
 * part of the ID reception filter.
 *
 * Values:
 * - 0b0 - The corresponding bit in the filter is "don't care"
 * - 0b1 - The corresponding bit in the filter is checked
 */
/*@{*/
/*! @brief Read current value of the CAN_FLT_ID2_IDMASK_IDE_MSK field. */
#define CAN_RD_FLT_ID2_IDMASK_IDE_MSK(base) ((CAN_FLT_ID2_IDMASK_REG(base) & CAN_FLT_ID2_IDMASK_IDE_MSK_MASK) >> CAN_FLT_ID2_IDMASK_IDE_MSK_SHIFT)
#define CAN_BRD_FLT_ID2_IDMASK_IDE_MSK(base) (BITBAND_ACCESS32(&CAN_FLT_ID2_IDMASK_REG(base), CAN_FLT_ID2_IDMASK_IDE_MSK_SHIFT))

/*! @brief Set the IDE_MSK field to a new value. */
#define CAN_WR_FLT_ID2_IDMASK_IDE_MSK(base, value) (CAN_RMW_FLT_ID2_IDMASK(base, CAN_FLT_ID2_IDMASK_IDE_MSK_MASK, CAN_FLT_ID2_IDMASK_IDE_MSK(value)))
#define CAN_BWR_FLT_ID2_IDMASK_IDE_MSK(base, value) (BITBAND_ACCESS32(&CAN_FLT_ID2_IDMASK_REG(base), CAN_FLT_ID2_IDMASK_IDE_MSK_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * CAN_PL2_PLMASK_LO - Pretended Networking Payload Low Filter 2 Register / Payload Low Mask Register
 ******************************************************************************/

/*!
 * @brief CAN_PL2_PLMASK_LO - Pretended Networking Payload Low Filter 2 Register / Payload Low Mask Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register has two functions. First, it contains the low order bits for
 * the Payload Filter 2 used only as the upper limit value in a payload range
 * detection. Second, when exact payload filtering criteria is selected, this register
 * is used as payload mask. Otherwise, this register is unused. It can be
 * written in Freeze mode only.
 */
/*!
 * @name Constants and macros for entire CAN_PL2_PLMASK_LO register
 */
/*@{*/
#define CAN_RD_PL2_PLMASK_LO(base) (CAN_PL2_PLMASK_LO_REG(base))
#define CAN_WR_PL2_PLMASK_LO(base, value) (CAN_PL2_PLMASK_LO_REG(base) = (value))
#define CAN_RMW_PL2_PLMASK_LO(base, mask, value) (CAN_WR_PL2_PLMASK_LO(base, (CAN_RD_PL2_PLMASK_LO(base) & ~(mask)) | (value)))
#define CAN_SET_PL2_PLMASK_LO(base, value) (CAN_WR_PL2_PLMASK_LO(base, CAN_RD_PL2_PLMASK_LO(base) |  (value)))
#define CAN_CLR_PL2_PLMASK_LO(base, value) (CAN_WR_PL2_PLMASK_LO(base, CAN_RD_PL2_PLMASK_LO(base) & ~(value)))
#define CAN_TOG_PL2_PLMASK_LO(base, value) (CAN_WR_PL2_PLMASK_LO(base, CAN_RD_PL2_PLMASK_LO(base) ^  (value)))
/*@}*/

