nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual CAN_WMB1_ID bitfields
 */

/*!
 * @name Register CAN_WMB1_ID, field ID[28:0] (RO)
 *
 * This register stores either the 29 bits of the extended frame format
 * (considering the ID[28:0] field), or the 11 bits of the standard frame format
 * (considering the ID[28:18] field only, the remaining bits in the ID[17:0] range have
 * no meaning).
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB1_ID_ID field. */
#define CAN_RD_WMB1_ID_ID(base) ((CAN_WMB1_ID_REG(base) & CAN_WMB1_ID_ID_MASK) >> CAN_WMB1_ID_ID_SHIFT)
#define CAN_BRD_WMB1_ID_ID(base) (CAN_RD_WMB1_ID_ID(base))
/*@}*/

/*******************************************************************************
 * CAN_WMB1_D03 - Wake Up Message Buffer Register for Data 0-3
 ******************************************************************************/

/*!
 * @brief CAN_WMB1_D03 - Wake Up Message Buffer Register for Data 0-3 (RO)
 *
 * Reset value: 0x00000000U
 *
 * Each of the four WMBs contains a register to store the data bytes 0 to 3 of
 * the payload information of an incoming Rx message. This resgister's content is
 * cleared when the incoming matched message is either a remote frame (RTR=1) or
 * a data frame with DLC=0. The Data 0-3 registers are located at 0xB48 for WMB0,
 * 0xB58 for WMB1, 0xB68 for WMB2, and 0xB78 for WMB3.
 */
/*!
 * @name Constants and macros for entire CAN_WMB1_D03 register
 */
/*@{*/
#define CAN_RD_WMB1_D03(base)    (CAN_WMB1_D03_REG(base))
/*@}*/

/*
 * Constants & macros for individual CAN_WMB1_D03 bitfields
 */

/*!
 * @name Register CAN_WMB1_D03, field Data_byte_3[7:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB1_D03_Data_byte_3 field. */
#define CAN_RD_WMB1_D03_Data_byte_3(base) ((CAN_WMB1_D03_REG(base) & CAN_WMB1_D03_Data_byte_3_MASK) >> CAN_WMB1_D03_Data_byte_3_SHIFT)
#define CAN_BRD_WMB1_D03_Data_byte_3(base) (CAN_RD_WMB1_D03_Data_byte_3(base))
/*@}*/

/*!
 * @name Register CAN_WMB1_D03, field Data_byte_2[15:8] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB1_D03_Data_byte_2 field. */
#define CAN_RD_WMB1_D03_Data_byte_2(base) ((CAN_WMB1_D03_REG(base) & CAN_WMB1_D03_Data_byte_2_MASK) >> CAN_WMB1_D03_Data_byte_2_SHIFT)
#define CAN_BRD_WMB1_D03_Data_byte_2(base) (CAN_RD_WMB1_D03_Data_byte_2(base))
/*@}*/

/*!
 * @name Register CAN_WMB1_D03, field Data_byte_1[23:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB1_D03_Data_byte_1 field. */
#define CAN_RD_WMB1_D03_Data_byte_1(base) ((CAN_WMB1_D03_REG(base) & CAN_WMB1_D03_Data_byte_1_MASK) >> CAN_WMB1_D03_Data_byte_1_SHIFT)
#define CAN_BRD_WMB1_D03_Data_byte_1(base) (CAN_RD_WMB1_D03_Data_byte_1(base))
/*@}*/

/*!
 * @name Register CAN_WMB1_D03, field Data_byte_0[31:24] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB1_D03_Data_byte_0 field. */
#define CAN_RD_WMB1_D03_Data_byte_0(base) ((CAN_WMB1_D03_REG(base) & CAN_WMB1_D03_Data_byte_0_MASK) >> CAN_WMB1_D03_Data_byte_0_SHIFT)
#define CAN_BRD_WMB1_D03_Data_byte_0(base) (CAN_RD_WMB1_D03_Data_byte_0(base))
/*@}*/

/*******************************************************************************
 * CAN_WMB1_D47 - Wake Up Message Buffer Register Data 4-7
 ******************************************************************************/

/*!
 * @brief CAN_WMB1_D47 - Wake Up Message Buffer Register Data 4-7 (RO)
 *
 * Reset value: 0x00000000U
 *
 * Each of the four WMBs contains a register to store the data bytes 4 to 7 of
 * the payload information of an incoming Rx message. This resgister's content is
 * cleared when the incoming matched message is either a remote frame (RTR=1) or
 * a data frame with DLC=0. The Data 4-7 registers are located at 0xB4C for WMB0,
 * 0xB5C for WMB1, 0xB6C for WMB2, and 0xB7C for WMB3.
 */
/*!
 * @name Constants and macros for entire CAN_WMB1_D47 register
 */
/*@{*/
#define CAN_RD_WMB1_D47(base)    (CAN_WMB1_D47_REG(base))
/*@}*/

/*
 * Constants & macros for individual CAN_WMB1_D47 bitfields
 */

/*!
 * @name Register CAN_WMB1_D47, field Data_byte_7[7:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB1_D47_Data_byte_7 field. */
#define CAN_RD_WMB1_D47_Data_byte_7(base) ((CAN_WMB1_D47_REG(base) & CAN_WMB1_D47_Data_byte_7_MASK) >> CAN_WMB1_D47_Data_byte_7_SHIFT)
#define CAN_BRD_WMB1_D47_Data_byte_7(base) (CAN_RD_WMB1_D47_Data_byte_7(base))
/*@}*/

/*!
 * @name Register CAN_WMB1_D47, field Data_byte_6[15:8] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB1_D47_Data_byte_6 field. */
#define CAN_RD_WMB1_D47_Data_byte_6(base) ((CAN_WMB1_D47_REG(base) & CAN_WMB1_D47_Data_byte_6_MASK) >> CAN_WMB1_D47_Data_byte_6_SHIFT)
#define CAN_BRD_WMB1_D47_Data_byte_6(base) (CAN_RD_WMB1_D47_Data_byte_6(base))
/*@}*/

/*!
 * @name Register CAN_WMB1_D47, field Data_byte_5[23:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB1_D47_Data_byte_5 field. */
#define CAN_RD_WMB1_D47_Data_byte_5(base) ((CAN_WMB1_D47_REG(base) & CAN_WMB1_D47_Data_byte_5_MASK) >> CAN_WMB1_D47_Data_byte_5_SHIFT)
#define CAN_BRD_WMB1_D47_Data_byte_5(base) (CAN_RD_WMB1_D47_Data_byte_5(base))
/*@}*/

/*!
 * @name Register CAN_WMB1_D47, field Data_byte_4[31:24] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB1_D47_Data_byte_4 field. */
#define CAN_RD_WMB1_D47_Data_byte_4(base) ((CAN_WMB1_D47_REG(base) & CAN_WMB1_D47_Data_byte_4_MASK) >> CAN_WMB1_D47_Data_byte_4_SHIFT)
#define CAN_BRD_WMB1_D47_Data_byte_4(base) (CAN_RD_WMB1_D47_Data_byte_4(base))
/*@}*/

/*******************************************************************************
 * CAN_WMB2_CS - Wake Up Message Buffer Register for C/S
 ******************************************************************************/

/*!
 * @brief CAN_WMB2_CS - Wake Up Message Buffer Register for C/S (RO)
 *
 * Reset value: 0x00000000U
 *
 * Each of the four WMBs contains a register to store the Control Status (C/S)
 * information (IDE, RTR and DLC fields) of an incoming Rx message. The C/S
 * registers are located at 0xB40 for WMB0, 0xB50 for WMB1, 0xB60 for WMB2, and 0xB70
 * for WMB3.
 */
/*!
 * @name Constants and macros for entire CAN_WMB2_CS register
 */
/*@{*/
#define CAN_RD_WMB2_CS(base)     (CAN_WMB2_CS_REG(base))
/*@}*/

