nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual CAN_WMB2_D47 bitfields
 */

/*!
 * @name Register CAN_WMB2_D47, field Data_byte_7[7:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB2_D47_Data_byte_7 field. */
#define CAN_RD_WMB2_D47_Data_byte_7(base) ((CAN_WMB2_D47_REG(base) & CAN_WMB2_D47_Data_byte_7_MASK) >> CAN_WMB2_D47_Data_byte_7_SHIFT)
#define CAN_BRD_WMB2_D47_Data_byte_7(base) (CAN_RD_WMB2_D47_Data_byte_7(base))
/*@}*/

/*!
 * @name Register CAN_WMB2_D47, field Data_byte_6[15:8] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB2_D47_Data_byte_6 field. */
#define CAN_RD_WMB2_D47_Data_byte_6(base) ((CAN_WMB2_D47_REG(base) & CAN_WMB2_D47_Data_byte_6_MASK) >> CAN_WMB2_D47_Data_byte_6_SHIFT)
#define CAN_BRD_WMB2_D47_Data_byte_6(base) (CAN_RD_WMB2_D47_Data_byte_6(base))
/*@}*/

/*!
 * @name Register CAN_WMB2_D47, field Data_byte_5[23:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB2_D47_Data_byte_5 field. */
#define CAN_RD_WMB2_D47_Data_byte_5(base) ((CAN_WMB2_D47_REG(base) & CAN_WMB2_D47_Data_byte_5_MASK) >> CAN_WMB2_D47_Data_byte_5_SHIFT)
#define CAN_BRD_WMB2_D47_Data_byte_5(base) (CAN_RD_WMB2_D47_Data_byte_5(base))
/*@}*/

/*!
 * @name Register CAN_WMB2_D47, field Data_byte_4[31:24] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB2_D47_Data_byte_4 field. */
#define CAN_RD_WMB2_D47_Data_byte_4(base) ((CAN_WMB2_D47_REG(base) & CAN_WMB2_D47_Data_byte_4_MASK) >> CAN_WMB2_D47_Data_byte_4_SHIFT)
#define CAN_BRD_WMB2_D47_Data_byte_4(base) (CAN_RD_WMB2_D47_Data_byte_4(base))
/*@}*/

/*******************************************************************************
 * CAN_WMB3_CS - Wake Up Message Buffer Register for C/S
 ******************************************************************************/

/*!
 * @brief CAN_WMB3_CS - Wake Up Message Buffer Register for C/S (RO)
 *
 * Reset value: 0x00000000U
 *
 * Each of the four WMBs contains a register to store the Control Status (C/S)
 * information (IDE, RTR and DLC fields) of an incoming Rx message. The C/S
 * registers are located at 0xB40 for WMB0, 0xB50 for WMB1, 0xB60 for WMB2, and 0xB70
 * for WMB3.
 */
/*!
 * @name Constants and macros for entire CAN_WMB3_CS register
 */
/*@{*/
#define CAN_RD_WMB3_CS(base)     (CAN_WMB3_CS_REG(base))
/*@}*/

/*
 * Constants & macros for individual CAN_WMB3_CS bitfields
 */

/*!
 * @name Register CAN_WMB3_CS, field DLC[19:16] (RO)
 *
 * This 4-bit field is the length (in bytes) of the Rx data received when
 * FlexCAN is in Pretended Networking mode. This 4-bit field is written by the FlexCAN
 * module, copied from the DLC (Data Length Code) field of the received frame.
 * The DLC field indicates which data bytes are valid.
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_CS_DLC field. */
#define CAN_RD_WMB3_CS_DLC(base) ((CAN_WMB3_CS_REG(base) & CAN_WMB3_CS_DLC_MASK) >> CAN_WMB3_CS_DLC_SHIFT)
#define CAN_BRD_WMB3_CS_DLC(base) (CAN_RD_WMB3_CS_DLC(base))
/*@}*/

/*!
 * @name Register CAN_WMB3_CS, field RTR[20] (RO)
 *
 * This bit identifies whether the frame is remote or not.
 *
 * Values:
 * - 0b0 - Frame is data one (not remote)
 * - 0b1 - Frame is a remote one
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_CS_RTR field. */
#define CAN_RD_WMB3_CS_RTR(base) ((CAN_WMB3_CS_REG(base) & CAN_WMB3_CS_RTR_MASK) >> CAN_WMB3_CS_RTR_SHIFT)
#define CAN_BRD_WMB3_CS_RTR(base) (BITBAND_ACCESS32(&CAN_WMB3_CS_REG(base), CAN_WMB3_CS_RTR_SHIFT))
/*@}*/

/*!
 * @name Register CAN_WMB3_CS, field IDE[21] (RO)
 *
 * This bit identifies whether the frame format is standard or extended
 *
 * Values:
 * - 0b0 - Frame format is standard
 * - 0b1 - Frame format is extended
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_CS_IDE field. */
#define CAN_RD_WMB3_CS_IDE(base) ((CAN_WMB3_CS_REG(base) & CAN_WMB3_CS_IDE_MASK) >> CAN_WMB3_CS_IDE_SHIFT)
#define CAN_BRD_WMB3_CS_IDE(base) (BITBAND_ACCESS32(&CAN_WMB3_CS_REG(base), CAN_WMB3_CS_IDE_SHIFT))
/*@}*/

/*!
 * @name Register CAN_WMB3_CS, field SRR[22] (RO)
 *
 * This bit can be received either recessive or dominant.
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_CS_SRR field. */
#define CAN_RD_WMB3_CS_SRR(base) ((CAN_WMB3_CS_REG(base) & CAN_WMB3_CS_SRR_MASK) >> CAN_WMB3_CS_SRR_SHIFT)
#define CAN_BRD_WMB3_CS_SRR(base) (BITBAND_ACCESS32(&CAN_WMB3_CS_REG(base), CAN_WMB3_CS_SRR_SHIFT))
/*@}*/

/*******************************************************************************
 * CAN_WMB3_ID - Wake Up Message Buffer Register for ID
 ******************************************************************************/

/*!
 * @brief CAN_WMB3_ID - Wake Up Message Buffer Register for ID (RO)
 *
 * Reset value: 0x00000000U
 *
 * Each of the four WMBs contains a register to store the ID information of an
 * incoming Rx message. The ID registers are located at 0xB44 for WMB0, 0xB54 for
 * WMB1, 0xB64 for WMB2, and 0xB74 for WMB3.
 */
/*!
 * @name Constants and macros for entire CAN_WMB3_ID register
 */
/*@{*/
#define CAN_RD_WMB3_ID(base)     (CAN_WMB3_ID_REG(base))
/*@}*/

/*
 * Constants & macros for individual CAN_WMB3_ID bitfields
 */

/*!
 * @name Register CAN_WMB3_ID, field ID[28:0] (RO)
 *
 * This register stores either the 29 bits of the extended frame format
 * (considering the ID[28:0] field), or the 11 bits of the standard frame format
 * (considering the ID[28:18] field only, the remaining bits in the ID[17:0] range have
 * no meaning).
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_ID_ID field. */
#define CAN_RD_WMB3_ID_ID(base) ((CAN_WMB3_ID_REG(base) & CAN_WMB3_ID_ID_MASK) >> CAN_WMB3_ID_ID_SHIFT)
#define CAN_BRD_WMB3_ID_ID(base) (CAN_RD_WMB3_ID_ID(base))
/*@}*/

/*******************************************************************************
 * CAN_WMB3_D03 - Wake Up Message Buffer Register for Data 0-3
 ******************************************************************************/

/*!
 * @brief CAN_WMB3_D03 - Wake Up Message Buffer Register for Data 0-3 (RO)
 *
 * Reset value: 0x00000000U
 *
 * Each of the four WMBs contains a register to store the data bytes 0 to 3 of
 * the payload information of an incoming Rx message. This resgister's content is
 * cleared when the incoming matched message is either a remote frame (RTR=1) or
 * a data frame with DLC=0. The Data 0-3 registers are located at 0xB48 for WMB0,
 * 0xB58 for WMB1, 0xB68 for WMB2, and 0xB78 for WMB3.
 */
/*!
 * @name Constants and macros for entire CAN_WMB3_D03 register
 */
/*@{*/
#define CAN_RD_WMB3_D03(base)    (CAN_WMB3_D03_REG(base))
/*@}*/

