nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual CAN_WMB3_D03 bitfields
 */

/*!
 * @name Register CAN_WMB3_D03, field Data_byte_3[7:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_D03_Data_byte_3 field. */
#define CAN_RD_WMB3_D03_Data_byte_3(base) ((CAN_WMB3_D03_REG(base) & CAN_WMB3_D03_Data_byte_3_MASK) >> CAN_WMB3_D03_Data_byte_3_SHIFT)
#define CAN_BRD_WMB3_D03_Data_byte_3(base) (CAN_RD_WMB3_D03_Data_byte_3(base))
/*@}*/

/*!
 * @name Register CAN_WMB3_D03, field Data_byte_2[15:8] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_D03_Data_byte_2 field. */
#define CAN_RD_WMB3_D03_Data_byte_2(base) ((CAN_WMB3_D03_REG(base) & CAN_WMB3_D03_Data_byte_2_MASK) >> CAN_WMB3_D03_Data_byte_2_SHIFT)
#define CAN_BRD_WMB3_D03_Data_byte_2(base) (CAN_RD_WMB3_D03_Data_byte_2(base))
/*@}*/

/*!
 * @name Register CAN_WMB3_D03, field Data_byte_1[23:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_D03_Data_byte_1 field. */
#define CAN_RD_WMB3_D03_Data_byte_1(base) ((CAN_WMB3_D03_REG(base) & CAN_WMB3_D03_Data_byte_1_MASK) >> CAN_WMB3_D03_Data_byte_1_SHIFT)
#define CAN_BRD_WMB3_D03_Data_byte_1(base) (CAN_RD_WMB3_D03_Data_byte_1(base))
/*@}*/

/*!
 * @name Register CAN_WMB3_D03, field Data_byte_0[31:24] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_D03_Data_byte_0 field. */
#define CAN_RD_WMB3_D03_Data_byte_0(base) ((CAN_WMB3_D03_REG(base) & CAN_WMB3_D03_Data_byte_0_MASK) >> CAN_WMB3_D03_Data_byte_0_SHIFT)
#define CAN_BRD_WMB3_D03_Data_byte_0(base) (CAN_RD_WMB3_D03_Data_byte_0(base))
/*@}*/

/*******************************************************************************
 * CAN_WMB3_D47 - Wake Up Message Buffer Register Data 4-7
 ******************************************************************************/

/*!
 * @brief CAN_WMB3_D47 - Wake Up Message Buffer Register Data 4-7 (RO)
 *
 * Reset value: 0x00000000U
 *
 * Each of the four WMBs contains a register to store the data bytes 4 to 7 of
 * the payload information of an incoming Rx message. This resgister's content is
 * cleared when the incoming matched message is either a remote frame (RTR=1) or
 * a data frame with DLC=0. The Data 4-7 registers are located at 0xB4C for WMB0,
 * 0xB5C for WMB1, 0xB6C for WMB2, and 0xB7C for WMB3.
 */
/*!
 * @name Constants and macros for entire CAN_WMB3_D47 register
 */
/*@{*/
#define CAN_RD_WMB3_D47(base)    (CAN_WMB3_D47_REG(base))
/*@}*/

/*
 * Constants & macros for individual CAN_WMB3_D47 bitfields
 */

/*!
 * @name Register CAN_WMB3_D47, field Data_byte_7[7:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_D47_Data_byte_7 field. */
#define CAN_RD_WMB3_D47_Data_byte_7(base) ((CAN_WMB3_D47_REG(base) & CAN_WMB3_D47_Data_byte_7_MASK) >> CAN_WMB3_D47_Data_byte_7_SHIFT)
#define CAN_BRD_WMB3_D47_Data_byte_7(base) (CAN_RD_WMB3_D47_Data_byte_7(base))
/*@}*/

/*!
 * @name Register CAN_WMB3_D47, field Data_byte_6[15:8] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_D47_Data_byte_6 field. */
#define CAN_RD_WMB3_D47_Data_byte_6(base) ((CAN_WMB3_D47_REG(base) & CAN_WMB3_D47_Data_byte_6_MASK) >> CAN_WMB3_D47_Data_byte_6_SHIFT)
#define CAN_BRD_WMB3_D47_Data_byte_6(base) (CAN_RD_WMB3_D47_Data_byte_6(base))
/*@}*/

/*!
 * @name Register CAN_WMB3_D47, field Data_byte_5[23:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_D47_Data_byte_5 field. */
#define CAN_RD_WMB3_D47_Data_byte_5(base) ((CAN_WMB3_D47_REG(base) & CAN_WMB3_D47_Data_byte_5_MASK) >> CAN_WMB3_D47_Data_byte_5_SHIFT)
#define CAN_BRD_WMB3_D47_Data_byte_5(base) (CAN_RD_WMB3_D47_Data_byte_5(base))
/*@}*/

/*!
 * @name Register CAN_WMB3_D47, field Data_byte_4[31:24] (RO)
 */
/*@{*/
/*! @brief Read current value of the CAN_WMB3_D47_Data_byte_4 field. */
#define CAN_RD_WMB3_D47_Data_byte_4(base) ((CAN_WMB3_D47_REG(base) & CAN_WMB3_D47_Data_byte_4_MASK) >> CAN_WMB3_D47_Data_byte_4_SHIFT)
#define CAN_BRD_WMB3_D47_Data_byte_4(base) (CAN_RD_WMB3_D47_Data_byte_4(base))
/*@}*/

/*******************************************************************************
 * CAN_FDCTRL - CAN FD Control Register
 ******************************************************************************/

/*!
 * @brief CAN_FDCTRL - CAN FD Control Register (RW)
 *
 * Reset value: 0x80000100U
 *
 * This register contains control bits for the CAN FD operation. It also defines
 * the data size of Message Buffers allocated in different partitions of RAM
 * (memory blocks) as described in the table below. When 8 bytes payload is
 * selected: Block R0 allocates MB0 to MB31. Block R1 allocates MB32 to MB63. When more
 * then 8 bytes payload is selected, the maximum number of MBs in a block is
 * limited as described below: Number of Message Buffers Payload Size Maximum number
 * of Message Buffers per RAM block 8 bytes 32 16 bytes 21 32 bytes 12 64 bytes 7
 * One memory block fits exactly 32 MBs with 8 bytes payload. For the other
 * options of payload sizes, empty memory may exist between last MB in a block and the
 * beginning of the next block. This empty memory corresponds to less than one
 * MB, and must not be used. The contents of this register are not affected by
 * soft reset.
 */
/*!
 * @name Constants and macros for entire CAN_FDCTRL register
 */
/*@{*/
#define CAN_RD_FDCTRL(base)      (CAN_FDCTRL_REG(base))
#define CAN_WR_FDCTRL(base, value) (CAN_FDCTRL_REG(base) = (value))
#define CAN_RMW_FDCTRL(base, mask, value) (CAN_WR_FDCTRL(base, (CAN_RD_FDCTRL(base) & ~(mask)) | (value)))
#define CAN_SET_FDCTRL(base, value) (CAN_WR_FDCTRL(base, CAN_RD_FDCTRL(base) |  (value)))
#define CAN_CLR_FDCTRL(base, value) (CAN_WR_FDCTRL(base, CAN_RD_FDCTRL(base) & ~(value)))
#define CAN_TOG_FDCTRL(base, value) (CAN_WR_FDCTRL(base, CAN_RD_FDCTRL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_FDCTRL bitfields
 */

/*!
 * @name Register CAN_FDCTRL, field TDCVAL[5:0] (RO)
 *
 * This register contains the value of the transceiver loop delay measured from
 * the transmitted EDL to R0 transition edge to the respective received one added
 * to the TDCOFF value specified in the CAN_FDCTRL register. This value is an
 * integer multiple of the Protocol Engine (PE) Clock period (CANCLK). See Protocol
 * timing for more details on how the loop delay measurement is performed.
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCTRL_TDCVAL field. */
#define CAN_RD_FDCTRL_TDCVAL(base) ((CAN_FDCTRL_REG(base) & CAN_FDCTRL_TDCVAL_MASK) >> CAN_FDCTRL_TDCVAL_SHIFT)
#define CAN_BRD_FDCTRL_TDCVAL(base) (CAN_RD_FDCTRL_TDCVAL(base))
/*@}*/

/*!
 * @name Register CAN_FDCTRL, field TDCOFF[12:8] (RW)
 *
 * This bit field contains the offset value to be added to the measured
 * transceiver's loop delay in order to define the position of the delayed comparison
 * point when bit rate switching is active. See Transceiver Delay Compensation for
 * more details on how the loop delay measurement is performed. TDCOFF can be
 * written in Freeze mode only. Its value can be defined in Protocol Engine (PE)
 * Clock periods (CANCLK, see Protocol timing for more details), and must be selected
 * to be smaller than the CAN bit duration in the data bit rate for proper
 * operation. It is not recommended to use TDCOFF equal to zero.
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCTRL_TDCOFF field. */
#define CAN_RD_FDCTRL_TDCOFF(base) ((CAN_FDCTRL_REG(base) & CAN_FDCTRL_TDCOFF_MASK) >> CAN_FDCTRL_TDCOFF_SHIFT)
#define CAN_BRD_FDCTRL_TDCOFF(base) (CAN_RD_FDCTRL_TDCOFF(base))

/*! @brief Set the TDCOFF field to a new value. */
#define CAN_WR_FDCTRL_TDCOFF(base, value) (CAN_RMW_FDCTRL(base, (CAN_FDCTRL_TDCOFF_MASK | CAN_FDCTRL_TDCFAIL_MASK), CAN_FDCTRL_TDCOFF(value)))
#define CAN_BWR_FDCTRL_TDCOFF(base, value) (CAN_WR_FDCTRL_TDCOFF(base, value))
/*@}*/

/*!
 * @name Register CAN_FDCTRL, field TDCFAIL[14] (W1C)
 *
 * This bit indicates when the Transceiver Delay Compensation (TDC) mechanism is
 * out of range, unable to compensate the transceiver's loop delay and
 * successfully compare the delayed received bits to the transmitted ones (see Transceiver
 * Delay Compensation. TDCFAIL sets in the first time FlexCAN detects the out of
 * range condition. The CPU needs to write 1 to clear it.
 *
 * Values:
 * - 0b0 - Measured loop delay is in range.
 * - 0b1 - Measured loop delay is out of range.
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCTRL_TDCFAIL field. */
#define CAN_RD_FDCTRL_TDCFAIL(base) ((CAN_FDCTRL_REG(base) & CAN_FDCTRL_TDCFAIL_MASK) >> CAN_FDCTRL_TDCFAIL_SHIFT)
#define CAN_BRD_FDCTRL_TDCFAIL(base) (BITBAND_ACCESS32(&CAN_FDCTRL_REG(base), CAN_FDCTRL_TDCFAIL_SHIFT))

