nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the TDCFAIL field to a new value. */
#define CAN_WR_FDCTRL_TDCFAIL(base, value) (CAN_RMW_FDCTRL(base, CAN_FDCTRL_TDCFAIL_MASK, CAN_FDCTRL_TDCFAIL(value)))
#define CAN_BWR_FDCTRL_TDCFAIL(base, value) (BITBAND_ACCESS32(&CAN_FDCTRL_REG(base), CAN_FDCTRL_TDCFAIL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_FDCTRL, field TDCEN[15] (RW)
 *
 * This bit can be used to enable and disable the TDC feature. It can be written
 * in Freeze mode only. TDC must be disabled when the Loop Back Mode is enabled
 * (see CAN_CTRL1[LPB] register).
 *
 * Values:
 * - 0b0 - TDC is disabled
 * - 0b1 - TDC is enabled
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCTRL_TDCEN field. */
#define CAN_RD_FDCTRL_TDCEN(base) ((CAN_FDCTRL_REG(base) & CAN_FDCTRL_TDCEN_MASK) >> CAN_FDCTRL_TDCEN_SHIFT)
#define CAN_BRD_FDCTRL_TDCEN(base) (BITBAND_ACCESS32(&CAN_FDCTRL_REG(base), CAN_FDCTRL_TDCEN_SHIFT))

/*! @brief Set the TDCEN field to a new value. */
#define CAN_WR_FDCTRL_TDCEN(base, value) (CAN_RMW_FDCTRL(base, (CAN_FDCTRL_TDCEN_MASK | CAN_FDCTRL_TDCFAIL_MASK), CAN_FDCTRL_TDCEN(value)))
#define CAN_BWR_FDCTRL_TDCEN(base, value) (BITBAND_ACCESS32(&CAN_FDCTRL_REG(base), CAN_FDCTRL_TDCEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_FDCTRL, field MBDSR0[17:16] (RW)
 *
 * This two bit field selects the data size (8, 16, 32 or 64 bytes) for the
 * region R0 of Message Buffers allocated in RAM. It can be written in Freeze Mode
 * only.
 *
 * Values:
 * - 0b00 - Selects 8 bytes per Message Buffer.
 * - 0b01 - Selects 16 bytes per Message Buffer.
 * - 0b10 - Selects 32 bytes per Message Buffer.
 * - 0b11 - Selects 64 bytes per Message Buffer.
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCTRL_MBDSR0 field. */
#define CAN_RD_FDCTRL_MBDSR0(base) ((CAN_FDCTRL_REG(base) & CAN_FDCTRL_MBDSR0_MASK) >> CAN_FDCTRL_MBDSR0_SHIFT)
#define CAN_BRD_FDCTRL_MBDSR0(base) (CAN_RD_FDCTRL_MBDSR0(base))

/*! @brief Set the MBDSR0 field to a new value. */
#define CAN_WR_FDCTRL_MBDSR0(base, value) (CAN_RMW_FDCTRL(base, (CAN_FDCTRL_MBDSR0_MASK | CAN_FDCTRL_TDCFAIL_MASK), CAN_FDCTRL_MBDSR0(value)))
#define CAN_BWR_FDCTRL_MBDSR0(base, value) (CAN_WR_FDCTRL_MBDSR0(base, value))
/*@}*/

/*!
 * @name Register CAN_FDCTRL, field MBDSR1[20:19] (RW)
 *
 * This two bit field selects the data size (8, 16, 32 or 64 bytes) for the
 * region R1 of Message Buffers allocated in RAM. It can be written in Freeze Mode
 * only.
 *
 * Values:
 * - 0b00 - Selects 8 bytes per Message Buffer.
 * - 0b01 - Selects 16 bytes per Message Buffer.
 * - 0b10 - Selects 32 bytes per Message Buffer.
 * - 0b11 - Selects 64 bytes per Message Buffer.
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCTRL_MBDSR1 field. */
#define CAN_RD_FDCTRL_MBDSR1(base) ((CAN_FDCTRL_REG(base) & CAN_FDCTRL_MBDSR1_MASK) >> CAN_FDCTRL_MBDSR1_SHIFT)
#define CAN_BRD_FDCTRL_MBDSR1(base) (CAN_RD_FDCTRL_MBDSR1(base))

/*! @brief Set the MBDSR1 field to a new value. */
#define CAN_WR_FDCTRL_MBDSR1(base, value) (CAN_RMW_FDCTRL(base, (CAN_FDCTRL_MBDSR1_MASK | CAN_FDCTRL_TDCFAIL_MASK), CAN_FDCTRL_MBDSR1(value)))
#define CAN_BWR_FDCTRL_MBDSR1(base, value) (CAN_WR_FDCTRL_MBDSR1(base, value))
/*@}*/

/*!
 * @name Register CAN_FDCTRL, field FDRATE[31] (RW)
 *
 * This bit enables the effect of the Bit Rate Switch (BRS bit) during the data
 * phase of Tx messages. The CPU can write this bit any time. However, its effect
 * turns active only when the CAN bus is in Wait for Bus Idle, Bus Idle or Bus
 * Off state, or when the current frame under reception or transmission reaches
 * the interframe space. By negating the CAN_FDCTRL[FDRATE] bit, the CPU can force
 * all bits in CAN FD messages to be transmitted in nominal bit rate, despite of
 * the value in the BRS bit of the Tx MBs.
 *
 * Values:
 * - 0b0 - Transmit a frame in nominal rate. The BRS bit in the Tx MB has no
 *     effect.
 * - 0b1 - Transmit a frame with bit rate switching if the BRS bit in the Tx MB
 *     is recessive.
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCTRL_FDRATE field. */
#define CAN_RD_FDCTRL_FDRATE(base) ((CAN_FDCTRL_REG(base) & CAN_FDCTRL_FDRATE_MASK) >> CAN_FDCTRL_FDRATE_SHIFT)
#define CAN_BRD_FDCTRL_FDRATE(base) (BITBAND_ACCESS32(&CAN_FDCTRL_REG(base), CAN_FDCTRL_FDRATE_SHIFT))

/*! @brief Set the FDRATE field to a new value. */
#define CAN_WR_FDCTRL_FDRATE(base, value) (CAN_RMW_FDCTRL(base, (CAN_FDCTRL_FDRATE_MASK | CAN_FDCTRL_TDCFAIL_MASK), CAN_FDCTRL_FDRATE(value)))
#define CAN_BWR_FDCTRL_FDRATE(base, value) (BITBAND_ACCESS32(&CAN_FDCTRL_REG(base), CAN_FDCTRL_FDRATE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * CAN_FDCBT - CAN FD Bit Timing Register
 ******************************************************************************/

/*!
 * @brief CAN_FDCBT - CAN FD Bit Timing Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register stores the CAN bit timing variables used in the data phase of
 * CAN FD messages when the CAN_FDCTRL[FDRATE] is set, compatible with CAN FD
 * specification. FPRESDIV, FPROPSEG, FPSEG1, FPSEG2 and FRJW are used to define the
 * time quantum duration, the number of time quanta per CAN bit and the sample
 * point position for the data bit rate portion of a CAN FD message with the BRS
 * bit set. The contents of this register are not affected by soft reset.
 */
/*!
 * @name Constants and macros for entire CAN_FDCBT register
 */
/*@{*/
#define CAN_RD_FDCBT(base)       (CAN_FDCBT_REG(base))
#define CAN_WR_FDCBT(base, value) (CAN_FDCBT_REG(base) = (value))
#define CAN_RMW_FDCBT(base, mask, value) (CAN_WR_FDCBT(base, (CAN_RD_FDCBT(base) & ~(mask)) | (value)))
#define CAN_SET_FDCBT(base, value) (CAN_WR_FDCBT(base, CAN_RD_FDCBT(base) |  (value)))
#define CAN_CLR_FDCBT(base, value) (CAN_WR_FDCBT(base, CAN_RD_FDCBT(base) & ~(value)))
#define CAN_TOG_FDCBT(base, value) (CAN_WR_FDCBT(base, CAN_RD_FDCBT(base) ^  (value)))
/*@}*/

