nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual CAN_FDCBT bitfields
 */

/*!
 * @name Register CAN_FDCBT, field FPSEG2[2:0] (RW)
 *
 * This 3-bit field defines the length of Phase Segment 2 in the data bit rate
 * portion of a CAN FD message with the BRS bit set. This field can be written
 * only in Freeze mode because it is blocked by hardware in other modes. Phase
 * Segment 2 = (FPSEG2 + 1) * Time-Quanta. Time-Quantum = one Sclock period.
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCBT_FPSEG2 field. */
#define CAN_RD_FDCBT_FPSEG2(base) ((CAN_FDCBT_REG(base) & CAN_FDCBT_FPSEG2_MASK) >> CAN_FDCBT_FPSEG2_SHIFT)
#define CAN_BRD_FDCBT_FPSEG2(base) (CAN_RD_FDCBT_FPSEG2(base))

/*! @brief Set the FPSEG2 field to a new value. */
#define CAN_WR_FDCBT_FPSEG2(base, value) (CAN_RMW_FDCBT(base, CAN_FDCBT_FPSEG2_MASK, CAN_FDCBT_FPSEG2(value)))
#define CAN_BWR_FDCBT_FPSEG2(base, value) (CAN_WR_FDCBT_FPSEG2(base, value))
/*@}*/

/*!
 * @name Register CAN_FDCBT, field FPSEG1[7:5] (RW)
 *
 * This 3-bit field defines the length of Phase Segment 1 in the bit time in the
 * data bit rate portion of a CAN FD message with the BRS bit set. This field
 * can be written only in Freeze mode because it is blocked by hardware in other
 * modes. Phase Segment 1 = (FPSEG1 + 1) * Time-Quanta. Time-Quantum = one Sclock
 * period.
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCBT_FPSEG1 field. */
#define CAN_RD_FDCBT_FPSEG1(base) ((CAN_FDCBT_REG(base) & CAN_FDCBT_FPSEG1_MASK) >> CAN_FDCBT_FPSEG1_SHIFT)
#define CAN_BRD_FDCBT_FPSEG1(base) (CAN_RD_FDCBT_FPSEG1(base))

/*! @brief Set the FPSEG1 field to a new value. */
#define CAN_WR_FDCBT_FPSEG1(base, value) (CAN_RMW_FDCBT(base, CAN_FDCBT_FPSEG1_MASK, CAN_FDCBT_FPSEG1(value)))
#define CAN_BWR_FDCBT_FPSEG1(base, value) (CAN_WR_FDCBT_FPSEG1(base, value))
/*@}*/

/*!
 * @name Register CAN_FDCBT, field FPROPSEG[14:10] (RW)
 *
 * This 5-bit field defines the length of the Propagation Segment in the bit
 * time in the data bit rate portion of a CAN FD message with the BRS bit set. This
 * field can be written only in Freeze mode because it is blocked by hardware in
 * other modes. Propagation Segment Time = FPROPSEG * Time-Quanta. Time-Quantum =
 * one Sclock period.
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCBT_FPROPSEG field. */
#define CAN_RD_FDCBT_FPROPSEG(base) ((CAN_FDCBT_REG(base) & CAN_FDCBT_FPROPSEG_MASK) >> CAN_FDCBT_FPROPSEG_SHIFT)
#define CAN_BRD_FDCBT_FPROPSEG(base) (CAN_RD_FDCBT_FPROPSEG(base))

/*! @brief Set the FPROPSEG field to a new value. */
#define CAN_WR_FDCBT_FPROPSEG(base, value) (CAN_RMW_FDCBT(base, CAN_FDCBT_FPROPSEG_MASK, CAN_FDCBT_FPROPSEG(value)))
#define CAN_BWR_FDCBT_FPROPSEG(base, value) (CAN_WR_FDCBT_FPROPSEG(base, value))
/*@}*/

/*!
 * @name Register CAN_FDCBT, field FRJW[18:16] (RW)
 *
 * This 3-bit field defines the maximum number of time quanta that a bit time
 * can be changed by one re-synchronization in the data bit rate portion of a CAN
 * FD message with the BRS bit set. One time quantum is equal to the Sclock
 * period. This field can be written only in Freeze mode because it is blocked by
 * hardware in other modes. Resync Jump Width = FSJW + 1.
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCBT_FRJW field. */
#define CAN_RD_FDCBT_FRJW(base) ((CAN_FDCBT_REG(base) & CAN_FDCBT_FRJW_MASK) >> CAN_FDCBT_FRJW_SHIFT)
#define CAN_BRD_FDCBT_FRJW(base) (CAN_RD_FDCBT_FRJW(base))

/*! @brief Set the FRJW field to a new value. */
#define CAN_WR_FDCBT_FRJW(base, value) (CAN_RMW_FDCBT(base, CAN_FDCBT_FRJW_MASK, CAN_FDCBT_FRJW(value)))
#define CAN_BWR_FDCBT_FRJW(base, value) (CAN_WR_FDCBT_FRJW(base, value))
/*@}*/

/*!
 * @name Register CAN_FDCBT, field FPRESDIV[29:20] (RW)
 *
 * This 10-bit field defines the ratio between the PE clock frequency and the
 * Serial Clock (Sclock) frequency in the data bit rate portion of a CAN FD message
 * with the BRS bit set. The Sclock period defines the time quantum of the CAN
 * FD protocol for the data bit rate. This field can be written only in Freeze
 * mode because it is blocked by hardware in other modes. Sclock frequency = PE
 * clock frequency / (FPRESDIV + 1)
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCBT_FPRESDIV field. */
#define CAN_RD_FDCBT_FPRESDIV(base) ((CAN_FDCBT_REG(base) & CAN_FDCBT_FPRESDIV_MASK) >> CAN_FDCBT_FPRESDIV_SHIFT)
#define CAN_BRD_FDCBT_FPRESDIV(base) (CAN_RD_FDCBT_FPRESDIV(base))

/*! @brief Set the FPRESDIV field to a new value. */
#define CAN_WR_FDCBT_FPRESDIV(base, value) (CAN_RMW_FDCBT(base, CAN_FDCBT_FPRESDIV_MASK, CAN_FDCBT_FPRESDIV(value)))
#define CAN_BWR_FDCBT_FPRESDIV(base, value) (CAN_WR_FDCBT_FPRESDIV(base, value))
/*@}*/

/*******************************************************************************
 * CAN_FDCRC - CAN FD CRC Register
 ******************************************************************************/

/*!
 * @brief CAN_FDCRC - CAN FD CRC Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register provides information about the CRC of transmitted messages.
 * FlexCAN uses different CRC polynomials for different frame formats, as shown
 * below. The CRC_15 polynomial is used for all frames in CAN format. The CRC_17
 * polynomial is used for frames in CAN FD format with a DATA FIELD up to sixteen
 * bytes. The CRC_21 polynomial is used for frames in CAN FD format with a DATA
 * FIELD longer than sixteen bytes. Each polynomial shown below results in a Hamming
 * Distance of 6. This register is updated at the same time the Tx Interrupt Flag
 * is asserted.
 */
/*!
 * @name Constants and macros for entire CAN_FDCRC register
 */
/*@{*/
#define CAN_RD_FDCRC(base)       (CAN_FDCRC_REG(base))
/*@}*/

/*
 * Constants & macros for individual CAN_FDCRC bitfields
 */

/*!
 * @name Register CAN_FDCRC, field FD_TXCRC[20:0] (RO)
 *
 * This 21-bit field contains the CRC value calculated over the most recent
 * transmitted message. Different CRC polynomials are used for different frame
 * formats. A 15-bit polynomial, CRC_15, is used for all frames in CAN format. The
 * second 17-bit polynomial, CRC_17, is used for frames in CAN FD format with a data
 * field up to sixteen bytes long. The third 21-bit polynomial, CRC_21, is used
 * for frames in CAN FD format with a data field longer than sixteen bytes. For
 * CRC_15 and CRC_17, the 6 most significant bits and the 4 most significant bits
 * are reported as zeros, respectively. For CRC_15, this register has the same
 * content as CRC Register.
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCRC_FD_TXCRC field. */
#define CAN_RD_FDCRC_FD_TXCRC(base) ((CAN_FDCRC_REG(base) & CAN_FDCRC_FD_TXCRC_MASK) >> CAN_FDCRC_FD_TXCRC_SHIFT)
#define CAN_BRD_FDCRC_FD_TXCRC(base) (CAN_RD_FDCRC_FD_TXCRC(base))
/*@}*/

/*!
 * @name Register CAN_FDCRC, field FD_MBCRC[30:24] (RO)
 *
 * This field indicates the number of the Mailbox corresponding to the value in
 * FD_TXCRC field, for both FD and non-FD frames. It reports the same information
 * as in MBCRC bit field in CAN_CRCR register.
 */
/*@{*/
/*! @brief Read current value of the CAN_FDCRC_FD_MBCRC field. */
#define CAN_RD_FDCRC_FD_MBCRC(base) ((CAN_FDCRC_REG(base) & CAN_FDCRC_FD_MBCRC_MASK) >> CAN_FDCRC_FD_MBCRC_SHIFT)
#define CAN_BRD_FDCRC_FD_MBCRC(base) (CAN_RD_FDCRC_FD_MBCRC(base))
/*@}*/

