nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * S32K144 CMP
 *
 * High-Speed Comparator (CMP), Voltage Reference (VREF) Digital-to-Analog Converter (DAC), and Analog Mux (ANMUX)
 *
 * Registers defined in this header file:
 * - CMP_C0 - CMP Control Register 0
 * - CMP_C1 - CMP Control Register 1
 * - CMP_C2 - CMP Control Register 2
 */

#define CMP_INSTANCE_COUNT (1U) /*!< Number of instances of the CMP module. */
#define CMP0_IDX (0U) /*!< Instance number for CMP0. */

/*******************************************************************************
 * CMP_C0 - CMP Control Register 0
 ******************************************************************************/

/*!
 * @brief CMP_C0 - CMP Control Register 0 (RW)
 *
 * Reset value: 0x00000000U
 *
 * Access: Supervisor read/write User read/write
 */
/*!
 * @name Constants and macros for entire CMP_C0 register
 */
/*@{*/
#define CMP_RD_C0(base)          (CMP_C0_REG(base))
#define CMP_WR_C0(base, value)   (CMP_C0_REG(base) = (value))
#define CMP_RMW_C0(base, mask, value) (CMP_WR_C0(base, (CMP_RD_C0(base) & ~(mask)) | (value)))
#define CMP_SET_C0(base, value)  (CMP_WR_C0(base, CMP_RD_C0(base) |  (value)))
#define CMP_CLR_C0(base, value)  (CMP_WR_C0(base, CMP_RD_C0(base) & ~(value)))
#define CMP_TOG_C0(base, value)  (CMP_WR_C0(base, CMP_RD_C0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CMP_C0 bitfields
 */

/*!
 * @name Register CMP_C0, field HYSTCTR[1:0] (RW)
 *
 * Values:
 * - 0b00 - The hard block output has level 0 hysteresis internally.
 * - 0b01 - The hard block output has level 1 hysteresis internally.
 * - 0b10 - The hard block output has level 2 hysteresis internally.
 * - 0b11 - The hard block output has level 3 hysteresis internally.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_HYSTCTR field. */
#define CMP_RD_C0_HYSTCTR(base) ((CMP_C0_REG(base) & CMP_C0_HYSTCTR_MASK) >> CMP_C0_HYSTCTR_SHIFT)
#define CMP_BRD_C0_HYSTCTR(base) (CMP_RD_C0_HYSTCTR(base))

/*! @brief Set the HYSTCTR field to a new value. */
#define CMP_WR_C0_HYSTCTR(base, value) (CMP_RMW_C0(base, (CMP_C0_HYSTCTR_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_HYSTCTR(value)))
#define CMP_BWR_C0_HYSTCTR(base, value) (CMP_WR_C0_HYSTCTR(base, value))
/*@}*/

/*!
 * @name Register CMP_C0, field OFFSET[2] (RW)
 *
 * If OFFSET = 1, then there will be no hysteresis in the case of INP crossing
 * INN in the positive direction (or INN crossing INP in the negative direction).
 * Hysteresis still exists for INP crossing INN in the falling direction. If
 * OFFSET = 0, then the hysteresis selected by HYSTCTR is valid for both directions.
 *
 * Values:
 * - 0b0 - The comparator hard block output has level 0 offset internally.
 * - 0b1 - The comparator hard block output has level 1 offset internally.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_OFFSET field. */
#define CMP_RD_C0_OFFSET(base) ((CMP_C0_REG(base) & CMP_C0_OFFSET_MASK) >> CMP_C0_OFFSET_SHIFT)
#define CMP_BRD_C0_OFFSET(base) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_OFFSET_SHIFT))

/*! @brief Set the OFFSET field to a new value. */
#define CMP_WR_C0_OFFSET(base, value) (CMP_RMW_C0(base, (CMP_C0_OFFSET_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_OFFSET(value)))
#define CMP_BWR_C0_OFFSET(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_OFFSET_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C0, field FILTER_CNT[6:4] (RW)
 *
 * This field specifies the number of consecutive samples that must agree prior
 * to the comparator ouput filter accepting a new output state. For information
 * regarding filter programming and latency, please see the Functional Description.
 *
 * Values:
 * - 0b000 - Filter is disabled. If SE = 1, then COUT is a logic zero (this is
 *     not a legal state, and is not recommended). If SE = 0, COUT = COUTA.
 * - 0b001 - 1 consecutive sample must agree (comparator output is simply
 *     sampled).
 * - 0b010 - 2 consecutive samples must agree.
 * - 0b011 - 3 consecutive samples must agree.
 * - 0b100 - 4 consecutive samples must agree.
 * - 0b101 - 5 consecutive samples must agree.
 * - 0b110 - 6 consecutive samples must agree.
 * - 0b111 - 7 consecutive samples must agree.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_FILTER_CNT field. */
#define CMP_RD_C0_FILTER_CNT(base) ((CMP_C0_REG(base) & CMP_C0_FILTER_CNT_MASK) >> CMP_C0_FILTER_CNT_SHIFT)
#define CMP_BRD_C0_FILTER_CNT(base) (CMP_RD_C0_FILTER_CNT(base))

/*! @brief Set the FILTER_CNT field to a new value. */
#define CMP_WR_C0_FILTER_CNT(base, value) (CMP_RMW_C0(base, (CMP_C0_FILTER_CNT_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_FILTER_CNT(value)))
#define CMP_BWR_C0_FILTER_CNT(base, value) (CMP_WR_C0_FILTER_CNT(base, value))
/*@}*/

/*!
 * @name Register CMP_C0, field EN[8] (RW)
 *
 * The EN bit enables the Analog Comparator Module. When the module is not
 * enabled, the analog part remains in the off state, and consumes no power. When the
 * same input is selected from analog mux to the positive and negative port, the
 * comparator is disabled automatically.
 *
 * Values:
 * - 0b0 - Analog Comparator is disabled.
 * - 0b1 - Analog Comparator is enabled.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_EN field. */
#define CMP_RD_C0_EN(base)   ((CMP_C0_REG(base) & CMP_C0_EN_MASK) >> CMP_C0_EN_SHIFT)
#define CMP_BRD_C0_EN(base)  (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_EN_SHIFT))

/*! @brief Set the EN field to a new value. */
#define CMP_WR_C0_EN(base, value) (CMP_RMW_C0(base, (CMP_C0_EN_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_EN(value)))
#define CMP_BWR_C0_EN(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C0, field OPE[9] (RW)
 *
 * The OPE bit enables the path from the comparator output to a selected pin.
 *
 * Values:
 * - 0b0 - When OPE is 0, the comparator output (after window/filter settings
 *     dependent on software configuration) is not available to a packaged pin.
 * - 0b1 - When OPE is 1, and if the software has configured the comparator to
 *     own a packaged pin, the comparator is available in a packaged pin.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_OPE field. */
#define CMP_RD_C0_OPE(base)  ((CMP_C0_REG(base) & CMP_C0_OPE_MASK) >> CMP_C0_OPE_SHIFT)
#define CMP_BRD_C0_OPE(base) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_OPE_SHIFT))

/*! @brief Set the OPE field to a new value. */
#define CMP_WR_C0_OPE(base, value) (CMP_RMW_C0(base, (CMP_C0_OPE_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_OPE(value)))
#define CMP_BWR_C0_OPE(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_OPE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C0, field COS[10] (RW)
 *
 * Values:
 * - 0b0 - Set CMPO to equal COUT (filtered comparator output).
 * - 0b1 - Set CMPO to equal COUTA (unfiltered comparator output).
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_COS field. */
#define CMP_RD_C0_COS(base)  ((CMP_C0_REG(base) & CMP_C0_COS_MASK) >> CMP_C0_COS_SHIFT)
#define CMP_BRD_C0_COS(base) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_COS_SHIFT))

/*! @brief Set the COS field to a new value. */
#define CMP_WR_C0_COS(base, value) (CMP_RMW_C0(base, (CMP_C0_COS_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_COS(value)))
#define CMP_BWR_C0_COS(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_COS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C0, field INVT[11] (RW)
 *
 * This bit allows selecting the polarity of the analog comparator function. It
 * is also driven to the COUT output (on both the device pin and as C0[COUT])
 * when CR1[OPE]=0.
 *
 * Values:
 * - 0b0 - Does not invert the comparator output.
 * - 0b1 - Inverts the comparator output.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_INVT field. */
#define CMP_RD_C0_INVT(base) ((CMP_C0_REG(base) & CMP_C0_INVT_MASK) >> CMP_C0_INVT_SHIFT)
#define CMP_BRD_C0_INVT(base) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_INVT_SHIFT))

/*! @brief Set the INVT field to a new value. */
#define CMP_WR_C0_INVT(base, value) (CMP_RMW_C0(base, (CMP_C0_INVT_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_INVT(value)))
#define CMP_BWR_C0_INVT(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_INVT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C0, field PMODE[12] (RW)
 *
 * Values:
 * - 0b0 - Low Speed (LS) comparison mode is selected.
 * - 0b1 - High Speed (HS) comparison mode is selected, in VLPx (low power mode,
 *     low speed compute mode).
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_PMODE field. */
#define CMP_RD_C0_PMODE(base) ((CMP_C0_REG(base) & CMP_C0_PMODE_MASK) >> CMP_C0_PMODE_SHIFT)
#define CMP_BRD_C0_PMODE(base) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_PMODE_SHIFT))

/*! @brief Set the PMODE field to a new value. */
#define CMP_WR_C0_PMODE(base, value) (CMP_RMW_C0(base, (CMP_C0_PMODE_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_PMODE(value)))
#define CMP_BWR_C0_PMODE(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_PMODE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C0, field WE[14] (RW)
 *
 * At any given time, either SE or WE can be set. If a write to this register
 * attempts to set both, then SE is set and WE is cleared. However, avoid writing
 * ones to both bit locations because this "11" case is reserved.
 *
 * Values:
 * - 0b0 - Windowing mode is not selected.
 * - 0b1 - Windowing mode is selected.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_WE field. */
#define CMP_RD_C0_WE(base)   ((CMP_C0_REG(base) & CMP_C0_WE_MASK) >> CMP_C0_WE_SHIFT)
#define CMP_BRD_C0_WE(base)  (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_WE_SHIFT))

/*! @brief Set the WE field to a new value. */
#define CMP_WR_C0_WE(base, value) (CMP_RMW_C0(base, (CMP_C0_WE_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_WE(value)))
#define CMP_BWR_C0_WE(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_WE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C0, field SE[15] (RW)
 *
 * At any given time, either SE or WE can be set. If a write to this register
 * attempts to set both, then SE is set and WE is cleared. However, avoid writing
 * ones to both bit locations because this "11" case is reserved.
 *
 * Values:
 * - 0b0 - Sampling mode is not selected.
 * - 0b1 - Sampling mode is selected.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_SE field. */
#define CMP_RD_C0_SE(base)   ((CMP_C0_REG(base) & CMP_C0_SE_MASK) >> CMP_C0_SE_SHIFT)
#define CMP_BRD_C0_SE(base)  (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_SE_SHIFT))

