nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the SE field to a new value. */
#define CMP_WR_C0_SE(base, value) (CMP_RMW_C0(base, (CMP_C0_SE_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_SE(value)))
#define CMP_BWR_C0_SE(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_SE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C0, field FPR[23:16] (RW)
 *
 * Specifies the sampling period, in bus clock cycles, of the comparator output
 * filter, when C1[SE] = 0. Setting FPR to 0x0 disables the filter. Filter
 * programming and latency details are provided in the CMP functional description. This
 * field has no effect when C0[SE ]= 1. In that case, the external SAMPLE signal
 * is used to determine the sampling period.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_FPR field. */
#define CMP_RD_C0_FPR(base)  ((CMP_C0_REG(base) & CMP_C0_FPR_MASK) >> CMP_C0_FPR_SHIFT)
#define CMP_BRD_C0_FPR(base) (CMP_RD_C0_FPR(base))

/*! @brief Set the FPR field to a new value. */
#define CMP_WR_C0_FPR(base, value) (CMP_RMW_C0(base, (CMP_C0_FPR_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_FPR(value)))
#define CMP_BWR_C0_FPR(base, value) (CMP_WR_C0_FPR(base, value))
/*@}*/

/*!
 * @name Register CMP_C0, field COUT[24] (RO)
 *
 * Returns the current value of the Analog Comparator output, when read. The
 * field is reset to 0 and will read as C0[INVT] when the Analog Comparator module
 * is disabled, that is, when C0[EN] = 0. Writes to this field are ignored.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_COUT field. */
#define CMP_RD_C0_COUT(base) ((CMP_C0_REG(base) & CMP_C0_COUT_MASK) >> CMP_C0_COUT_SHIFT)
#define CMP_BRD_C0_COUT(base) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_COUT_SHIFT))
/*@}*/

/*!
 * @name Register CMP_C0, field CFF[25] (W1C)
 *
 * Detects a falling-edge on COUT, when set, during normal operation. CFF is
 * cleared by writing 1 to it. During Stop modes, CFF is level senstive .
 *
 * Values:
 * - 0b0 - A falling edge has not been detected on COUT.
 * - 0b1 - A falling edge on COUT has occurred.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_CFF field. */
#define CMP_RD_C0_CFF(base)  ((CMP_C0_REG(base) & CMP_C0_CFF_MASK) >> CMP_C0_CFF_SHIFT)
#define CMP_BRD_C0_CFF(base) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_CFF_SHIFT))

/*! @brief Set the CFF field to a new value. */
#define CMP_WR_C0_CFF(base, value) (CMP_RMW_C0(base, (CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_CFF(value)))
#define CMP_BWR_C0_CFF(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_CFF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C0, field CFR[26] (W1C)
 *
 * Detects a rising-edge on COUT, when set, during normal operation. CFR is
 * cleared by writing 1 to it. During Stop modes, CFR is level sensitive
 *
 * Values:
 * - 0b0 - A rising edge has not been detected on COUT.
 * - 0b1 - A rising edge on COUT has occurred.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_CFR field. */
#define CMP_RD_C0_CFR(base)  ((CMP_C0_REG(base) & CMP_C0_CFR_MASK) >> CMP_C0_CFR_SHIFT)
#define CMP_BRD_C0_CFR(base) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_CFR_SHIFT))

/*! @brief Set the CFR field to a new value. */
#define CMP_WR_C0_CFR(base, value) (CMP_RMW_C0(base, (CMP_C0_CFR_MASK | CMP_C0_CFF_MASK), CMP_C0_CFR(value)))
#define CMP_BWR_C0_CFR(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_CFR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C0, field IEF[27] (RW)
 *
 * Enables the CFF interrupt from the CMP. When this field is set, an interrupt
 * will be asserted when CFF is set.
 *
 * Values:
 * - 0b0 - Interrupt is disabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_IEF field. */
#define CMP_RD_C0_IEF(base)  ((CMP_C0_REG(base) & CMP_C0_IEF_MASK) >> CMP_C0_IEF_SHIFT)
#define CMP_BRD_C0_IEF(base) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_IEF_SHIFT))

/*! @brief Set the IEF field to a new value. */
#define CMP_WR_C0_IEF(base, value) (CMP_RMW_C0(base, (CMP_C0_IEF_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_IEF(value)))
#define CMP_BWR_C0_IEF(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_IEF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C0, field IER[28] (RW)
 *
 * Enables the CFR interrupt from the CMP. When this field is set, an interrupt
 * will be asserted when CFR is set.
 *
 * Values:
 * - 0b0 - Interrupt is disabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_IER field. */
#define CMP_RD_C0_IER(base)  ((CMP_C0_REG(base) & CMP_C0_IER_MASK) >> CMP_C0_IER_SHIFT)
#define CMP_BRD_C0_IER(base) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_IER_SHIFT))

/*! @brief Set the IER field to a new value. */
#define CMP_WR_C0_IER(base, value) (CMP_RMW_C0(base, (CMP_C0_IER_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_IER(value)))
#define CMP_BWR_C0_IER(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_IER_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C0, field DMAEN[30] (RW)
 *
 * Enables the DMA transfer triggered from the CMP module. When this field is
 * set, a DMA request is asserted when CFR or CFF is set.
 *
 * Values:
 * - 0b0 - DMA is disabled.
 * - 0b1 - DMA is enabled.
 */
/*@{*/
/*! @brief Read current value of the CMP_C0_DMAEN field. */
#define CMP_RD_C0_DMAEN(base) ((CMP_C0_REG(base) & CMP_C0_DMAEN_MASK) >> CMP_C0_DMAEN_SHIFT)
#define CMP_BRD_C0_DMAEN(base) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_DMAEN_SHIFT))

/*! @brief Set the DMAEN field to a new value. */
#define CMP_WR_C0_DMAEN(base, value) (CMP_RMW_C0(base, (CMP_C0_DMAEN_MASK | CMP_C0_CFF_MASK | CMP_C0_CFR_MASK), CMP_C0_DMAEN(value)))
#define CMP_BWR_C0_DMAEN(base, value) (BITBAND_ACCESS32(&CMP_C0_REG(base), CMP_C0_DMAEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * CMP_C1 - CMP Control Register 1
 ******************************************************************************/

/*!
 * @brief CMP_C1 - CMP Control Register 1 (RW)
 *
 * Reset value: 0x00000000U
 *
 * Access: Supervisor read/write User read/write
 */
/*!
 * @name Constants and macros for entire CMP_C1 register
 */
/*@{*/
#define CMP_RD_C1(base)          (CMP_C1_REG(base))
#define CMP_WR_C1(base, value)   (CMP_C1_REG(base) = (value))
#define CMP_RMW_C1(base, mask, value) (CMP_WR_C1(base, (CMP_RD_C1(base) & ~(mask)) | (value)))
#define CMP_SET_C1(base, value)  (CMP_WR_C1(base, CMP_RD_C1(base) |  (value)))
#define CMP_CLR_C1(base, value)  (CMP_WR_C1(base, CMP_RD_C1(base) & ~(value)))
#define CMP_TOG_C1(base, value)  (CMP_WR_C1(base, CMP_RD_C1(base) ^  (value)))
/*@}*/

