nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual CMP_C1 bitfields
 */

/*!
 * @name Register CMP_C1, field VOSEL[7:0] (RW)
 *
 * This bit selects an output voltage from one of 256 distinct levels. DACO =
 * (Vin/256) * (VOSEL[7:0] + 1), so the DACO range is from Vin/256 to Vin.
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_VOSEL field. */
#define CMP_RD_C1_VOSEL(base) ((CMP_C1_REG(base) & CMP_C1_VOSEL_MASK) >> CMP_C1_VOSEL_SHIFT)
#define CMP_BRD_C1_VOSEL(base) (CMP_RD_C1_VOSEL(base))

/*! @brief Set the VOSEL field to a new value. */
#define CMP_WR_C1_VOSEL(base, value) (CMP_RMW_C1(base, CMP_C1_VOSEL_MASK, CMP_C1_VOSEL(value)))
#define CMP_BWR_C1_VOSEL(base, value) (CMP_WR_C1_VOSEL(base, value))
/*@}*/

/*!
 * @name Register CMP_C1, field MSEL[10:8] (RW)
 *
 * Determines which input is selected for the minus mux. NOTE: These bits are
 * used to select the external 8 inputs for the minus mux, the actual input to the
 * negative port of the comparator is selected between this mux out and other
 * inputs finally, see the definition in INNSEL. Note: For the round robin mode of
 * operation, the MSEL and PSEL bitfields in CMPx_C1 register must have different
 * values.
 *
 * Values:
 * - 0b000 - IN0
 * - 0b001 - IN1
 * - 0b010 - IN2
 * - 0b011 - IN3
 * - 0b100 - IN4
 * - 0b101 - IN5
 * - 0b110 - IN6
 * - 0b111 - IN7
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_MSEL field. */
#define CMP_RD_C1_MSEL(base) ((CMP_C1_REG(base) & CMP_C1_MSEL_MASK) >> CMP_C1_MSEL_SHIFT)
#define CMP_BRD_C1_MSEL(base) (CMP_RD_C1_MSEL(base))

/*! @brief Set the MSEL field to a new value. */
#define CMP_WR_C1_MSEL(base, value) (CMP_RMW_C1(base, CMP_C1_MSEL_MASK, CMP_C1_MSEL(value)))
#define CMP_BWR_C1_MSEL(base, value) (CMP_WR_C1_MSEL(base, value))
/*@}*/

/*!
 * @name Register CMP_C1, field PSEL[13:11] (RW)
 *
 * Determines which input is selected for the plus mux. NOTE: These bits are
 * used to selecte the external 8 inputs for the plus mux, the actual input to the
 * positive port of the comparator is selected between this mux out and other
 * inputs finally, see the definition in INPSEL. Note: For the round robin mode of
 * operation, the MSEL and PSEL bitfields in CMPx_C1 register must have different
 * values.
 *
 * Values:
 * - 0b000 - IN0
 * - 0b001 - IN1
 * - 0b010 - IN2
 * - 0b011 - IN3
 * - 0b100 - IN4
 * - 0b101 - IN5
 * - 0b110 - IN6
 * - 0b111 - IN7
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_PSEL field. */
#define CMP_RD_C1_PSEL(base) ((CMP_C1_REG(base) & CMP_C1_PSEL_MASK) >> CMP_C1_PSEL_SHIFT)
#define CMP_BRD_C1_PSEL(base) (CMP_RD_C1_PSEL(base))

/*! @brief Set the PSEL field to a new value. */
#define CMP_WR_C1_PSEL(base, value) (CMP_RMW_C1(base, CMP_C1_PSEL_MASK, CMP_C1_PSEL(value)))
#define CMP_BWR_C1_PSEL(base, value) (CMP_WR_C1_PSEL(base, value))
/*@}*/

/*!
 * @name Register CMP_C1, field VRSEL[14] (RW)
 *
 * Values:
 * - 0b0 - Vin1 is selected as resistor ladder network supply reference Vin.
 * - 0b1 - Vin2 is selected as resistor ladder network supply reference Vin.
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_VRSEL field. */
#define CMP_RD_C1_VRSEL(base) ((CMP_C1_REG(base) & CMP_C1_VRSEL_MASK) >> CMP_C1_VRSEL_SHIFT)
#define CMP_BRD_C1_VRSEL(base) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_VRSEL_SHIFT))

/*! @brief Set the VRSEL field to a new value. */
#define CMP_WR_C1_VRSEL(base, value) (CMP_RMW_C1(base, CMP_C1_VRSEL_MASK, CMP_C1_VRSEL(value)))
#define CMP_BWR_C1_VRSEL(base, value) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_VRSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C1, field DACEN[15] (RW)
 *
 * This bit is used to enable the DAC. When the DAC is disabled, it is powered
 * down to conserve power.
 *
 * Values:
 * - 0b0 - DAC is disabled.
 * - 0b1 - DAC is enabled.
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_DACEN field. */
#define CMP_RD_C1_DACEN(base) ((CMP_C1_REG(base) & CMP_C1_DACEN_MASK) >> CMP_C1_DACEN_SHIFT)
#define CMP_BRD_C1_DACEN(base) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_DACEN_SHIFT))

/*! @brief Set the DACEN field to a new value. */
#define CMP_WR_C1_DACEN(base, value) (CMP_RMW_C1(base, CMP_C1_DACEN_MASK, CMP_C1_DACEN(value)))
#define CMP_BWR_C1_DACEN(base, value) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_DACEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C1, field CHN0[16] (RW)
 *
 * Channel 0 of the input enable for the round-robin checker. If CHN0 is set,
 * then the corresponding channel to the non-fixed mux port is enabled to check its
 * voltage value in the round-robin mode. If the same channel is selected as the
 * reference voltage, this bit has no effect.
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_CHN0 field. */
#define CMP_RD_C1_CHN0(base) ((CMP_C1_REG(base) & CMP_C1_CHN0_MASK) >> CMP_C1_CHN0_SHIFT)
#define CMP_BRD_C1_CHN0(base) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN0_SHIFT))

/*! @brief Set the CHN0 field to a new value. */
#define CMP_WR_C1_CHN0(base, value) (CMP_RMW_C1(base, CMP_C1_CHN0_MASK, CMP_C1_CHN0(value)))
#define CMP_BWR_C1_CHN0(base, value) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C1, field CHN1[17] (RW)
 *
 * Channel 1 of the input enable for the round-robin checker. If CHN1 is set,
 * then the corresponding channel to the non-fixed mux port is enabled to check its
 * voltage value in the round-robin mode. If the same channel is selected as the
 * reference voltage, this bit has no effect.
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_CHN1 field. */
#define CMP_RD_C1_CHN1(base) ((CMP_C1_REG(base) & CMP_C1_CHN1_MASK) >> CMP_C1_CHN1_SHIFT)
#define CMP_BRD_C1_CHN1(base) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN1_SHIFT))

/*! @brief Set the CHN1 field to a new value. */
#define CMP_WR_C1_CHN1(base, value) (CMP_RMW_C1(base, CMP_C1_CHN1_MASK, CMP_C1_CHN1(value)))
#define CMP_BWR_C1_CHN1(base, value) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C1, field CHN2[18] (RW)
 *
 * Channel 2 of the input enable for the round-robin checker. If CHN2 is set,
 * then the corresponding channel to the non-fixed mux port is enabled to check its
 * voltage value in the round-robin mode. If the same channel is selected as the
 * reference voltage, this bit has no effect.
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_CHN2 field. */
#define CMP_RD_C1_CHN2(base) ((CMP_C1_REG(base) & CMP_C1_CHN2_MASK) >> CMP_C1_CHN2_SHIFT)
#define CMP_BRD_C1_CHN2(base) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN2_SHIFT))

/*! @brief Set the CHN2 field to a new value. */
#define CMP_WR_C1_CHN2(base, value) (CMP_RMW_C1(base, CMP_C1_CHN2_MASK, CMP_C1_CHN2(value)))
#define CMP_BWR_C1_CHN2(base, value) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C1, field CHN3[19] (RW)
 *
 * Channel 3 of the input enable for the round-robin checker. If CHN3 is set,
 * then the corresponding channel to the non-fixed mux port is enabled to check its
 * voltage value in the round-robin mode. If the same channel is selected as the
 * reference voltage, this bit has no effect.
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_CHN3 field. */
#define CMP_RD_C1_CHN3(base) ((CMP_C1_REG(base) & CMP_C1_CHN3_MASK) >> CMP_C1_CHN3_SHIFT)
#define CMP_BRD_C1_CHN3(base) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN3_SHIFT))

