nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the CHN3 field to a new value. */
#define CMP_WR_C1_CHN3(base, value) (CMP_RMW_C1(base, CMP_C1_CHN3_MASK, CMP_C1_CHN3(value)))
#define CMP_BWR_C1_CHN3(base, value) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C1, field CHN4[20] (RW)
 *
 * Channel 4 of the input enable for the round-robin checker. If CHN4 is set,
 * then the corresponding channel to the non-fixed mux port is enabled to check its
 * voltage value in the round-robin mode. If the same channel is selected as the
 * reference voltage, this bit has no effect.
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_CHN4 field. */
#define CMP_RD_C1_CHN4(base) ((CMP_C1_REG(base) & CMP_C1_CHN4_MASK) >> CMP_C1_CHN4_SHIFT)
#define CMP_BRD_C1_CHN4(base) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN4_SHIFT))

/*! @brief Set the CHN4 field to a new value. */
#define CMP_WR_C1_CHN4(base, value) (CMP_RMW_C1(base, CMP_C1_CHN4_MASK, CMP_C1_CHN4(value)))
#define CMP_BWR_C1_CHN4(base, value) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN4_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C1, field CHN5[21] (RW)
 *
 * Channel 5 of the input enable for the round-robin checker. If CHN5 is set,
 * then the corresponding channel to the non-fixed mux port is enabled to check its
 * voltage value in the round-robin mode. If the same channel is selected as the
 * reference voltage, this bit has no effect.
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_CHN5 field. */
#define CMP_RD_C1_CHN5(base) ((CMP_C1_REG(base) & CMP_C1_CHN5_MASK) >> CMP_C1_CHN5_SHIFT)
#define CMP_BRD_C1_CHN5(base) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN5_SHIFT))

/*! @brief Set the CHN5 field to a new value. */
#define CMP_WR_C1_CHN5(base, value) (CMP_RMW_C1(base, CMP_C1_CHN5_MASK, CMP_C1_CHN5(value)))
#define CMP_BWR_C1_CHN5(base, value) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN5_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C1, field CHN6[22] (RW)
 *
 * Channel 6 of the input enable for the round-robin checker. If CHN6 is set,
 * then the corresponding channel to the non-fixed mux port is enabled to check its
 * voltage value in the round-robin mode. If the same channel is selected as the
 * reference voltage, this bit has no effect.
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_CHN6 field. */
#define CMP_RD_C1_CHN6(base) ((CMP_C1_REG(base) & CMP_C1_CHN6_MASK) >> CMP_C1_CHN6_SHIFT)
#define CMP_BRD_C1_CHN6(base) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN6_SHIFT))

/*! @brief Set the CHN6 field to a new value. */
#define CMP_WR_C1_CHN6(base, value) (CMP_RMW_C1(base, CMP_C1_CHN6_MASK, CMP_C1_CHN6(value)))
#define CMP_BWR_C1_CHN6(base, value) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN6_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C1, field CHN7[23] (RW)
 *
 * Channel 7 of the input enable for the round-robin checker. If CHN7 is set,
 * then the corresponding channel to the non-fixed mux port is enabled to check its
 * voltage value in the round-robin mode. If the same channel is selected as the
 * reference voltage, this bit has no effect.
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_CHN7 field. */
#define CMP_RD_C1_CHN7(base) ((CMP_C1_REG(base) & CMP_C1_CHN7_MASK) >> CMP_C1_CHN7_SHIFT)
#define CMP_BRD_C1_CHN7(base) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN7_SHIFT))

/*! @brief Set the CHN7 field to a new value. */
#define CMP_WR_C1_CHN7(base, value) (CMP_RMW_C1(base, CMP_C1_CHN7_MASK, CMP_C1_CHN7(value)))
#define CMP_BWR_C1_CHN7(base, value) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_CHN7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C1, field INNSEL[25:24] (RW)
 *
 * Determines which input is selected for the plus input of the comparator.
 * NOTE: These selections is used to select the final negative input to the
 * comparator. Note: For the round robin mode of operation, the MSEL and PSEL bitfields in
 * CMPx_C1 register must have different values.
 *
 * Values:
 * - 0b00 - IN0, from the 6b DAC output
 * - 0b01 - IN1, from the analog 8-1 mux
 * - 0b10 - Reserved
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_INNSEL field. */
#define CMP_RD_C1_INNSEL(base) ((CMP_C1_REG(base) & CMP_C1_INNSEL_MASK) >> CMP_C1_INNSEL_SHIFT)
#define CMP_BRD_C1_INNSEL(base) (CMP_RD_C1_INNSEL(base))

/*! @brief Set the INNSEL field to a new value. */
#define CMP_WR_C1_INNSEL(base, value) (CMP_RMW_C1(base, CMP_C1_INNSEL_MASK, CMP_C1_INNSEL(value)))
#define CMP_BWR_C1_INNSEL(base, value) (CMP_WR_C1_INNSEL(base, value))
/*@}*/

/*!
 * @name Register CMP_C1, field INPSEL[28:27] (RW)
 *
 * Determines which input is selected for the plus input of the comparator.
 * NOTE: These selections is used to select the final positive input to the
 * comparator. Note: For the round robin mode of operation, the MSEL and PSEL bitfields in
 * CMPx_C1 register must have different values.
 *
 * Values:
 * - 0b00 - IN0, from the 6b DAC output
 * - 0b01 - IN1, from the analog 8-1 mux
 * - 0b10 - Reserved
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_INPSEL field. */
#define CMP_RD_C1_INPSEL(base) ((CMP_C1_REG(base) & CMP_C1_INPSEL_MASK) >> CMP_C1_INPSEL_SHIFT)
#define CMP_BRD_C1_INPSEL(base) (CMP_RD_C1_INPSEL(base))

/*! @brief Set the INPSEL field to a new value. */
#define CMP_WR_C1_INPSEL(base, value) (CMP_RMW_C1(base, CMP_C1_INPSEL_MASK, CMP_C1_INPSEL(value)))
#define CMP_BWR_C1_INPSEL(base, value) (CMP_WR_C1_INPSEL(base, value))
/*@}*/

/*!
 * @name Register CMP_C1, field DACOE[29] (RW)
 *
 * This bit is used to enable the output of DAC to outside of this block. When
 * this bit is set, the 6b DAC output will be available for other peripheral usage.
 *
 * Values:
 * - 0b0 - DAC output is disabled to go outside.
 * - 0b1 - DAC output is enabled to go outside.
 */
/*@{*/
/*! @brief Read current value of the CMP_C1_DACOE field. */
#define CMP_RD_C1_DACOE(base) ((CMP_C1_REG(base) & CMP_C1_DACOE_MASK) >> CMP_C1_DACOE_SHIFT)
#define CMP_BRD_C1_DACOE(base) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_DACOE_SHIFT))

/*! @brief Set the DACOE field to a new value. */
#define CMP_WR_C1_DACOE(base, value) (CMP_RMW_C1(base, CMP_C1_DACOE_MASK, CMP_C1_DACOE(value)))
#define CMP_BWR_C1_DACOE(base, value) (BITBAND_ACCESS32(&CMP_C1_REG(base), CMP_C1_DACOE_SHIFT) = (value))
/*@}*/

