nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * CMP_C2 - CMP Control Register 2
 ******************************************************************************/

/*!
 * @brief CMP_C2 - CMP Control Register 2 (RW)
 *
 * Reset value: 0x00000000U
 *
 * Access: Supervisor read/write User read/write
 */
/*!
 * @name Constants and macros for entire CMP_C2 register
 */
/*@{*/
#define CMP_RD_C2(base)          (CMP_C2_REG(base))
#define CMP_WR_C2(base, value)   (CMP_C2_REG(base) = (value))
#define CMP_RMW_C2(base, mask, value) (CMP_WR_C2(base, (CMP_RD_C2(base) & ~(mask)) | (value)))
#define CMP_SET_C2(base, value)  (CMP_WR_C2(base, CMP_RD_C2(base) |  (value)))
#define CMP_CLR_C2(base, value)  (CMP_WR_C2(base, CMP_RD_C2(base) & ~(value)))
#define CMP_TOG_C2(base, value)  (CMP_WR_C2(base, CMP_RD_C2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CMP_C2 bitfields
 */

/*!
 * @name Register CMP_C2, field ACOn[7:0] (RW)
 *
 * The result of the input comparison for channel n . This field stores the
 * latest comparison result of the input channel n with the fixed mux port. Reading
 * this bit returns the latest comparison result. Writing this field defines the
 * pre-set state of channel n.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_ACOn field. */
#define CMP_RD_C2_ACOn(base) ((CMP_C2_REG(base) & CMP_C2_ACOn_MASK) >> CMP_C2_ACOn_SHIFT)
#define CMP_BRD_C2_ACOn(base) (CMP_RD_C2_ACOn(base))

/*! @brief Set the ACOn field to a new value. */
#define CMP_WR_C2_ACOn(base, value) (CMP_RMW_C2(base, (CMP_C2_ACOn_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_ACOn(value)))
#define CMP_BWR_C2_ACOn(base, value) (CMP_WR_C2_ACOn(base, value))
/*@}*/

/*!
 * @name Register CMP_C2, field INITMOD[13:8] (RW)
 *
 * These values specify the round robin clock cycles used to determine the
 * comparator and DAC initialization delays specified by the datasheet. For example
 * the initialization delay is 80us and the round robin clock is 100kHz, then
 * INITMOD should be set to 80us/10us = 8.
 *
 * Values:
 * - 0b000000 - The modulus is set to 64(same with 111111).
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_INITMOD field. */
#define CMP_RD_C2_INITMOD(base) ((CMP_C2_REG(base) & CMP_C2_INITMOD_MASK) >> CMP_C2_INITMOD_SHIFT)
#define CMP_BRD_C2_INITMOD(base) (CMP_RD_C2_INITMOD(base))

/*! @brief Set the INITMOD field to a new value. */
#define CMP_WR_C2_INITMOD(base, value) (CMP_RMW_C2(base, (CMP_C2_INITMOD_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_INITMOD(value)))
#define CMP_BWR_C2_INITMOD(base, value) (CMP_WR_C2_INITMOD(base, value))
/*@}*/

/*!
 * @name Register CMP_C2, field NSAM[15:14] (RW)
 *
 * For a given channel, this field specifies how many round-robin clock cycles
 * later the sample takes place.
 *
 * Values:
 * - 0b00 - The comparison result is sampled as soon as the active channel is
 *     scanned in one round-robin clock.
 * - 0b01 - The sampling takes place 1 round-robin clock cycle after the next
 *     cycle of the round-robin clock.
 * - 0b10 - The sampling takes place 2 round-robin clock cycles after the next
 *     cycle of the round-robin clock.
 * - 0b11 - The sampling takes place 3 round-robin clock cycles after the next
 *     cycle of the round-robin clock.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_NSAM field. */
#define CMP_RD_C2_NSAM(base) ((CMP_C2_REG(base) & CMP_C2_NSAM_MASK) >> CMP_C2_NSAM_SHIFT)
#define CMP_BRD_C2_NSAM(base) (CMP_RD_C2_NSAM(base))

/*! @brief Set the NSAM field to a new value. */
#define CMP_WR_C2_NSAM(base, value) (CMP_RMW_C2(base, (CMP_C2_NSAM_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_NSAM(value)))
#define CMP_BWR_C2_NSAM(base, value) (CMP_WR_C2_NSAM(base, value))
/*@}*/

/*!
 * @name Register CMP_C2, field CH0F[16] (W1C)
 *
 * Channel 0 input changed flag. This bit is set If the channel 0 input changed
 * from the last comparison with the fixed mux port.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_CH0F field. */
#define CMP_RD_C2_CH0F(base) ((CMP_C2_REG(base) & CMP_C2_CH0F_MASK) >> CMP_C2_CH0F_SHIFT)
#define CMP_BRD_C2_CH0F(base) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH0F_SHIFT))

/*! @brief Set the CH0F field to a new value. */
#define CMP_WR_C2_CH0F(base, value) (CMP_RMW_C2(base, (CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_CH0F(value)))
#define CMP_BWR_C2_CH0F(base, value) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH0F_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C2, field CH1F[17] (W1C)
 *
 * Channel 1 input changed flag. This bit is set If the channel 1 input changed
 * from the last comparison with the fixed mux port.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_CH1F field. */
#define CMP_RD_C2_CH1F(base) ((CMP_C2_REG(base) & CMP_C2_CH1F_MASK) >> CMP_C2_CH1F_SHIFT)
#define CMP_BRD_C2_CH1F(base) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH1F_SHIFT))

/*! @brief Set the CH1F field to a new value. */
#define CMP_WR_C2_CH1F(base, value) (CMP_RMW_C2(base, (CMP_C2_CH1F_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_CH1F(value)))
#define CMP_BWR_C2_CH1F(base, value) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH1F_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C2, field CH2F[18] (W1C)
 *
 * Channel 2 input changed flag. This bit is set If the channel 2 input changed
 * from the last comparison with the fixed mux port.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_CH2F field. */
#define CMP_RD_C2_CH2F(base) ((CMP_C2_REG(base) & CMP_C2_CH2F_MASK) >> CMP_C2_CH2F_SHIFT)
#define CMP_BRD_C2_CH2F(base) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH2F_SHIFT))

/*! @brief Set the CH2F field to a new value. */
#define CMP_WR_C2_CH2F(base, value) (CMP_RMW_C2(base, (CMP_C2_CH2F_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_CH2F(value)))
#define CMP_BWR_C2_CH2F(base, value) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH2F_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C2, field CH3F[19] (W1C)
 *
 * Channel 3 input changed flag. This bit is set If the channel 3 input changed
 * from the last comparison with the fixed mux port.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_CH3F field. */
#define CMP_RD_C2_CH3F(base) ((CMP_C2_REG(base) & CMP_C2_CH3F_MASK) >> CMP_C2_CH3F_SHIFT)
#define CMP_BRD_C2_CH3F(base) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH3F_SHIFT))

/*! @brief Set the CH3F field to a new value. */
#define CMP_WR_C2_CH3F(base, value) (CMP_RMW_C2(base, (CMP_C2_CH3F_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_CH3F(value)))
#define CMP_BWR_C2_CH3F(base, value) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH3F_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C2, field CH4F[20] (W1C)
 *
 * Channel 4 input changed flag. This bit is set If the channel 4 input changed
 * from the last comparison with the fixed mux port.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_CH4F field. */
#define CMP_RD_C2_CH4F(base) ((CMP_C2_REG(base) & CMP_C2_CH4F_MASK) >> CMP_C2_CH4F_SHIFT)
#define CMP_BRD_C2_CH4F(base) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH4F_SHIFT))

/*! @brief Set the CH4F field to a new value. */
#define CMP_WR_C2_CH4F(base, value) (CMP_RMW_C2(base, (CMP_C2_CH4F_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_CH4F(value)))
#define CMP_BWR_C2_CH4F(base, value) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH4F_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C2, field CH5F[21] (W1C)
 *
 * Channel 5 input changed flag. This bit is set If the channel 5 input changed
 * from the last comparison with the fixed mux port.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_CH5F field. */
#define CMP_RD_C2_CH5F(base) ((CMP_C2_REG(base) & CMP_C2_CH5F_MASK) >> CMP_C2_CH5F_SHIFT)
#define CMP_BRD_C2_CH5F(base) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH5F_SHIFT))

