nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the CH5F field to a new value. */
#define CMP_WR_C2_CH5F(base, value) (CMP_RMW_C2(base, (CMP_C2_CH5F_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_CH5F(value)))
#define CMP_BWR_C2_CH5F(base, value) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH5F_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C2, field CH6F[22] (W1C)
 *
 * Channel 6 input changed flag. This bit is set If the channel 6 input changed
 * from the last comparison with the fixed mux port.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_CH6F field. */
#define CMP_RD_C2_CH6F(base) ((CMP_C2_REG(base) & CMP_C2_CH6F_MASK) >> CMP_C2_CH6F_SHIFT)
#define CMP_BRD_C2_CH6F(base) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH6F_SHIFT))

/*! @brief Set the CH6F field to a new value. */
#define CMP_WR_C2_CH6F(base, value) (CMP_RMW_C2(base, (CMP_C2_CH6F_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH7F_MASK), CMP_C2_CH6F(value)))
#define CMP_BWR_C2_CH6F(base, value) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH6F_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C2, field CH7F[23] (W1C)
 *
 * Channel 7 input changed flag. This bit is set If the channel 7 input changed
 * from the last comparison with the fixed mux port.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_CH7F field. */
#define CMP_RD_C2_CH7F(base) ((CMP_C2_REG(base) & CMP_C2_CH7F_MASK) >> CMP_C2_CH7F_SHIFT)
#define CMP_BRD_C2_CH7F(base) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH7F_SHIFT))

/*! @brief Set the CH7F field to a new value. */
#define CMP_WR_C2_CH7F(base, value) (CMP_RMW_C2(base, (CMP_C2_CH7F_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK), CMP_C2_CH7F(value)))
#define CMP_BWR_C2_CH7F(base, value) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_CH7F_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C2, field FXMXCH[27:25] (RW)
 *
 * This field indicates which channel in the mux port is fixed in a given
 * round-robin mode. If FXDACI is set, FXMXCH has no effect.
 *
 * Values:
 * - 0b000 - Channel 0 is selected as the fixed reference input for the fixed
 *     mux port.
 * - 0b001 - Channel 1 is selected as the fixed reference input for the fixed
 *     mux port.
 * - 0b010 - Channel 2 is selected as the fixed reference input for the fixed
 *     mux port.
 * - 0b011 - Channel 3 is selected as the fixed reference input for the fixed
 *     mux port.
 * - 0b100 - Channel 4 is selected as the fixed reference input for the fixed
 *     mux port.
 * - 0b101 - Channel 5 is selected as the fixed reference input for the fixed
 *     mux port.
 * - 0b110 - Channel 6 is selected as the fixed reference input for the fixed
 *     mux port.
 * - 0b111 - Channel 7 is selected as the fixed reference input for the fixed
 *     mux port.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_FXMXCH field. */
#define CMP_RD_C2_FXMXCH(base) ((CMP_C2_REG(base) & CMP_C2_FXMXCH_MASK) >> CMP_C2_FXMXCH_SHIFT)
#define CMP_BRD_C2_FXMXCH(base) (CMP_RD_C2_FXMXCH(base))

/*! @brief Set the FXMXCH field to a new value. */
#define CMP_WR_C2_FXMXCH(base, value) (CMP_RMW_C2(base, (CMP_C2_FXMXCH_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_FXMXCH(value)))
#define CMP_BWR_C2_FXMXCH(base, value) (CMP_WR_C2_FXMXCH(base, value))
/*@}*/

/*!
 * @name Register CMP_C2, field FXMP[29] (RW)
 *
 * This bit is used to fix the analog mux port for the round-robin mode.
 *
 * Values:
 * - 0b0 - The Plus port is fixed. Only the inputs to the Minus port are swept
 *     in each round.
 * - 0b1 - The Minus port is fixed. Only the inputs to the Plus port are swept
 *     in each round.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_FXMP field. */
#define CMP_RD_C2_FXMP(base) ((CMP_C2_REG(base) & CMP_C2_FXMP_MASK) >> CMP_C2_FXMP_SHIFT)
#define CMP_BRD_C2_FXMP(base) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_FXMP_SHIFT))

/*! @brief Set the FXMP field to a new value. */
#define CMP_WR_C2_FXMP(base, value) (CMP_RMW_C2(base, (CMP_C2_FXMP_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_FXMP(value)))
#define CMP_BWR_C2_FXMP(base, value) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_FXMP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C2, field RRIE[30] (RW)
 *
 * This bit enables the interrupt/wake-up when the comparison result changes for
 * a given channel.
 *
 * Values:
 * - 0b0 - The round-robin interrupt is disabled.
 * - 0b1 - The round-robin interrupt is enabled when a comparison result changes
 *     from the last sample.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_RRIE field. */
#define CMP_RD_C2_RRIE(base) ((CMP_C2_REG(base) & CMP_C2_RRIE_MASK) >> CMP_C2_RRIE_SHIFT)
#define CMP_BRD_C2_RRIE(base) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_RRIE_SHIFT))

/*! @brief Set the RRIE field to a new value. */
#define CMP_WR_C2_RRIE(base, value) (CMP_RMW_C2(base, (CMP_C2_RRIE_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_RRIE(value)))
#define CMP_BWR_C2_RRIE(base, value) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_RRIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CMP_C2, field RRE[31] (RW)
 *
 * This bit enables the round-robin operation.
 *
 * Values:
 * - 0b0 - Round-robin operation is disabled.
 * - 0b1 - Round-robin operation is enabled.
 */
/*@{*/
/*! @brief Read current value of the CMP_C2_RRE field. */
#define CMP_RD_C2_RRE(base)  ((CMP_C2_REG(base) & CMP_C2_RRE_MASK) >> CMP_C2_RRE_SHIFT)
#define CMP_BRD_C2_RRE(base) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_RRE_SHIFT))

/*! @brief Set the RRE field to a new value. */
#define CMP_WR_C2_RRE(base, value) (CMP_RMW_C2(base, (CMP_C2_RRE_MASK | CMP_C2_CH0F_MASK | CMP_C2_CH1F_MASK | CMP_C2_CH2F_MASK | CMP_C2_CH3F_MASK | CMP_C2_CH4F_MASK | CMP_C2_CH5F_MASK | CMP_C2_CH6F_MASK | CMP_C2_CH7F_MASK), CMP_C2_RRE(value)))
#define CMP_BWR_C2_RRE(base, value) (BITBAND_ACCESS32(&CMP_C2_REG(base), CMP_C2_RRE_SHIFT) = (value))
/*@}*/

