nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * S32K144 DMA
 *
 * Enhanced direct memory access controller
 *
 * Registers defined in this header file:
 * - DMA_CR - Control Register
 * - DMA_ES - Error Status Register
 * - DMA_ERQ - Enable Request Register
 * - DMA_EEI - Enable Error Interrupt Register
 * - DMA_CEEI - Clear Enable Error Interrupt Register
 * - DMA_SEEI - Set Enable Error Interrupt Register
 * - DMA_CERQ - Clear Enable Request Register
 * - DMA_SERQ - Set Enable Request Register
 * - DMA_CDNE - Clear DONE Status Bit Register
 * - DMA_SSRT - Set START Bit Register
 * - DMA_CERR - Clear Error Register
 * - DMA_CINT - Clear Interrupt Request Register
 * - DMA_INT - Interrupt Request Register
 * - DMA_ERR - Error Register
 * - DMA_HRS - Hardware Request Status Register
 * - DMA_EARS - Enable Asynchronous Request in Stop Register
 * - DMA_DCHPRI - Channel n Priority Register
 * - DMA_TCD0_SADDR - TCD Source Address
 * - DMA_TCD0_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD0_ATTR - TCD Transfer Attributes
 * - DMA_TCD0_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD0_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD0_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD0_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD0_DADDR - TCD Destination Address
 * - DMA_TCD0_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD0_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD0_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD0_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD0_CSR - TCD Control and Status
 * - DMA_TCD0_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD0_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD1_SADDR - TCD Source Address
 * - DMA_TCD1_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD1_ATTR - TCD Transfer Attributes
 * - DMA_TCD1_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD1_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD1_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD1_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD1_DADDR - TCD Destination Address
 * - DMA_TCD1_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD1_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD1_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD1_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD1_CSR - TCD Control and Status
 * - DMA_TCD1_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD1_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD2_SADDR - TCD Source Address
 * - DMA_TCD2_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD2_ATTR - TCD Transfer Attributes
 * - DMA_TCD2_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD2_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD2_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD2_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD2_DADDR - TCD Destination Address
 * - DMA_TCD2_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD2_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD2_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD2_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD2_CSR - TCD Control and Status
 * - DMA_TCD2_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD2_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD3_SADDR - TCD Source Address
 * - DMA_TCD3_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD3_ATTR - TCD Transfer Attributes
 * - DMA_TCD3_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD3_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD3_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD3_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD3_DADDR - TCD Destination Address
 * - DMA_TCD3_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD3_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD3_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD3_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD3_CSR - TCD Control and Status
 * - DMA_TCD3_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD3_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD4_SADDR - TCD Source Address
 * - DMA_TCD4_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD4_ATTR - TCD Transfer Attributes
 * - DMA_TCD4_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD4_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD4_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD4_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD4_DADDR - TCD Destination Address
 * - DMA_TCD4_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD4_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD4_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD4_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD4_CSR - TCD Control and Status
 * - DMA_TCD4_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD4_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD5_SADDR - TCD Source Address
 * - DMA_TCD5_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD5_ATTR - TCD Transfer Attributes
 * - DMA_TCD5_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD5_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD5_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD5_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD5_DADDR - TCD Destination Address
 * - DMA_TCD5_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD5_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD5_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD5_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD5_CSR - TCD Control and Status
 * - DMA_TCD5_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD5_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD6_SADDR - TCD Source Address
 * - DMA_TCD6_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD6_ATTR - TCD Transfer Attributes
 * - DMA_TCD6_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD6_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD6_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD6_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD6_DADDR - TCD Destination Address
 * - DMA_TCD6_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD6_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD6_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD6_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD6_CSR - TCD Control and Status
 * - DMA_TCD6_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD6_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD7_SADDR - TCD Source Address
 * - DMA_TCD7_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD7_ATTR - TCD Transfer Attributes
 * - DMA_TCD7_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD7_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD7_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD7_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD7_DADDR - TCD Destination Address
 * - DMA_TCD7_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD7_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD7_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD7_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD7_CSR - TCD Control and Status
 * - DMA_TCD7_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD7_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD8_SADDR - TCD Source Address
 * - DMA_TCD8_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD8_ATTR - TCD Transfer Attributes
 * - DMA_TCD8_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD8_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD8_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD8_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD8_DADDR - TCD Destination Address
 * - DMA_TCD8_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD8_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD8_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD8_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD8_CSR - TCD Control and Status
 * - DMA_TCD8_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD8_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD9_SADDR - TCD Source Address
 * - DMA_TCD9_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD9_ATTR - TCD Transfer Attributes
 * - DMA_TCD9_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD9_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD9_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD9_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD9_DADDR - TCD Destination Address
 * - DMA_TCD9_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD9_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD9_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD9_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD9_CSR - TCD Control and Status
 * - DMA_TCD9_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD9_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD10_SADDR - TCD Source Address
 * - DMA_TCD10_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD10_ATTR - TCD Transfer Attributes
 * - DMA_TCD10_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD10_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD10_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD10_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD10_DADDR - TCD Destination Address
 * - DMA_TCD10_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD10_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD10_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD10_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD10_CSR - TCD Control and Status
 * - DMA_TCD10_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD10_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD11_SADDR - TCD Source Address
 * - DMA_TCD11_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD11_ATTR - TCD Transfer Attributes
 * - DMA_TCD11_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD11_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD11_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD11_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD11_DADDR - TCD Destination Address
 * - DMA_TCD11_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD11_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD11_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD11_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD11_CSR - TCD Control and Status
 * - DMA_TCD11_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD11_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD12_SADDR - TCD Source Address
 * - DMA_TCD12_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD12_ATTR - TCD Transfer Attributes
 * - DMA_TCD12_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD12_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD12_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD12_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD12_DADDR - TCD Destination Address
 * - DMA_TCD12_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD12_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD12_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD12_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD12_CSR - TCD Control and Status
 * - DMA_TCD12_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD12_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD13_SADDR - TCD Source Address
 * - DMA_TCD13_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD13_ATTR - TCD Transfer Attributes
 * - DMA_TCD13_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD13_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD13_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD13_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD13_DADDR - TCD Destination Address
 * - DMA_TCD13_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD13_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD13_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD13_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD13_CSR - TCD Control and Status
 * - DMA_TCD13_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD13_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD14_SADDR - TCD Source Address
 * - DMA_TCD14_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD14_ATTR - TCD Transfer Attributes
 * - DMA_TCD14_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD14_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD14_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD14_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD14_DADDR - TCD Destination Address
 * - DMA_TCD14_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD14_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD14_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD14_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD14_CSR - TCD Control and Status
 * - DMA_TCD14_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD14_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD15_SADDR - TCD Source Address
 * - DMA_TCD15_SOFF - TCD Signed Source Address Offset
 * - DMA_TCD15_ATTR - TCD Transfer Attributes
 * - DMA_TCD15_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Mapping Disabled)
 * - DMA_TCD15_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)
 * - DMA_TCD15_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 * - DMA_TCD15_SLAST - TCD Last Source Address Adjustment
 * - DMA_TCD15_DADDR - TCD Destination Address
 * - DMA_TCD15_DOFF - TCD Signed Destination Address Offset
 * - DMA_TCD15_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD15_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_TCD15_DLASTSGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_TCD15_CSR - TCD Control and Status
 * - DMA_TCD15_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_TCD15_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 */

#define DMA_INSTANCE_COUNT (1U) /*!< Number of instances of the DMA module. */
#define DMA_IDX (0U) /*!< Instance number for DMA. */

