nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual DMA_DCHPRI bitfields
 */

/*!
 * @name Register DMA_DCHPRI, field CHPRI[3:0] (RW)
 *
 * Channel priority when fixed-priority arbitration is enabled Reset value for
 * the channel priority field, CHPRI, is equal to the corresponding channel number
 * for each priority register, that is, DCHPRI15[CHPRI] = 0b1111.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI_CHPRI field. */
#define DMA_RD_DCHPRI_CHPRI(base, index) ((DMA_DCHPRI_REG(base, index) & DMA_DCHPRI_CHPRI_MASK) >> DMA_DCHPRI_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI_CHPRI(base, index) (DMA_RD_DCHPRI_CHPRI(base, index))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI_CHPRI(base, index, value) (DMA_RMW_DCHPRI(base, index, DMA_DCHPRI_CHPRI_MASK, DMA_DCHPRI_CHPRI(value)))
#define DMA_BWR_DCHPRI_CHPRI(base, index, value) (DMA_WR_DCHPRI_CHPRI(base, index, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI, field DPA[6] (RW)
 *
 * Values:
 * - 0b0 - Channel n can suspend a lower priority channel.
 * - 0b1 - Channel n cannot suspend any channel, regardless of channel priority.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI_DPA field. */
#define DMA_RD_DCHPRI_DPA(base, index) ((DMA_DCHPRI_REG(base, index) & DMA_DCHPRI_DPA_MASK) >> DMA_DCHPRI_DPA_SHIFT)
#define DMA_BRD_DCHPRI_DPA(base, index) (BITBAND_ACCESS8(&DMA_DCHPRI_REG(base, index), DMA_DCHPRI_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI_DPA(base, index, value) (DMA_RMW_DCHPRI(base, index, DMA_DCHPRI_DPA_MASK, DMA_DCHPRI_DPA(value)))
#define DMA_BWR_DCHPRI_DPA(base, index, value) (BITBAND_ACCESS8(&DMA_DCHPRI_REG(base, index), DMA_DCHPRI_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI, field ECP[7] (RW)
 *
 * Values:
 * - 0b0 - Channel n cannot be suspended by a higher priority channel's service
 *     request.
 * - 0b1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel.
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI_ECP field. */
#define DMA_RD_DCHPRI_ECP(base, index) ((DMA_DCHPRI_REG(base, index) & DMA_DCHPRI_ECP_MASK) >> DMA_DCHPRI_ECP_SHIFT)
#define DMA_BRD_DCHPRI_ECP(base, index) (BITBAND_ACCESS8(&DMA_DCHPRI_REG(base, index), DMA_DCHPRI_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI_ECP(base, index, value) (DMA_RMW_DCHPRI(base, index, DMA_DCHPRI_ECP_MASK, DMA_DCHPRI_ECP(value)))
#define DMA_BWR_DCHPRI_ECP(base, index, value) (BITBAND_ACCESS8(&DMA_DCHPRI_REG(base, index), DMA_DCHPRI_ECP_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_TCD0_SADDR - TCD Source Address
 ******************************************************************************/

/*!
 * @brief DMA_TCD0_SADDR - TCD Source Address (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD0_SADDR register
 */
/*@{*/
#define DMA_RD_TCD0_SADDR(base)  (DMA_TCD0_SADDR_REG(base))
#define DMA_WR_TCD0_SADDR(base, value) (DMA_TCD0_SADDR_REG(base) = (value))
#define DMA_RMW_TCD0_SADDR(base, mask, value) (DMA_WR_TCD0_SADDR(base, (DMA_RD_TCD0_SADDR(base) & ~(mask)) | (value)))
#define DMA_SET_TCD0_SADDR(base, value) (DMA_WR_TCD0_SADDR(base, DMA_RD_TCD0_SADDR(base) |  (value)))
#define DMA_CLR_TCD0_SADDR(base, value) (DMA_WR_TCD0_SADDR(base, DMA_RD_TCD0_SADDR(base) & ~(value)))
#define DMA_TOG_TCD0_SADDR(base, value) (DMA_WR_TCD0_SADDR(base, DMA_RD_TCD0_SADDR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD0_SOFF - TCD Signed Source Address Offset
 ******************************************************************************/

/*!
 * @brief DMA_TCD0_SOFF - TCD Signed Source Address Offset (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD0_SOFF register
 */
/*@{*/
#define DMA_RD_TCD0_SOFF(base)   (DMA_TCD0_SOFF_REG(base))
#define DMA_WR_TCD0_SOFF(base, value) (DMA_TCD0_SOFF_REG(base) = (value))
#define DMA_RMW_TCD0_SOFF(base, mask, value) (DMA_WR_TCD0_SOFF(base, (DMA_RD_TCD0_SOFF(base) & ~(mask)) | (value)))
#define DMA_SET_TCD0_SOFF(base, value) (DMA_WR_TCD0_SOFF(base, DMA_RD_TCD0_SOFF(base) |  (value)))
#define DMA_CLR_TCD0_SOFF(base, value) (DMA_WR_TCD0_SOFF(base, DMA_RD_TCD0_SOFF(base) & ~(value)))
#define DMA_TOG_TCD0_SOFF(base, value) (DMA_WR_TCD0_SOFF(base, DMA_RD_TCD0_SOFF(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD0_ATTR - TCD Transfer Attributes
 ******************************************************************************/

/*!
 * @brief DMA_TCD0_ATTR - TCD Transfer Attributes (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD0_ATTR register
 */
/*@{*/
#define DMA_RD_TCD0_ATTR(base)   (DMA_TCD0_ATTR_REG(base))
#define DMA_WR_TCD0_ATTR(base, value) (DMA_TCD0_ATTR_REG(base) = (value))
#define DMA_RMW_TCD0_ATTR(base, mask, value) (DMA_WR_TCD0_ATTR(base, (DMA_RD_TCD0_ATTR(base) & ~(mask)) | (value)))
#define DMA_SET_TCD0_ATTR(base, value) (DMA_WR_TCD0_ATTR(base, DMA_RD_TCD0_ATTR(base) |  (value)))
#define DMA_CLR_TCD0_ATTR(base, value) (DMA_WR_TCD0_ATTR(base, DMA_RD_TCD0_ATTR(base) & ~(value)))
#define DMA_TOG_TCD0_ATTR(base, value) (DMA_WR_TCD0_ATTR(base, DMA_RD_TCD0_ATTR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_TCD0_ATTR bitfields
 */

/*!
 * @name Register DMA_TCD0_ATTR, field DSIZE[2:0] (RW)
 *
 * See the SSIZE definition
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD0_ATTR_DSIZE field. */
#define DMA_RD_TCD0_ATTR_DSIZE(base) ((DMA_TCD0_ATTR_REG(base) & DMA_TCD0_ATTR_DSIZE_MASK) >> DMA_TCD0_ATTR_DSIZE_SHIFT)
#define DMA_BRD_TCD0_ATTR_DSIZE(base) (DMA_RD_TCD0_ATTR_DSIZE(base))

/*! @brief Set the DSIZE field to a new value. */
#define DMA_WR_TCD0_ATTR_DSIZE(base, value) (DMA_RMW_TCD0_ATTR(base, DMA_TCD0_ATTR_DSIZE_MASK, DMA_TCD0_ATTR_DSIZE(value)))
#define DMA_BWR_TCD0_ATTR_DSIZE(base, value) (DMA_WR_TCD0_ATTR_DSIZE(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD0_ATTR, field DMOD[7:3] (RW)
 *
 * See the SMOD definition
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD0_ATTR_DMOD field. */
#define DMA_RD_TCD0_ATTR_DMOD(base) ((DMA_TCD0_ATTR_REG(base) & DMA_TCD0_ATTR_DMOD_MASK) >> DMA_TCD0_ATTR_DMOD_SHIFT)
#define DMA_BRD_TCD0_ATTR_DMOD(base) (DMA_RD_TCD0_ATTR_DMOD(base))

/*! @brief Set the DMOD field to a new value. */
#define DMA_WR_TCD0_ATTR_DMOD(base, value) (DMA_RMW_TCD0_ATTR(base, DMA_TCD0_ATTR_DMOD_MASK, DMA_TCD0_ATTR_DMOD(value)))
#define DMA_BWR_TCD0_ATTR_DMOD(base, value) (DMA_WR_TCD0_ATTR_DMOD(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD0_ATTR, field SSIZE[10:8] (RW)
 *
 * Using a Reserved value causes a configuration error.
 *
 * Values:
 * - 0b000 - 8-bit
 * - 0b001 - 16-bit
 * - 0b010 - 32-bit
 * - 0b011 - Reserved
 * - 0b100 - 16-byte burst
 * - 0b101 - 32-byte burst
 * - 0b110 - Reserved
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD0_ATTR_SSIZE field. */
#define DMA_RD_TCD0_ATTR_SSIZE(base) ((DMA_TCD0_ATTR_REG(base) & DMA_TCD0_ATTR_SSIZE_MASK) >> DMA_TCD0_ATTR_SSIZE_SHIFT)
#define DMA_BRD_TCD0_ATTR_SSIZE(base) (DMA_RD_TCD0_ATTR_SSIZE(base))

/*! @brief Set the SSIZE field to a new value. */
#define DMA_WR_TCD0_ATTR_SSIZE(base, value) (DMA_RMW_TCD0_ATTR(base, DMA_TCD0_ATTR_SSIZE_MASK, DMA_TCD0_ATTR_SSIZE(value)))
#define DMA_BWR_TCD0_ATTR_SSIZE(base, value) (DMA_WR_TCD0_ATTR_SSIZE(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD0_ATTR, field SMOD[15:11] (RW)
 *
 * Values:
 * - 0b00000 - Source address modulo feature is disabled
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD0_ATTR_SMOD field. */
#define DMA_RD_TCD0_ATTR_SMOD(base) ((DMA_TCD0_ATTR_REG(base) & DMA_TCD0_ATTR_SMOD_MASK) >> DMA_TCD0_ATTR_SMOD_SHIFT)
#define DMA_BRD_TCD0_ATTR_SMOD(base) (DMA_RD_TCD0_ATTR_SMOD(base))

/*! @brief Set the SMOD field to a new value. */
#define DMA_WR_TCD0_ATTR_SMOD(base, value) (DMA_RMW_TCD0_ATTR(base, DMA_TCD0_ATTR_SMOD_MASK, DMA_TCD0_ATTR_SMOD(value)))
#define DMA_BWR_TCD0_ATTR_SMOD(base, value) (DMA_WR_TCD0_ATTR_SMOD(base, value))
/*@}*/

