nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the ELINK field to a new value. */
#define DMA_WR_TCD5_BITER_ELINKYES_ELINK(base, value) (DMA_RMW_TCD5_BITER_ELINKYES(base, DMA_TCD5_BITER_ELINKYES_ELINK_MASK, DMA_TCD5_BITER_ELINKYES_ELINK(value)))
#define DMA_BWR_TCD5_BITER_ELINKYES_ELINK(base, value) (BITBAND_ACCESS16(&DMA_TCD5_BITER_ELINKYES_REG(base), DMA_TCD5_BITER_ELINKYES_ELINK_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_TCD5_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 ******************************************************************************/

/*!
 * @brief DMA_TCD5_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled) (RW)
 *
 * Reset value: 0x0000U
 *
 * If the TCDn_BITER[ELINK] bit is cleared, the TCDn_BITER register is defined
 * as follows.
 */
/*!
 * @name Constants and macros for entire DMA_TCD5_BITER_ELINKNO register
 */
/*@{*/
#define DMA_RD_TCD5_BITER_ELINKNO(base) (DMA_TCD5_BITER_ELINKNO_REG(base))
#define DMA_WR_TCD5_BITER_ELINKNO(base, value) (DMA_TCD5_BITER_ELINKNO_REG(base) = (value))
#define DMA_RMW_TCD5_BITER_ELINKNO(base, mask, value) (DMA_WR_TCD5_BITER_ELINKNO(base, (DMA_RD_TCD5_BITER_ELINKNO(base) & ~(mask)) | (value)))
#define DMA_SET_TCD5_BITER_ELINKNO(base, value) (DMA_WR_TCD5_BITER_ELINKNO(base, DMA_RD_TCD5_BITER_ELINKNO(base) |  (value)))
#define DMA_CLR_TCD5_BITER_ELINKNO(base, value) (DMA_WR_TCD5_BITER_ELINKNO(base, DMA_RD_TCD5_BITER_ELINKNO(base) & ~(value)))
#define DMA_TOG_TCD5_BITER_ELINKNO(base, value) (DMA_WR_TCD5_BITER_ELINKNO(base, DMA_RD_TCD5_BITER_ELINKNO(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_TCD5_BITER_ELINKNO bitfields
 */

/*!
 * @name Register DMA_TCD5_BITER_ELINKNO, field BITER[14:0] (RW)
 *
 * As the transfer control descriptor is first loaded by software, this 9-bit
 * (ELINK = 1) or 15-bit (ELINK = 0) field must be equal to the value in the CITER
 * field. As the major iteration count is exhausted, the contents of this field
 * are reloaded into the CITER field. When the software loads the TCD, this field
 * must be set equal to the corresponding CITER field; otherwise, a configuration
 * error is reported. As the major iteration count is exhausted, the contents of
 * this field is reloaded into the CITER field. If the channel is configured to
 * execute a single service request, the initial values of BITER and CITER should
 * be 0x0001.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD5_BITER_ELINKNO_BITER field. */
#define DMA_RD_TCD5_BITER_ELINKNO_BITER(base) ((DMA_TCD5_BITER_ELINKNO_REG(base) & DMA_TCD5_BITER_ELINKNO_BITER_MASK) >> DMA_TCD5_BITER_ELINKNO_BITER_SHIFT)
#define DMA_BRD_TCD5_BITER_ELINKNO_BITER(base) (DMA_RD_TCD5_BITER_ELINKNO_BITER(base))

/*! @brief Set the BITER field to a new value. */
#define DMA_WR_TCD5_BITER_ELINKNO_BITER(base, value) (DMA_RMW_TCD5_BITER_ELINKNO(base, DMA_TCD5_BITER_ELINKNO_BITER_MASK, DMA_TCD5_BITER_ELINKNO_BITER(value)))
#define DMA_BWR_TCD5_BITER_ELINKNO_BITER(base, value) (DMA_WR_TCD5_BITER_ELINKNO_BITER(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD5_BITER_ELINKNO, field ELINK[15] (RW)
 *
 * As the channel completes the minor loop, this flag enables the linking to
 * another channel, defined by BITER[LINKCH]. The link target channel initiates a
 * channel service request via an internal mechanism that sets the TCDn_CSR[START]
 * bit of the specified channel. If channel linking is disabled, the BITER value
 * extends to 15 bits in place of a link channel number. If the major loop is
 * exhausted, this link mechanism is suppressed in favor of the MAJORELINK channel
 * linking. When the software loads the TCD, this field must be set equal to the
 * corresponding CITER field; otherwise, a configuration error is reported. As the
 * major iteration count is exhausted, the contents of this field are reloaded
 * into the CITER field.
 *
 * Values:
 * - 0b0 - The channel-to-channel linking is disabled
 * - 0b1 - The channel-to-channel linking is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD5_BITER_ELINKNO_ELINK field. */
#define DMA_RD_TCD5_BITER_ELINKNO_ELINK(base) ((DMA_TCD5_BITER_ELINKNO_REG(base) & DMA_TCD5_BITER_ELINKNO_ELINK_MASK) >> DMA_TCD5_BITER_ELINKNO_ELINK_SHIFT)
#define DMA_BRD_TCD5_BITER_ELINKNO_ELINK(base) (BITBAND_ACCESS16(&DMA_TCD5_BITER_ELINKNO_REG(base), DMA_TCD5_BITER_ELINKNO_ELINK_SHIFT))

/*! @brief Set the ELINK field to a new value. */
#define DMA_WR_TCD5_BITER_ELINKNO_ELINK(base, value) (DMA_RMW_TCD5_BITER_ELINKNO(base, DMA_TCD5_BITER_ELINKNO_ELINK_MASK, DMA_TCD5_BITER_ELINKNO_ELINK(value)))
#define DMA_BWR_TCD5_BITER_ELINKNO_ELINK(base, value) (BITBAND_ACCESS16(&DMA_TCD5_BITER_ELINKNO_REG(base), DMA_TCD5_BITER_ELINKNO_ELINK_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_TCD6_SADDR - TCD Source Address
 ******************************************************************************/

/*!
 * @brief DMA_TCD6_SADDR - TCD Source Address (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD6_SADDR register
 */
/*@{*/
#define DMA_RD_TCD6_SADDR(base)  (DMA_TCD6_SADDR_REG(base))
#define DMA_WR_TCD6_SADDR(base, value) (DMA_TCD6_SADDR_REG(base) = (value))
#define DMA_RMW_TCD6_SADDR(base, mask, value) (DMA_WR_TCD6_SADDR(base, (DMA_RD_TCD6_SADDR(base) & ~(mask)) | (value)))
#define DMA_SET_TCD6_SADDR(base, value) (DMA_WR_TCD6_SADDR(base, DMA_RD_TCD6_SADDR(base) |  (value)))
#define DMA_CLR_TCD6_SADDR(base, value) (DMA_WR_TCD6_SADDR(base, DMA_RD_TCD6_SADDR(base) & ~(value)))
#define DMA_TOG_TCD6_SADDR(base, value) (DMA_WR_TCD6_SADDR(base, DMA_RD_TCD6_SADDR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD6_SOFF - TCD Signed Source Address Offset
 ******************************************************************************/

/*!
 * @brief DMA_TCD6_SOFF - TCD Signed Source Address Offset (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD6_SOFF register
 */
/*@{*/
#define DMA_RD_TCD6_SOFF(base)   (DMA_TCD6_SOFF_REG(base))
#define DMA_WR_TCD6_SOFF(base, value) (DMA_TCD6_SOFF_REG(base) = (value))
#define DMA_RMW_TCD6_SOFF(base, mask, value) (DMA_WR_TCD6_SOFF(base, (DMA_RD_TCD6_SOFF(base) & ~(mask)) | (value)))
#define DMA_SET_TCD6_SOFF(base, value) (DMA_WR_TCD6_SOFF(base, DMA_RD_TCD6_SOFF(base) |  (value)))
#define DMA_CLR_TCD6_SOFF(base, value) (DMA_WR_TCD6_SOFF(base, DMA_RD_TCD6_SOFF(base) & ~(value)))
#define DMA_TOG_TCD6_SOFF(base, value) (DMA_WR_TCD6_SOFF(base, DMA_RD_TCD6_SOFF(base) ^  (value)))
/*@}*/

