nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * DMA_TCD6_ATTR - TCD Transfer Attributes
 ******************************************************************************/

/*!
 * @brief DMA_TCD6_ATTR - TCD Transfer Attributes (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD6_ATTR register
 */
/*@{*/
#define DMA_RD_TCD6_ATTR(base)   (DMA_TCD6_ATTR_REG(base))
#define DMA_WR_TCD6_ATTR(base, value) (DMA_TCD6_ATTR_REG(base) = (value))
#define DMA_RMW_TCD6_ATTR(base, mask, value) (DMA_WR_TCD6_ATTR(base, (DMA_RD_TCD6_ATTR(base) & ~(mask)) | (value)))
#define DMA_SET_TCD6_ATTR(base, value) (DMA_WR_TCD6_ATTR(base, DMA_RD_TCD6_ATTR(base) |  (value)))
#define DMA_CLR_TCD6_ATTR(base, value) (DMA_WR_TCD6_ATTR(base, DMA_RD_TCD6_ATTR(base) & ~(value)))
#define DMA_TOG_TCD6_ATTR(base, value) (DMA_WR_TCD6_ATTR(base, DMA_RD_TCD6_ATTR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_TCD6_ATTR bitfields
 */

/*!
 * @name Register DMA_TCD6_ATTR, field DSIZE[2:0] (RW)
 *
 * See the SSIZE definition
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD6_ATTR_DSIZE field. */
#define DMA_RD_TCD6_ATTR_DSIZE(base) ((DMA_TCD6_ATTR_REG(base) & DMA_TCD6_ATTR_DSIZE_MASK) >> DMA_TCD6_ATTR_DSIZE_SHIFT)
#define DMA_BRD_TCD6_ATTR_DSIZE(base) (DMA_RD_TCD6_ATTR_DSIZE(base))

/*! @brief Set the DSIZE field to a new value. */
#define DMA_WR_TCD6_ATTR_DSIZE(base, value) (DMA_RMW_TCD6_ATTR(base, DMA_TCD6_ATTR_DSIZE_MASK, DMA_TCD6_ATTR_DSIZE(value)))
#define DMA_BWR_TCD6_ATTR_DSIZE(base, value) (DMA_WR_TCD6_ATTR_DSIZE(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD6_ATTR, field DMOD[7:3] (RW)
 *
 * See the SMOD definition
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD6_ATTR_DMOD field. */
#define DMA_RD_TCD6_ATTR_DMOD(base) ((DMA_TCD6_ATTR_REG(base) & DMA_TCD6_ATTR_DMOD_MASK) >> DMA_TCD6_ATTR_DMOD_SHIFT)
#define DMA_BRD_TCD6_ATTR_DMOD(base) (DMA_RD_TCD6_ATTR_DMOD(base))

/*! @brief Set the DMOD field to a new value. */
#define DMA_WR_TCD6_ATTR_DMOD(base, value) (DMA_RMW_TCD6_ATTR(base, DMA_TCD6_ATTR_DMOD_MASK, DMA_TCD6_ATTR_DMOD(value)))
#define DMA_BWR_TCD6_ATTR_DMOD(base, value) (DMA_WR_TCD6_ATTR_DMOD(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD6_ATTR, field SSIZE[10:8] (RW)
 *
 * Using a Reserved value causes a configuration error.
 *
 * Values:
 * - 0b000 - 8-bit
 * - 0b001 - 16-bit
 * - 0b010 - 32-bit
 * - 0b011 - Reserved
 * - 0b100 - 16-byte burst
 * - 0b101 - 32-byte burst
 * - 0b110 - Reserved
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD6_ATTR_SSIZE field. */
#define DMA_RD_TCD6_ATTR_SSIZE(base) ((DMA_TCD6_ATTR_REG(base) & DMA_TCD6_ATTR_SSIZE_MASK) >> DMA_TCD6_ATTR_SSIZE_SHIFT)
#define DMA_BRD_TCD6_ATTR_SSIZE(base) (DMA_RD_TCD6_ATTR_SSIZE(base))

/*! @brief Set the SSIZE field to a new value. */
#define DMA_WR_TCD6_ATTR_SSIZE(base, value) (DMA_RMW_TCD6_ATTR(base, DMA_TCD6_ATTR_SSIZE_MASK, DMA_TCD6_ATTR_SSIZE(value)))
#define DMA_BWR_TCD6_ATTR_SSIZE(base, value) (DMA_WR_TCD6_ATTR_SSIZE(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD6_ATTR, field SMOD[15:11] (RW)
 *
 * Values:
 * - 0b00000 - Source address modulo feature is disabled
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD6_ATTR_SMOD field. */
#define DMA_RD_TCD6_ATTR_SMOD(base) ((DMA_TCD6_ATTR_REG(base) & DMA_TCD6_ATTR_SMOD_MASK) >> DMA_TCD6_ATTR_SMOD_SHIFT)
#define DMA_BRD_TCD6_ATTR_SMOD(base) (DMA_RD_TCD6_ATTR_SMOD(base))

/*! @brief Set the SMOD field to a new value. */
#define DMA_WR_TCD6_ATTR_SMOD(base, value) (DMA_RMW_TCD6_ATTR(base, DMA_TCD6_ATTR_SMOD_MASK, DMA_TCD6_ATTR_SMOD(value)))
#define DMA_BWR_TCD6_ATTR_SMOD(base, value) (DMA_WR_TCD6_ATTR_SMOD(base, value))
/*@}*/

/*******************************************************************************
 * DMA_TCD6_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 ******************************************************************************/

/*!
 * @brief DMA_TCD6_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled) (RW)
 *
 * Reset value: 0x00000000U
 *
 * One of three registers (this register, TCD_NBYTES_MLNO, or
 * TCD_NBYTES_MLOFFNO), defines the number of bytes to transfer per request. Which register to use
 * depends on whether minor loop mapping is disabled, enabled but not used for
 * this channel, or enabled and used. TCD word 2 is defined as follows if: Minor
 * loop mapping is enabled (CR[EMLM] = 1) and Minor loop offset is enabled (SMLOE
 * or DMLOE = 1) If minor loop mapping is enabled and SMLOE and DMLOE are cleared,
 * then refer to the TCD_NBYTES_MLOFFNO register description. If minor loop
 * mapping is disabled, then refer to the TCD_NBYTES_MLNO register description.
 */
/*!
 * @name Constants and macros for entire DMA_TCD6_NBYTES_MLOFFYES register
 */
/*@{*/
#define DMA_RD_TCD6_NBYTES_MLOFFYES(base) (DMA_TCD6_NBYTES_MLOFFYES_REG(base))
#define DMA_WR_TCD6_NBYTES_MLOFFYES(base, value) (DMA_TCD6_NBYTES_MLOFFYES_REG(base) = (value))
#define DMA_RMW_TCD6_NBYTES_MLOFFYES(base, mask, value) (DMA_WR_TCD6_NBYTES_MLOFFYES(base, (DMA_RD_TCD6_NBYTES_MLOFFYES(base) & ~(mask)) | (value)))
#define DMA_SET_TCD6_NBYTES_MLOFFYES(base, value) (DMA_WR_TCD6_NBYTES_MLOFFYES(base, DMA_RD_TCD6_NBYTES_MLOFFYES(base) |  (value)))
#define DMA_CLR_TCD6_NBYTES_MLOFFYES(base, value) (DMA_WR_TCD6_NBYTES_MLOFFYES(base, DMA_RD_TCD6_NBYTES_MLOFFYES(base) & ~(value)))
#define DMA_TOG_TCD6_NBYTES_MLOFFYES(base, value) (DMA_WR_TCD6_NBYTES_MLOFFYES(base, DMA_RD_TCD6_NBYTES_MLOFFYES(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_TCD6_NBYTES_MLOFFYES bitfields
 */

/*!
 * @name Register DMA_TCD6_NBYTES_MLOFFYES, field NBYTES[9:0] (RW)
 *
 * Number of bytes to be transferred in each service request of the channel. As
 * a channel activates, the appropriate TCD contents load into the eDMA engine,
 * and the appropriate reads and writes perform until the minor byte transfer
 * count has transferred. This is an indivisible operation and cannot be halted. It
 * can, however, be stalled by using the bandwidth control field, or via
 * preemption. After the minor count is exhausted, the SADDR and DADDR values are written
 * back into the TCD memory, the major iteration count is decremented and
 * restored to the TCD memory. If the major iteration count is completed, additional
 * processing is performed.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD6_NBYTES_MLOFFYES_NBYTES field. */
#define DMA_RD_TCD6_NBYTES_MLOFFYES_NBYTES(base) ((DMA_TCD6_NBYTES_MLOFFYES_REG(base) & DMA_TCD6_NBYTES_MLOFFYES_NBYTES_MASK) >> DMA_TCD6_NBYTES_MLOFFYES_NBYTES_SHIFT)
#define DMA_BRD_TCD6_NBYTES_MLOFFYES_NBYTES(base) (DMA_RD_TCD6_NBYTES_MLOFFYES_NBYTES(base))

/*! @brief Set the NBYTES field to a new value. */
#define DMA_WR_TCD6_NBYTES_MLOFFYES_NBYTES(base, value) (DMA_RMW_TCD6_NBYTES_MLOFFYES(base, DMA_TCD6_NBYTES_MLOFFYES_NBYTES_MASK, DMA_TCD6_NBYTES_MLOFFYES_NBYTES(value)))
#define DMA_BWR_TCD6_NBYTES_MLOFFYES_NBYTES(base, value) (DMA_WR_TCD6_NBYTES_MLOFFYES_NBYTES(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD6_NBYTES_MLOFFYES, field MLOFF[29:10] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD6_NBYTES_MLOFFYES_MLOFF field. */
#define DMA_RD_TCD6_NBYTES_MLOFFYES_MLOFF(base) ((DMA_TCD6_NBYTES_MLOFFYES_REG(base) & DMA_TCD6_NBYTES_MLOFFYES_MLOFF_MASK) >> DMA_TCD6_NBYTES_MLOFFYES_MLOFF_SHIFT)
#define DMA_BRD_TCD6_NBYTES_MLOFFYES_MLOFF(base) (DMA_RD_TCD6_NBYTES_MLOFFYES_MLOFF(base))

