nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * DMA_TCD7_SLAST - TCD Last Source Address Adjustment
 ******************************************************************************/

/*!
 * @brief DMA_TCD7_SLAST - TCD Last Source Address Adjustment (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD7_SLAST register
 */
/*@{*/
#define DMA_RD_TCD7_SLAST(base)  (DMA_TCD7_SLAST_REG(base))
#define DMA_WR_TCD7_SLAST(base, value) (DMA_TCD7_SLAST_REG(base) = (value))
#define DMA_RMW_TCD7_SLAST(base, mask, value) (DMA_WR_TCD7_SLAST(base, (DMA_RD_TCD7_SLAST(base) & ~(mask)) | (value)))
#define DMA_SET_TCD7_SLAST(base, value) (DMA_WR_TCD7_SLAST(base, DMA_RD_TCD7_SLAST(base) |  (value)))
#define DMA_CLR_TCD7_SLAST(base, value) (DMA_WR_TCD7_SLAST(base, DMA_RD_TCD7_SLAST(base) & ~(value)))
#define DMA_TOG_TCD7_SLAST(base, value) (DMA_WR_TCD7_SLAST(base, DMA_RD_TCD7_SLAST(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD7_DADDR - TCD Destination Address
 ******************************************************************************/

/*!
 * @brief DMA_TCD7_DADDR - TCD Destination Address (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD7_DADDR register
 */
/*@{*/
#define DMA_RD_TCD7_DADDR(base)  (DMA_TCD7_DADDR_REG(base))
#define DMA_WR_TCD7_DADDR(base, value) (DMA_TCD7_DADDR_REG(base) = (value))
#define DMA_RMW_TCD7_DADDR(base, mask, value) (DMA_WR_TCD7_DADDR(base, (DMA_RD_TCD7_DADDR(base) & ~(mask)) | (value)))
#define DMA_SET_TCD7_DADDR(base, value) (DMA_WR_TCD7_DADDR(base, DMA_RD_TCD7_DADDR(base) |  (value)))
#define DMA_CLR_TCD7_DADDR(base, value) (DMA_WR_TCD7_DADDR(base, DMA_RD_TCD7_DADDR(base) & ~(value)))
#define DMA_TOG_TCD7_DADDR(base, value) (DMA_WR_TCD7_DADDR(base, DMA_RD_TCD7_DADDR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD7_DOFF - TCD Signed Destination Address Offset
 ******************************************************************************/

/*!
 * @brief DMA_TCD7_DOFF - TCD Signed Destination Address Offset (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD7_DOFF register
 */
/*@{*/
#define DMA_RD_TCD7_DOFF(base)   (DMA_TCD7_DOFF_REG(base))
#define DMA_WR_TCD7_DOFF(base, value) (DMA_TCD7_DOFF_REG(base) = (value))
#define DMA_RMW_TCD7_DOFF(base, mask, value) (DMA_WR_TCD7_DOFF(base, (DMA_RD_TCD7_DOFF(base) & ~(mask)) | (value)))
#define DMA_SET_TCD7_DOFF(base, value) (DMA_WR_TCD7_DOFF(base, DMA_RD_TCD7_DOFF(base) |  (value)))
#define DMA_CLR_TCD7_DOFF(base, value) (DMA_WR_TCD7_DOFF(base, DMA_RD_TCD7_DOFF(base) & ~(value)))
#define DMA_TOG_TCD7_DOFF(base, value) (DMA_WR_TCD7_DOFF(base, DMA_RD_TCD7_DOFF(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD7_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 ******************************************************************************/

/*!
 * @brief DMA_TCD7_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled) (RW)
 *
 * Reset value: 0x0000U
 *
 * If TCDn_CITER[ELINK] is set, the TCDn_CITER register is defined as follows.
 */
/*!
 * @name Constants and macros for entire DMA_TCD7_CITER_ELINKYES register
 */
/*@{*/
#define DMA_RD_TCD7_CITER_ELINKYES(base) (DMA_TCD7_CITER_ELINKYES_REG(base))
#define DMA_WR_TCD7_CITER_ELINKYES(base, value) (DMA_TCD7_CITER_ELINKYES_REG(base) = (value))
#define DMA_RMW_TCD7_CITER_ELINKYES(base, mask, value) (DMA_WR_TCD7_CITER_ELINKYES(base, (DMA_RD_TCD7_CITER_ELINKYES(base) & ~(mask)) | (value)))
#define DMA_SET_TCD7_CITER_ELINKYES(base, value) (DMA_WR_TCD7_CITER_ELINKYES(base, DMA_RD_TCD7_CITER_ELINKYES(base) |  (value)))
#define DMA_CLR_TCD7_CITER_ELINKYES(base, value) (DMA_WR_TCD7_CITER_ELINKYES(base, DMA_RD_TCD7_CITER_ELINKYES(base) & ~(value)))
#define DMA_TOG_TCD7_CITER_ELINKYES(base, value) (DMA_WR_TCD7_CITER_ELINKYES(base, DMA_RD_TCD7_CITER_ELINKYES(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_TCD7_CITER_ELINKYES bitfields
 */

/*!
 * @name Register DMA_TCD7_CITER_ELINKYES, field CITER[8:0] (RW)
 *
 * This 9-bit (ELINK = 1) or 15-bit (ELINK = 0) count represents the current
 * major loop count for the channel. It is decremented each time the minor loop is
 * completed and updated in the transfer control descriptor memory. After the
 * major iteration count is exhausted, the channel performs a number of operations,
 * for example, final source and destination address calculations, optionally
 * generating an interrupt to signal channel completion before reloading the CITER
 * field from the Beginning Iteration Count (BITER) field. When the CITER field is
 * initially loaded by software, it must be set to the same value as that
 * contained in the BITER field. If the channel is configured to execute a single
 * service request, the initial values of BITER and CITER should be 0x0001.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD7_CITER_ELINKYES_CITER field. */
#define DMA_RD_TCD7_CITER_ELINKYES_CITER(base) ((DMA_TCD7_CITER_ELINKYES_REG(base) & DMA_TCD7_CITER_ELINKYES_CITER_MASK) >> DMA_TCD7_CITER_ELINKYES_CITER_SHIFT)
#define DMA_BRD_TCD7_CITER_ELINKYES_CITER(base) (DMA_RD_TCD7_CITER_ELINKYES_CITER(base))

/*! @brief Set the CITER field to a new value. */
#define DMA_WR_TCD7_CITER_ELINKYES_CITER(base, value) (DMA_RMW_TCD7_CITER_ELINKYES(base, DMA_TCD7_CITER_ELINKYES_CITER_MASK, DMA_TCD7_CITER_ELINKYES_CITER(value)))
#define DMA_BWR_TCD7_CITER_ELINKYES_CITER(base, value) (DMA_WR_TCD7_CITER_ELINKYES_CITER(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD7_CITER_ELINKYES, field LINKCH[12:9] (RW)
 *
 * If channel-to-channel linking is enabled (ELINK = 1), then after the minor
 * loop is exhausted, the eDMA engine initiates a channel service request to the
 * channel defined by this field by setting that channel's TCDn_CSR[START] bit.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD7_CITER_ELINKYES_LINKCH field. */
#define DMA_RD_TCD7_CITER_ELINKYES_LINKCH(base) ((DMA_TCD7_CITER_ELINKYES_REG(base) & DMA_TCD7_CITER_ELINKYES_LINKCH_MASK) >> DMA_TCD7_CITER_ELINKYES_LINKCH_SHIFT)
#define DMA_BRD_TCD7_CITER_ELINKYES_LINKCH(base) (DMA_RD_TCD7_CITER_ELINKYES_LINKCH(base))

/*! @brief Set the LINKCH field to a new value. */
#define DMA_WR_TCD7_CITER_ELINKYES_LINKCH(base, value) (DMA_RMW_TCD7_CITER_ELINKYES(base, DMA_TCD7_CITER_ELINKYES_LINKCH_MASK, DMA_TCD7_CITER_ELINKYES_LINKCH(value)))
#define DMA_BWR_TCD7_CITER_ELINKYES_LINKCH(base, value) (DMA_WR_TCD7_CITER_ELINKYES_LINKCH(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD7_CITER_ELINKYES, field ELINK[15] (RW)
 *
 * As the channel completes the minor loop, this flag enables linking to another
 * channel, defined by the LINKCH field. The link target channel initiates a
 * channel service request via an internal mechanism that sets the TCDn_CSR[START]
 * bit of the specified channel. If channel linking is disabled, the CITER value
 * is extended to 15 bits in place of a link channel number. If the major loop is
 * exhausted, this link mechanism is suppressed in favor of the MAJORELINK
 * channel linking. This bit must be equal to the BITER[ELINK] bit; otherwise, a
 * configuration error is reported.
 *
 * Values:
 * - 0b0 - The channel-to-channel linking is disabled
 * - 0b1 - The channel-to-channel linking is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD7_CITER_ELINKYES_ELINK field. */
#define DMA_RD_TCD7_CITER_ELINKYES_ELINK(base) ((DMA_TCD7_CITER_ELINKYES_REG(base) & DMA_TCD7_CITER_ELINKYES_ELINK_MASK) >> DMA_TCD7_CITER_ELINKYES_ELINK_SHIFT)
#define DMA_BRD_TCD7_CITER_ELINKYES_ELINK(base) (BITBAND_ACCESS16(&DMA_TCD7_CITER_ELINKYES_REG(base), DMA_TCD7_CITER_ELINKYES_ELINK_SHIFT))

