nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual DMA_TCD8_CSR bitfields
 */

/*!
 * @name Register DMA_TCD8_CSR, field START[0] (RW)
 *
 * If this flag is set, the channel is requesting service. The eDMA hardware
 * automatically clears this flag after the channel begins execution.
 *
 * Values:
 * - 0b0 - The channel is not explicitly started.
 * - 0b1 - The channel is explicitly started via a software initiated service
 *     request.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD8_CSR_START field. */
#define DMA_RD_TCD8_CSR_START(base) ((DMA_TCD8_CSR_REG(base) & DMA_TCD8_CSR_START_MASK) >> DMA_TCD8_CSR_START_SHIFT)
#define DMA_BRD_TCD8_CSR_START(base) (BITBAND_ACCESS16(&DMA_TCD8_CSR_REG(base), DMA_TCD8_CSR_START_SHIFT))

/*! @brief Set the START field to a new value. */
#define DMA_WR_TCD8_CSR_START(base, value) (DMA_RMW_TCD8_CSR(base, DMA_TCD8_CSR_START_MASK, DMA_TCD8_CSR_START(value)))
#define DMA_BWR_TCD8_CSR_START(base, value) (BITBAND_ACCESS16(&DMA_TCD8_CSR_REG(base), DMA_TCD8_CSR_START_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_TCD8_CSR, field INTMAJOR[1] (RW)
 *
 * If this flag is set, the channel generates an interrupt request by setting
 * the appropriate bit in the INT when the current major iteration count reaches
 * zero.
 *
 * Values:
 * - 0b0 - The end-of-major loop interrupt is disabled.
 * - 0b1 - The end-of-major loop interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD8_CSR_INTMAJOR field. */
#define DMA_RD_TCD8_CSR_INTMAJOR(base) ((DMA_TCD8_CSR_REG(base) & DMA_TCD8_CSR_INTMAJOR_MASK) >> DMA_TCD8_CSR_INTMAJOR_SHIFT)
#define DMA_BRD_TCD8_CSR_INTMAJOR(base) (BITBAND_ACCESS16(&DMA_TCD8_CSR_REG(base), DMA_TCD8_CSR_INTMAJOR_SHIFT))

/*! @brief Set the INTMAJOR field to a new value. */
#define DMA_WR_TCD8_CSR_INTMAJOR(base, value) (DMA_RMW_TCD8_CSR(base, DMA_TCD8_CSR_INTMAJOR_MASK, DMA_TCD8_CSR_INTMAJOR(value)))
#define DMA_BWR_TCD8_CSR_INTMAJOR(base, value) (BITBAND_ACCESS16(&DMA_TCD8_CSR_REG(base), DMA_TCD8_CSR_INTMAJOR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_TCD8_CSR, field INTHALF[2] (RW)
 *
 * If this flag is set, the channel generates an interrupt request by setting
 * the appropriate bit in the INT register when the current major iteration count
 * reaches the halfway point. Specifically, the comparison performed by the eDMA
 * engine is (CITER == (BITER >> 1)). This halfway point interrupt request is
 * provided to support double-buffered, also known as ping-pong, schemes or other
 * types of data movement where the processor needs an early indication of the
 * transfer's progress. If BITER = 1, do not use INTHALF. Use INTMAJOR instead.
 *
 * Values:
 * - 0b0 - The half-point interrupt is disabled.
 * - 0b1 - The half-point interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD8_CSR_INTHALF field. */
#define DMA_RD_TCD8_CSR_INTHALF(base) ((DMA_TCD8_CSR_REG(base) & DMA_TCD8_CSR_INTHALF_MASK) >> DMA_TCD8_CSR_INTHALF_SHIFT)
#define DMA_BRD_TCD8_CSR_INTHALF(base) (BITBAND_ACCESS16(&DMA_TCD8_CSR_REG(base), DMA_TCD8_CSR_INTHALF_SHIFT))

/*! @brief Set the INTHALF field to a new value. */
#define DMA_WR_TCD8_CSR_INTHALF(base, value) (DMA_RMW_TCD8_CSR(base, DMA_TCD8_CSR_INTHALF_MASK, DMA_TCD8_CSR_INTHALF(value)))
#define DMA_BWR_TCD8_CSR_INTHALF(base, value) (BITBAND_ACCESS16(&DMA_TCD8_CSR_REG(base), DMA_TCD8_CSR_INTHALF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_TCD8_CSR, field DREQ[3] (RW)
 *
 * If this flag is set, the eDMA hardware automatically clears the corresponding
 * ERQ bit when the current major iteration count reaches zero.
 *
 * Values:
 * - 0b0 - The channel's ERQ bit is not affected.
 * - 0b1 - The channel's ERQ bit is cleared when the major loop is complete.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD8_CSR_DREQ field. */
#define DMA_RD_TCD8_CSR_DREQ(base) ((DMA_TCD8_CSR_REG(base) & DMA_TCD8_CSR_DREQ_MASK) >> DMA_TCD8_CSR_DREQ_SHIFT)
#define DMA_BRD_TCD8_CSR_DREQ(base) (BITBAND_ACCESS16(&DMA_TCD8_CSR_REG(base), DMA_TCD8_CSR_DREQ_SHIFT))

/*! @brief Set the DREQ field to a new value. */
#define DMA_WR_TCD8_CSR_DREQ(base, value) (DMA_RMW_TCD8_CSR(base, DMA_TCD8_CSR_DREQ_MASK, DMA_TCD8_CSR_DREQ(value)))
#define DMA_BWR_TCD8_CSR_DREQ(base, value) (BITBAND_ACCESS16(&DMA_TCD8_CSR_REG(base), DMA_TCD8_CSR_DREQ_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_TCD8_CSR, field ESG[4] (RW)
 *
 * As the channel completes the major loop, this flag enables scatter/gather
 * processing in the current channel. If enabled, the eDMA engine uses DLASTSGA as a
 * memory pointer to a 0-modulo-32 address containing a 32-byte data structure
 * loaded as the transfer control descriptor into the local memory. To support the
 * dynamic scatter/gather coherency model, this field is forced to zero when
 * written to while the TCDn_CSR[DONE] bit is set.
 *
 * Values:
 * - 0b0 - The current channel's TCD is normal format.
 * - 0b1 - The current channel's TCD specifies a scatter gather format. The
 *     DLASTSGA field provides a memory pointer to the next TCD to be loaded into
 *     this channel after the major loop completes its execution.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD8_CSR_ESG field. */
#define DMA_RD_TCD8_CSR_ESG(base) ((DMA_TCD8_CSR_REG(base) & DMA_TCD8_CSR_ESG_MASK) >> DMA_TCD8_CSR_ESG_SHIFT)
#define DMA_BRD_TCD8_CSR_ESG(base) (BITBAND_ACCESS16(&DMA_TCD8_CSR_REG(base), DMA_TCD8_CSR_ESG_SHIFT))

/*! @brief Set the ESG field to a new value. */
#define DMA_WR_TCD8_CSR_ESG(base, value) (DMA_RMW_TCD8_CSR(base, DMA_TCD8_CSR_ESG_MASK, DMA_TCD8_CSR_ESG(value)))
#define DMA_BWR_TCD8_CSR_ESG(base, value) (BITBAND_ACCESS16(&DMA_TCD8_CSR_REG(base), DMA_TCD8_CSR_ESG_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_TCD8_CSR, field MAJORELINK[5] (RW)
 *
 * As the channel completes the major loop, this flag enables the linking to
 * another channel, defined by MAJORLINKCH. The link target channel initiates a
 * channel service request via an internal mechanism that sets the TCDn_CSR[START]
 * bit of the specified channel. To support the dynamic linking coherency model,
 * this field is forced to zero when written to while the TCDn_CSR[DONE] bit is set.
 *
 * Values:
 * - 0b0 - The channel-to-channel linking is disabled.
 * - 0b1 - The channel-to-channel linking is enabled.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD8_CSR_MAJORELINK field. */
#define DMA_RD_TCD8_CSR_MAJORELINK(base) ((DMA_TCD8_CSR_REG(base) & DMA_TCD8_CSR_MAJORELINK_MASK) >> DMA_TCD8_CSR_MAJORELINK_SHIFT)
#define DMA_BRD_TCD8_CSR_MAJORELINK(base) (BITBAND_ACCESS16(&DMA_TCD8_CSR_REG(base), DMA_TCD8_CSR_MAJORELINK_SHIFT))

