nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the MLOFF field to a new value. */
#define DMA_WR_TCD9_NBYTES_MLOFFYES_MLOFF(base, value) (DMA_RMW_TCD9_NBYTES_MLOFFYES(base, DMA_TCD9_NBYTES_MLOFFYES_MLOFF_MASK, DMA_TCD9_NBYTES_MLOFFYES_MLOFF(value)))
#define DMA_BWR_TCD9_NBYTES_MLOFFYES_MLOFF(base, value) (DMA_WR_TCD9_NBYTES_MLOFFYES_MLOFF(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD9_NBYTES_MLOFFYES, field DMLOE[30] (RW)
 *
 * Selects whether the minor loop offset is applied to the destination address
 * upon minor loop completion.
 *
 * Values:
 * - 0b0 - The minor loop offset is not applied to the DADDR
 * - 0b1 - The minor loop offset is applied to the DADDR
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD9_NBYTES_MLOFFYES_DMLOE field. */
#define DMA_RD_TCD9_NBYTES_MLOFFYES_DMLOE(base) ((DMA_TCD9_NBYTES_MLOFFYES_REG(base) & DMA_TCD9_NBYTES_MLOFFYES_DMLOE_MASK) >> DMA_TCD9_NBYTES_MLOFFYES_DMLOE_SHIFT)
#define DMA_BRD_TCD9_NBYTES_MLOFFYES_DMLOE(base) (BITBAND_ACCESS32(&DMA_TCD9_NBYTES_MLOFFYES_REG(base), DMA_TCD9_NBYTES_MLOFFYES_DMLOE_SHIFT))

/*! @brief Set the DMLOE field to a new value. */
#define DMA_WR_TCD9_NBYTES_MLOFFYES_DMLOE(base, value) (DMA_RMW_TCD9_NBYTES_MLOFFYES(base, DMA_TCD9_NBYTES_MLOFFYES_DMLOE_MASK, DMA_TCD9_NBYTES_MLOFFYES_DMLOE(value)))
#define DMA_BWR_TCD9_NBYTES_MLOFFYES_DMLOE(base, value) (BITBAND_ACCESS32(&DMA_TCD9_NBYTES_MLOFFYES_REG(base), DMA_TCD9_NBYTES_MLOFFYES_DMLOE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_TCD9_NBYTES_MLOFFYES, field SMLOE[31] (RW)
 *
 * Selects whether the minor loop offset is applied to the source address upon
 * minor loop completion.
 *
 * Values:
 * - 0b0 - The minor loop offset is not applied to the SADDR
 * - 0b1 - The minor loop offset is applied to the SADDR
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD9_NBYTES_MLOFFYES_SMLOE field. */
#define DMA_RD_TCD9_NBYTES_MLOFFYES_SMLOE(base) ((DMA_TCD9_NBYTES_MLOFFYES_REG(base) & DMA_TCD9_NBYTES_MLOFFYES_SMLOE_MASK) >> DMA_TCD9_NBYTES_MLOFFYES_SMLOE_SHIFT)
#define DMA_BRD_TCD9_NBYTES_MLOFFYES_SMLOE(base) (BITBAND_ACCESS32(&DMA_TCD9_NBYTES_MLOFFYES_REG(base), DMA_TCD9_NBYTES_MLOFFYES_SMLOE_SHIFT))

/*! @brief Set the SMLOE field to a new value. */
#define DMA_WR_TCD9_NBYTES_MLOFFYES_SMLOE(base, value) (DMA_RMW_TCD9_NBYTES_MLOFFYES(base, DMA_TCD9_NBYTES_MLOFFYES_SMLOE_MASK, DMA_TCD9_NBYTES_MLOFFYES_SMLOE(value)))
#define DMA_BWR_TCD9_NBYTES_MLOFFYES_SMLOE(base, value) (BITBAND_ACCESS32(&DMA_TCD9_NBYTES_MLOFFYES_REG(base), DMA_TCD9_NBYTES_MLOFFYES_SMLOE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_TCD9_SLAST - TCD Last Source Address Adjustment
 ******************************************************************************/

/*!
 * @brief DMA_TCD9_SLAST - TCD Last Source Address Adjustment (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD9_SLAST register
 */
/*@{*/
#define DMA_RD_TCD9_SLAST(base)  (DMA_TCD9_SLAST_REG(base))
#define DMA_WR_TCD9_SLAST(base, value) (DMA_TCD9_SLAST_REG(base) = (value))
#define DMA_RMW_TCD9_SLAST(base, mask, value) (DMA_WR_TCD9_SLAST(base, (DMA_RD_TCD9_SLAST(base) & ~(mask)) | (value)))
#define DMA_SET_TCD9_SLAST(base, value) (DMA_WR_TCD9_SLAST(base, DMA_RD_TCD9_SLAST(base) |  (value)))
#define DMA_CLR_TCD9_SLAST(base, value) (DMA_WR_TCD9_SLAST(base, DMA_RD_TCD9_SLAST(base) & ~(value)))
#define DMA_TOG_TCD9_SLAST(base, value) (DMA_WR_TCD9_SLAST(base, DMA_RD_TCD9_SLAST(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD9_DADDR - TCD Destination Address
 ******************************************************************************/

/*!
 * @brief DMA_TCD9_DADDR - TCD Destination Address (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD9_DADDR register
 */
/*@{*/
#define DMA_RD_TCD9_DADDR(base)  (DMA_TCD9_DADDR_REG(base))
#define DMA_WR_TCD9_DADDR(base, value) (DMA_TCD9_DADDR_REG(base) = (value))
#define DMA_RMW_TCD9_DADDR(base, mask, value) (DMA_WR_TCD9_DADDR(base, (DMA_RD_TCD9_DADDR(base) & ~(mask)) | (value)))
#define DMA_SET_TCD9_DADDR(base, value) (DMA_WR_TCD9_DADDR(base, DMA_RD_TCD9_DADDR(base) |  (value)))
#define DMA_CLR_TCD9_DADDR(base, value) (DMA_WR_TCD9_DADDR(base, DMA_RD_TCD9_DADDR(base) & ~(value)))
#define DMA_TOG_TCD9_DADDR(base, value) (DMA_WR_TCD9_DADDR(base, DMA_RD_TCD9_DADDR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD9_DOFF - TCD Signed Destination Address Offset
 ******************************************************************************/

/*!
 * @brief DMA_TCD9_DOFF - TCD Signed Destination Address Offset (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD9_DOFF register
 */
/*@{*/
#define DMA_RD_TCD9_DOFF(base)   (DMA_TCD9_DOFF_REG(base))
#define DMA_WR_TCD9_DOFF(base, value) (DMA_TCD9_DOFF_REG(base) = (value))
#define DMA_RMW_TCD9_DOFF(base, mask, value) (DMA_WR_TCD9_DOFF(base, (DMA_RD_TCD9_DOFF(base) & ~(mask)) | (value)))
#define DMA_SET_TCD9_DOFF(base, value) (DMA_WR_TCD9_DOFF(base, DMA_RD_TCD9_DOFF(base) |  (value)))
#define DMA_CLR_TCD9_DOFF(base, value) (DMA_WR_TCD9_DOFF(base, DMA_RD_TCD9_DOFF(base) & ~(value)))
#define DMA_TOG_TCD9_DOFF(base, value) (DMA_WR_TCD9_DOFF(base, DMA_RD_TCD9_DOFF(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD9_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 ******************************************************************************/

/*!
 * @brief DMA_TCD9_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled) (RW)
 *
 * Reset value: 0x0000U
 *
 * If TCDn_CITER[ELINK] is set, the TCDn_CITER register is defined as follows.
 */
/*!
 * @name Constants and macros for entire DMA_TCD9_CITER_ELINKYES register
 */
/*@{*/
#define DMA_RD_TCD9_CITER_ELINKYES(base) (DMA_TCD9_CITER_ELINKYES_REG(base))
#define DMA_WR_TCD9_CITER_ELINKYES(base, value) (DMA_TCD9_CITER_ELINKYES_REG(base) = (value))
#define DMA_RMW_TCD9_CITER_ELINKYES(base, mask, value) (DMA_WR_TCD9_CITER_ELINKYES(base, (DMA_RD_TCD9_CITER_ELINKYES(base) & ~(mask)) | (value)))
#define DMA_SET_TCD9_CITER_ELINKYES(base, value) (DMA_WR_TCD9_CITER_ELINKYES(base, DMA_RD_TCD9_CITER_ELINKYES(base) |  (value)))
#define DMA_CLR_TCD9_CITER_ELINKYES(base, value) (DMA_WR_TCD9_CITER_ELINKYES(base, DMA_RD_TCD9_CITER_ELINKYES(base) & ~(value)))
#define DMA_TOG_TCD9_CITER_ELINKYES(base, value) (DMA_WR_TCD9_CITER_ELINKYES(base, DMA_RD_TCD9_CITER_ELINKYES(base) ^  (value)))
/*@}*/

