nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * DMA_TCD11_SLAST - TCD Last Source Address Adjustment
 ******************************************************************************/

/*!
 * @brief DMA_TCD11_SLAST - TCD Last Source Address Adjustment (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD11_SLAST register
 */
/*@{*/
#define DMA_RD_TCD11_SLAST(base) (DMA_TCD11_SLAST_REG(base))
#define DMA_WR_TCD11_SLAST(base, value) (DMA_TCD11_SLAST_REG(base) = (value))
#define DMA_RMW_TCD11_SLAST(base, mask, value) (DMA_WR_TCD11_SLAST(base, (DMA_RD_TCD11_SLAST(base) & ~(mask)) | (value)))
#define DMA_SET_TCD11_SLAST(base, value) (DMA_WR_TCD11_SLAST(base, DMA_RD_TCD11_SLAST(base) |  (value)))
#define DMA_CLR_TCD11_SLAST(base, value) (DMA_WR_TCD11_SLAST(base, DMA_RD_TCD11_SLAST(base) & ~(value)))
#define DMA_TOG_TCD11_SLAST(base, value) (DMA_WR_TCD11_SLAST(base, DMA_RD_TCD11_SLAST(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD11_DADDR - TCD Destination Address
 ******************************************************************************/

/*!
 * @brief DMA_TCD11_DADDR - TCD Destination Address (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD11_DADDR register
 */
/*@{*/
#define DMA_RD_TCD11_DADDR(base) (DMA_TCD11_DADDR_REG(base))
#define DMA_WR_TCD11_DADDR(base, value) (DMA_TCD11_DADDR_REG(base) = (value))
#define DMA_RMW_TCD11_DADDR(base, mask, value) (DMA_WR_TCD11_DADDR(base, (DMA_RD_TCD11_DADDR(base) & ~(mask)) | (value)))
#define DMA_SET_TCD11_DADDR(base, value) (DMA_WR_TCD11_DADDR(base, DMA_RD_TCD11_DADDR(base) |  (value)))
#define DMA_CLR_TCD11_DADDR(base, value) (DMA_WR_TCD11_DADDR(base, DMA_RD_TCD11_DADDR(base) & ~(value)))
#define DMA_TOG_TCD11_DADDR(base, value) (DMA_WR_TCD11_DADDR(base, DMA_RD_TCD11_DADDR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD11_DOFF - TCD Signed Destination Address Offset
 ******************************************************************************/

/*!
 * @brief DMA_TCD11_DOFF - TCD Signed Destination Address Offset (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD11_DOFF register
 */
/*@{*/
#define DMA_RD_TCD11_DOFF(base)  (DMA_TCD11_DOFF_REG(base))
#define DMA_WR_TCD11_DOFF(base, value) (DMA_TCD11_DOFF_REG(base) = (value))
#define DMA_RMW_TCD11_DOFF(base, mask, value) (DMA_WR_TCD11_DOFF(base, (DMA_RD_TCD11_DOFF(base) & ~(mask)) | (value)))
#define DMA_SET_TCD11_DOFF(base, value) (DMA_WR_TCD11_DOFF(base, DMA_RD_TCD11_DOFF(base) |  (value)))
#define DMA_CLR_TCD11_DOFF(base, value) (DMA_WR_TCD11_DOFF(base, DMA_RD_TCD11_DOFF(base) & ~(value)))
#define DMA_TOG_TCD11_DOFF(base, value) (DMA_WR_TCD11_DOFF(base, DMA_RD_TCD11_DOFF(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD11_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 ******************************************************************************/

/*!
 * @brief DMA_TCD11_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled) (RW)
 *
 * Reset value: 0x0000U
 *
 * If TCDn_CITER[ELINK] is cleared, the TCDn_CITER register is defined as
 * follows.
 */
/*!
 * @name Constants and macros for entire DMA_TCD11_CITER_ELINKNO register
 */
/*@{*/
#define DMA_RD_TCD11_CITER_ELINKNO(base) (DMA_TCD11_CITER_ELINKNO_REG(base))
#define DMA_WR_TCD11_CITER_ELINKNO(base, value) (DMA_TCD11_CITER_ELINKNO_REG(base) = (value))
#define DMA_RMW_TCD11_CITER_ELINKNO(base, mask, value) (DMA_WR_TCD11_CITER_ELINKNO(base, (DMA_RD_TCD11_CITER_ELINKNO(base) & ~(mask)) | (value)))
#define DMA_SET_TCD11_CITER_ELINKNO(base, value) (DMA_WR_TCD11_CITER_ELINKNO(base, DMA_RD_TCD11_CITER_ELINKNO(base) |  (value)))
#define DMA_CLR_TCD11_CITER_ELINKNO(base, value) (DMA_WR_TCD11_CITER_ELINKNO(base, DMA_RD_TCD11_CITER_ELINKNO(base) & ~(value)))
#define DMA_TOG_TCD11_CITER_ELINKNO(base, value) (DMA_WR_TCD11_CITER_ELINKNO(base, DMA_RD_TCD11_CITER_ELINKNO(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_TCD11_CITER_ELINKNO bitfields
 */

/*!
 * @name Register DMA_TCD11_CITER_ELINKNO, field CITER[14:0] (RW)
 *
 * This 9-bit (ELINK = 1) or 15-bit (ELINK = 0) count represents the current
 * major loop count for the channel. It is decremented each time the minor loop is
 * completed and updated in the transfer control descriptor memory. After the
 * major iteration count is exhausted, the channel performs a number of operations,
 * for example, final source and destination address calculations, optionally
 * generating an interrupt to signal channel completion before reloading the CITER
 * field from the Beginning Iteration Count (BITER) field. When the CITER field is
 * initially loaded by software, it must be set to the same value as that
 * contained in the BITER field. If the channel is configured to execute a single
 * service request, the initial values of BITER and CITER should be 0x0001.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD11_CITER_ELINKNO_CITER field. */
#define DMA_RD_TCD11_CITER_ELINKNO_CITER(base) ((DMA_TCD11_CITER_ELINKNO_REG(base) & DMA_TCD11_CITER_ELINKNO_CITER_MASK) >> DMA_TCD11_CITER_ELINKNO_CITER_SHIFT)
#define DMA_BRD_TCD11_CITER_ELINKNO_CITER(base) (DMA_RD_TCD11_CITER_ELINKNO_CITER(base))

/*! @brief Set the CITER field to a new value. */
#define DMA_WR_TCD11_CITER_ELINKNO_CITER(base, value) (DMA_RMW_TCD11_CITER_ELINKNO(base, DMA_TCD11_CITER_ELINKNO_CITER_MASK, DMA_TCD11_CITER_ELINKNO_CITER(value)))
#define DMA_BWR_TCD11_CITER_ELINKNO_CITER(base, value) (DMA_WR_TCD11_CITER_ELINKNO_CITER(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD11_CITER_ELINKNO, field ELINK[15] (RW)
 *
 * As the channel completes the minor loop, this flag enables linking to another
 * channel, defined by the LINKCH field. The link target channel initiates a
 * channel service request via an internal mechanism that sets the TCDn_CSR[START]
 * bit of the specified channel. If channel linking is disabled, the CITER value
 * is extended to 15 bits in place of a link channel number. If the major loop is
 * exhausted, this link mechanism is suppressed in favor of the MAJORELINK
 * channel linking. This bit must be equal to the BITER[ELINK] bit; otherwise, a
 * configuration error is reported.
 *
 * Values:
 * - 0b0 - The channel-to-channel linking is disabled
 * - 0b1 - The channel-to-channel linking is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD11_CITER_ELINKNO_ELINK field. */
#define DMA_RD_TCD11_CITER_ELINKNO_ELINK(base) ((DMA_TCD11_CITER_ELINKNO_REG(base) & DMA_TCD11_CITER_ELINKNO_ELINK_MASK) >> DMA_TCD11_CITER_ELINKNO_ELINK_SHIFT)
#define DMA_BRD_TCD11_CITER_ELINKNO_ELINK(base) (BITBAND_ACCESS16(&DMA_TCD11_CITER_ELINKNO_REG(base), DMA_TCD11_CITER_ELINKNO_ELINK_SHIFT))

