nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual DMA_TCD12_BITER_ELINKNO bitfields
 */

/*!
 * @name Register DMA_TCD12_BITER_ELINKNO, field BITER[14:0] (RW)
 *
 * As the transfer control descriptor is first loaded by software, this 9-bit
 * (ELINK = 1) or 15-bit (ELINK = 0) field must be equal to the value in the CITER
 * field. As the major iteration count is exhausted, the contents of this field
 * are reloaded into the CITER field. When the software loads the TCD, this field
 * must be set equal to the corresponding CITER field; otherwise, a configuration
 * error is reported. As the major iteration count is exhausted, the contents of
 * this field is reloaded into the CITER field. If the channel is configured to
 * execute a single service request, the initial values of BITER and CITER should
 * be 0x0001.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD12_BITER_ELINKNO_BITER field. */
#define DMA_RD_TCD12_BITER_ELINKNO_BITER(base) ((DMA_TCD12_BITER_ELINKNO_REG(base) & DMA_TCD12_BITER_ELINKNO_BITER_MASK) >> DMA_TCD12_BITER_ELINKNO_BITER_SHIFT)
#define DMA_BRD_TCD12_BITER_ELINKNO_BITER(base) (DMA_RD_TCD12_BITER_ELINKNO_BITER(base))

/*! @brief Set the BITER field to a new value. */
#define DMA_WR_TCD12_BITER_ELINKNO_BITER(base, value) (DMA_RMW_TCD12_BITER_ELINKNO(base, DMA_TCD12_BITER_ELINKNO_BITER_MASK, DMA_TCD12_BITER_ELINKNO_BITER(value)))
#define DMA_BWR_TCD12_BITER_ELINKNO_BITER(base, value) (DMA_WR_TCD12_BITER_ELINKNO_BITER(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD12_BITER_ELINKNO, field ELINK[15] (RW)
 *
 * As the channel completes the minor loop, this flag enables the linking to
 * another channel, defined by BITER[LINKCH]. The link target channel initiates a
 * channel service request via an internal mechanism that sets the TCDn_CSR[START]
 * bit of the specified channel. If channel linking is disabled, the BITER value
 * extends to 15 bits in place of a link channel number. If the major loop is
 * exhausted, this link mechanism is suppressed in favor of the MAJORELINK channel
 * linking. When the software loads the TCD, this field must be set equal to the
 * corresponding CITER field; otherwise, a configuration error is reported. As the
 * major iteration count is exhausted, the contents of this field are reloaded
 * into the CITER field.
 *
 * Values:
 * - 0b0 - The channel-to-channel linking is disabled
 * - 0b1 - The channel-to-channel linking is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD12_BITER_ELINKNO_ELINK field. */
#define DMA_RD_TCD12_BITER_ELINKNO_ELINK(base) ((DMA_TCD12_BITER_ELINKNO_REG(base) & DMA_TCD12_BITER_ELINKNO_ELINK_MASK) >> DMA_TCD12_BITER_ELINKNO_ELINK_SHIFT)
#define DMA_BRD_TCD12_BITER_ELINKNO_ELINK(base) (BITBAND_ACCESS16(&DMA_TCD12_BITER_ELINKNO_REG(base), DMA_TCD12_BITER_ELINKNO_ELINK_SHIFT))

/*! @brief Set the ELINK field to a new value. */
#define DMA_WR_TCD12_BITER_ELINKNO_ELINK(base, value) (DMA_RMW_TCD12_BITER_ELINKNO(base, DMA_TCD12_BITER_ELINKNO_ELINK_MASK, DMA_TCD12_BITER_ELINKNO_ELINK(value)))
#define DMA_BWR_TCD12_BITER_ELINKNO_ELINK(base, value) (BITBAND_ACCESS16(&DMA_TCD12_BITER_ELINKNO_REG(base), DMA_TCD12_BITER_ELINKNO_ELINK_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_TCD12_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 ******************************************************************************/

/*!
 * @brief DMA_TCD12_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled) (RW)
 *
 * Reset value: 0x0000U
 *
 * If the TCDn_BITER[ELINK] bit is set, the TCDn_BITER register is defined as
 * follows.
 */
/*!
 * @name Constants and macros for entire DMA_TCD12_BITER_ELINKYES register
 */
/*@{*/
#define DMA_RD_TCD12_BITER_ELINKYES(base) (DMA_TCD12_BITER_ELINKYES_REG(base))
#define DMA_WR_TCD12_BITER_ELINKYES(base, value) (DMA_TCD12_BITER_ELINKYES_REG(base) = (value))
#define DMA_RMW_TCD12_BITER_ELINKYES(base, mask, value) (DMA_WR_TCD12_BITER_ELINKYES(base, (DMA_RD_TCD12_BITER_ELINKYES(base) & ~(mask)) | (value)))
#define DMA_SET_TCD12_BITER_ELINKYES(base, value) (DMA_WR_TCD12_BITER_ELINKYES(base, DMA_RD_TCD12_BITER_ELINKYES(base) |  (value)))
#define DMA_CLR_TCD12_BITER_ELINKYES(base, value) (DMA_WR_TCD12_BITER_ELINKYES(base, DMA_RD_TCD12_BITER_ELINKYES(base) & ~(value)))
#define DMA_TOG_TCD12_BITER_ELINKYES(base, value) (DMA_WR_TCD12_BITER_ELINKYES(base, DMA_RD_TCD12_BITER_ELINKYES(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_TCD12_BITER_ELINKYES bitfields
 */

/*!
 * @name Register DMA_TCD12_BITER_ELINKYES, field BITER[8:0] (RW)
 *
 * As the transfer control descriptor is first loaded by software, this 9-bit
 * (ELINK = 1) or 15-bit (ELINK = 0) field must be equal to the value in the CITER
 * field. As the major iteration count is exhausted, the contents of this field
 * are reloaded into the CITER field. When the software loads the TCD, this field
 * must be set equal to the corresponding CITER field; otherwise, a configuration
 * error is reported. As the major iteration count is exhausted, the contents of
 * this field are reloaded into the CITER field. If the channel is configured to
 * execute a single service request, the initial values of BITER and CITER
 * should be 0x0001.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD12_BITER_ELINKYES_BITER field. */
#define DMA_RD_TCD12_BITER_ELINKYES_BITER(base) ((DMA_TCD12_BITER_ELINKYES_REG(base) & DMA_TCD12_BITER_ELINKYES_BITER_MASK) >> DMA_TCD12_BITER_ELINKYES_BITER_SHIFT)
#define DMA_BRD_TCD12_BITER_ELINKYES_BITER(base) (DMA_RD_TCD12_BITER_ELINKYES_BITER(base))

/*! @brief Set the BITER field to a new value. */
#define DMA_WR_TCD12_BITER_ELINKYES_BITER(base, value) (DMA_RMW_TCD12_BITER_ELINKYES(base, DMA_TCD12_BITER_ELINKYES_BITER_MASK, DMA_TCD12_BITER_ELINKYES_BITER(value)))
#define DMA_BWR_TCD12_BITER_ELINKYES_BITER(base, value) (DMA_WR_TCD12_BITER_ELINKYES_BITER(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD12_BITER_ELINKYES, field LINKCH[12:9] (RW)
 *
 * If channel-to-channel linking is enabled (ELINK = 1), then after the minor
 * loop is exhausted, the eDMA engine initiates a channel service request at the
 * channel defined by this field by setting that channel's TCDn_CSR[START] bit.
 * When the software loads the TCD, this field must be set equal to the
 * corresponding CITER field; otherwise, a configuration error is reported. As the major
 * iteration count is exhausted, the contents of this field are reloaded into the
 * CITER field.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD12_BITER_ELINKYES_LINKCH field. */
#define DMA_RD_TCD12_BITER_ELINKYES_LINKCH(base) ((DMA_TCD12_BITER_ELINKYES_REG(base) & DMA_TCD12_BITER_ELINKYES_LINKCH_MASK) >> DMA_TCD12_BITER_ELINKYES_LINKCH_SHIFT)
#define DMA_BRD_TCD12_BITER_ELINKYES_LINKCH(base) (DMA_RD_TCD12_BITER_ELINKYES_LINKCH(base))

/*! @brief Set the LINKCH field to a new value. */
#define DMA_WR_TCD12_BITER_ELINKYES_LINKCH(base, value) (DMA_RMW_TCD12_BITER_ELINKYES(base, DMA_TCD12_BITER_ELINKYES_LINKCH_MASK, DMA_TCD12_BITER_ELINKYES_LINKCH(value)))
#define DMA_BWR_TCD12_BITER_ELINKYES_LINKCH(base, value) (DMA_WR_TCD12_BITER_ELINKYES_LINKCH(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD12_BITER_ELINKYES, field ELINK[15] (RW)
 *
 * As the channel completes the minor loop, this flag enables the linking to
 * another channel, defined by BITER[LINKCH]. The link target channel initiates a
 * channel service request via an internal mechanism that sets the TCDn_CSR[START]
 * bit of the specified channel. If channel linking disables, the BITER value
 * extends to 15 bits in place of a link channel number. If the major loop is
 * exhausted, this link mechanism is suppressed in favor of the MAJORELINK channel
 * linking. When the software loads the TCD, this field must be set equal to the
 * corresponding CITER field; otherwise, a configuration error is reported. As the
 * major iteration count is exhausted, the contents of this field are reloaded into
 * the CITER field.
 *
 * Values:
 * - 0b0 - The channel-to-channel linking is disabled
 * - 0b1 - The channel-to-channel linking is enabled
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD12_BITER_ELINKYES_ELINK field. */
#define DMA_RD_TCD12_BITER_ELINKYES_ELINK(base) ((DMA_TCD12_BITER_ELINKYES_REG(base) & DMA_TCD12_BITER_ELINKYES_ELINK_MASK) >> DMA_TCD12_BITER_ELINKYES_ELINK_SHIFT)
#define DMA_BRD_TCD12_BITER_ELINKYES_ELINK(base) (BITBAND_ACCESS16(&DMA_TCD12_BITER_ELINKYES_REG(base), DMA_TCD12_BITER_ELINKYES_ELINK_SHIFT))

