nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the ELINK field to a new value. */
#define DMA_WR_TCD12_BITER_ELINKYES_ELINK(base, value) (DMA_RMW_TCD12_BITER_ELINKYES(base, DMA_TCD12_BITER_ELINKYES_ELINK_MASK, DMA_TCD12_BITER_ELINKYES_ELINK(value)))
#define DMA_BWR_TCD12_BITER_ELINKYES_ELINK(base, value) (BITBAND_ACCESS16(&DMA_TCD12_BITER_ELINKYES_REG(base), DMA_TCD12_BITER_ELINKYES_ELINK_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_TCD13_SADDR - TCD Source Address
 ******************************************************************************/

/*!
 * @brief DMA_TCD13_SADDR - TCD Source Address (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD13_SADDR register
 */
/*@{*/
#define DMA_RD_TCD13_SADDR(base) (DMA_TCD13_SADDR_REG(base))
#define DMA_WR_TCD13_SADDR(base, value) (DMA_TCD13_SADDR_REG(base) = (value))
#define DMA_RMW_TCD13_SADDR(base, mask, value) (DMA_WR_TCD13_SADDR(base, (DMA_RD_TCD13_SADDR(base) & ~(mask)) | (value)))
#define DMA_SET_TCD13_SADDR(base, value) (DMA_WR_TCD13_SADDR(base, DMA_RD_TCD13_SADDR(base) |  (value)))
#define DMA_CLR_TCD13_SADDR(base, value) (DMA_WR_TCD13_SADDR(base, DMA_RD_TCD13_SADDR(base) & ~(value)))
#define DMA_TOG_TCD13_SADDR(base, value) (DMA_WR_TCD13_SADDR(base, DMA_RD_TCD13_SADDR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD13_SOFF - TCD Signed Source Address Offset
 ******************************************************************************/

/*!
 * @brief DMA_TCD13_SOFF - TCD Signed Source Address Offset (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD13_SOFF register
 */
/*@{*/
#define DMA_RD_TCD13_SOFF(base)  (DMA_TCD13_SOFF_REG(base))
#define DMA_WR_TCD13_SOFF(base, value) (DMA_TCD13_SOFF_REG(base) = (value))
#define DMA_RMW_TCD13_SOFF(base, mask, value) (DMA_WR_TCD13_SOFF(base, (DMA_RD_TCD13_SOFF(base) & ~(mask)) | (value)))
#define DMA_SET_TCD13_SOFF(base, value) (DMA_WR_TCD13_SOFF(base, DMA_RD_TCD13_SOFF(base) |  (value)))
#define DMA_CLR_TCD13_SOFF(base, value) (DMA_WR_TCD13_SOFF(base, DMA_RD_TCD13_SOFF(base) & ~(value)))
#define DMA_TOG_TCD13_SOFF(base, value) (DMA_WR_TCD13_SOFF(base, DMA_RD_TCD13_SOFF(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_TCD13_ATTR - TCD Transfer Attributes
 ******************************************************************************/

/*!
 * @brief DMA_TCD13_ATTR - TCD Transfer Attributes (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_TCD13_ATTR register
 */
/*@{*/
#define DMA_RD_TCD13_ATTR(base)  (DMA_TCD13_ATTR_REG(base))
#define DMA_WR_TCD13_ATTR(base, value) (DMA_TCD13_ATTR_REG(base) = (value))
#define DMA_RMW_TCD13_ATTR(base, mask, value) (DMA_WR_TCD13_ATTR(base, (DMA_RD_TCD13_ATTR(base) & ~(mask)) | (value)))
#define DMA_SET_TCD13_ATTR(base, value) (DMA_WR_TCD13_ATTR(base, DMA_RD_TCD13_ATTR(base) |  (value)))
#define DMA_CLR_TCD13_ATTR(base, value) (DMA_WR_TCD13_ATTR(base, DMA_RD_TCD13_ATTR(base) & ~(value)))
#define DMA_TOG_TCD13_ATTR(base, value) (DMA_WR_TCD13_ATTR(base, DMA_RD_TCD13_ATTR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_TCD13_ATTR bitfields
 */

/*!
 * @name Register DMA_TCD13_ATTR, field DSIZE[2:0] (RW)
 *
 * See the SSIZE definition
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD13_ATTR_DSIZE field. */
#define DMA_RD_TCD13_ATTR_DSIZE(base) ((DMA_TCD13_ATTR_REG(base) & DMA_TCD13_ATTR_DSIZE_MASK) >> DMA_TCD13_ATTR_DSIZE_SHIFT)
#define DMA_BRD_TCD13_ATTR_DSIZE(base) (DMA_RD_TCD13_ATTR_DSIZE(base))

/*! @brief Set the DSIZE field to a new value. */
#define DMA_WR_TCD13_ATTR_DSIZE(base, value) (DMA_RMW_TCD13_ATTR(base, DMA_TCD13_ATTR_DSIZE_MASK, DMA_TCD13_ATTR_DSIZE(value)))
#define DMA_BWR_TCD13_ATTR_DSIZE(base, value) (DMA_WR_TCD13_ATTR_DSIZE(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD13_ATTR, field DMOD[7:3] (RW)
 *
 * See the SMOD definition
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD13_ATTR_DMOD field. */
#define DMA_RD_TCD13_ATTR_DMOD(base) ((DMA_TCD13_ATTR_REG(base) & DMA_TCD13_ATTR_DMOD_MASK) >> DMA_TCD13_ATTR_DMOD_SHIFT)
#define DMA_BRD_TCD13_ATTR_DMOD(base) (DMA_RD_TCD13_ATTR_DMOD(base))

/*! @brief Set the DMOD field to a new value. */
#define DMA_WR_TCD13_ATTR_DMOD(base, value) (DMA_RMW_TCD13_ATTR(base, DMA_TCD13_ATTR_DMOD_MASK, DMA_TCD13_ATTR_DMOD(value)))
#define DMA_BWR_TCD13_ATTR_DMOD(base, value) (DMA_WR_TCD13_ATTR_DMOD(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD13_ATTR, field SSIZE[10:8] (RW)
 *
 * Using a Reserved value causes a configuration error.
 *
 * Values:
 * - 0b000 - 8-bit
 * - 0b001 - 16-bit
 * - 0b010 - 32-bit
 * - 0b011 - Reserved
 * - 0b100 - 16-byte burst
 * - 0b101 - 32-byte burst
 * - 0b110 - Reserved
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD13_ATTR_SSIZE field. */
#define DMA_RD_TCD13_ATTR_SSIZE(base) ((DMA_TCD13_ATTR_REG(base) & DMA_TCD13_ATTR_SSIZE_MASK) >> DMA_TCD13_ATTR_SSIZE_SHIFT)
#define DMA_BRD_TCD13_ATTR_SSIZE(base) (DMA_RD_TCD13_ATTR_SSIZE(base))

/*! @brief Set the SSIZE field to a new value. */
#define DMA_WR_TCD13_ATTR_SSIZE(base, value) (DMA_RMW_TCD13_ATTR(base, DMA_TCD13_ATTR_SSIZE_MASK, DMA_TCD13_ATTR_SSIZE(value)))
#define DMA_BWR_TCD13_ATTR_SSIZE(base, value) (DMA_WR_TCD13_ATTR_SSIZE(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD13_ATTR, field SMOD[15:11] (RW)
 *
 * Values:
 * - 0b00000 - Source address modulo feature is disabled
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD13_ATTR_SMOD field. */
#define DMA_RD_TCD13_ATTR_SMOD(base) ((DMA_TCD13_ATTR_REG(base) & DMA_TCD13_ATTR_SMOD_MASK) >> DMA_TCD13_ATTR_SMOD_SHIFT)
#define DMA_BRD_TCD13_ATTR_SMOD(base) (DMA_RD_TCD13_ATTR_SMOD(base))

/*! @brief Set the SMOD field to a new value. */
#define DMA_WR_TCD13_ATTR_SMOD(base, value) (DMA_RMW_TCD13_ATTR(base, DMA_TCD13_ATTR_SMOD_MASK, DMA_TCD13_ATTR_SMOD(value)))
#define DMA_BWR_TCD13_ATTR_SMOD(base, value) (DMA_WR_TCD13_ATTR_SMOD(base, value))
/*@}*/

