nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * DMA_TCD14_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)
 ******************************************************************************/

/*!
 * @brief DMA_TCD14_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled) (RW)
 *
 * Reset value: 0x00000000U
 *
 * One of three registers (this register, TCD_NBYTES_MLNO, or
 * TCD_NBYTES_MLOFFNO), defines the number of bytes to transfer per request. Which register to use
 * depends on whether minor loop mapping is disabled, enabled but not used for
 * this channel, or enabled and used. TCD word 2 is defined as follows if: Minor
 * loop mapping is enabled (CR[EMLM] = 1) and Minor loop offset is enabled (SMLOE
 * or DMLOE = 1) If minor loop mapping is enabled and SMLOE and DMLOE are cleared,
 * then refer to the TCD_NBYTES_MLOFFNO register description. If minor loop
 * mapping is disabled, then refer to the TCD_NBYTES_MLNO register description.
 */
/*!
 * @name Constants and macros for entire DMA_TCD14_NBYTES_MLOFFYES register
 */
/*@{*/
#define DMA_RD_TCD14_NBYTES_MLOFFYES(base) (DMA_TCD14_NBYTES_MLOFFYES_REG(base))
#define DMA_WR_TCD14_NBYTES_MLOFFYES(base, value) (DMA_TCD14_NBYTES_MLOFFYES_REG(base) = (value))
#define DMA_RMW_TCD14_NBYTES_MLOFFYES(base, mask, value) (DMA_WR_TCD14_NBYTES_MLOFFYES(base, (DMA_RD_TCD14_NBYTES_MLOFFYES(base) & ~(mask)) | (value)))
#define DMA_SET_TCD14_NBYTES_MLOFFYES(base, value) (DMA_WR_TCD14_NBYTES_MLOFFYES(base, DMA_RD_TCD14_NBYTES_MLOFFYES(base) |  (value)))
#define DMA_CLR_TCD14_NBYTES_MLOFFYES(base, value) (DMA_WR_TCD14_NBYTES_MLOFFYES(base, DMA_RD_TCD14_NBYTES_MLOFFYES(base) & ~(value)))
#define DMA_TOG_TCD14_NBYTES_MLOFFYES(base, value) (DMA_WR_TCD14_NBYTES_MLOFFYES(base, DMA_RD_TCD14_NBYTES_MLOFFYES(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_TCD14_NBYTES_MLOFFYES bitfields
 */

/*!
 * @name Register DMA_TCD14_NBYTES_MLOFFYES, field NBYTES[9:0] (RW)
 *
 * Number of bytes to be transferred in each service request of the channel. As
 * a channel activates, the appropriate TCD contents load into the eDMA engine,
 * and the appropriate reads and writes perform until the minor byte transfer
 * count has transferred. This is an indivisible operation and cannot be halted. It
 * can, however, be stalled by using the bandwidth control field, or via
 * preemption. After the minor count is exhausted, the SADDR and DADDR values are written
 * back into the TCD memory, the major iteration count is decremented and
 * restored to the TCD memory. If the major iteration count is completed, additional
 * processing is performed.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD14_NBYTES_MLOFFYES_NBYTES field. */
#define DMA_RD_TCD14_NBYTES_MLOFFYES_NBYTES(base) ((DMA_TCD14_NBYTES_MLOFFYES_REG(base) & DMA_TCD14_NBYTES_MLOFFYES_NBYTES_MASK) >> DMA_TCD14_NBYTES_MLOFFYES_NBYTES_SHIFT)
#define DMA_BRD_TCD14_NBYTES_MLOFFYES_NBYTES(base) (DMA_RD_TCD14_NBYTES_MLOFFYES_NBYTES(base))

/*! @brief Set the NBYTES field to a new value. */
#define DMA_WR_TCD14_NBYTES_MLOFFYES_NBYTES(base, value) (DMA_RMW_TCD14_NBYTES_MLOFFYES(base, DMA_TCD14_NBYTES_MLOFFYES_NBYTES_MASK, DMA_TCD14_NBYTES_MLOFFYES_NBYTES(value)))
#define DMA_BWR_TCD14_NBYTES_MLOFFYES_NBYTES(base, value) (DMA_WR_TCD14_NBYTES_MLOFFYES_NBYTES(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD14_NBYTES_MLOFFYES, field MLOFF[29:10] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD14_NBYTES_MLOFFYES_MLOFF field. */
#define DMA_RD_TCD14_NBYTES_MLOFFYES_MLOFF(base) ((DMA_TCD14_NBYTES_MLOFFYES_REG(base) & DMA_TCD14_NBYTES_MLOFFYES_MLOFF_MASK) >> DMA_TCD14_NBYTES_MLOFFYES_MLOFF_SHIFT)
#define DMA_BRD_TCD14_NBYTES_MLOFFYES_MLOFF(base) (DMA_RD_TCD14_NBYTES_MLOFFYES_MLOFF(base))

/*! @brief Set the MLOFF field to a new value. */
#define DMA_WR_TCD14_NBYTES_MLOFFYES_MLOFF(base, value) (DMA_RMW_TCD14_NBYTES_MLOFFYES(base, DMA_TCD14_NBYTES_MLOFFYES_MLOFF_MASK, DMA_TCD14_NBYTES_MLOFFYES_MLOFF(value)))
#define DMA_BWR_TCD14_NBYTES_MLOFFYES_MLOFF(base, value) (DMA_WR_TCD14_NBYTES_MLOFFYES_MLOFF(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD14_NBYTES_MLOFFYES, field DMLOE[30] (RW)
 *
 * Selects whether the minor loop offset is applied to the destination address
 * upon minor loop completion.
 *
 * Values:
 * - 0b0 - The minor loop offset is not applied to the DADDR
 * - 0b1 - The minor loop offset is applied to the DADDR
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD14_NBYTES_MLOFFYES_DMLOE field. */
#define DMA_RD_TCD14_NBYTES_MLOFFYES_DMLOE(base) ((DMA_TCD14_NBYTES_MLOFFYES_REG(base) & DMA_TCD14_NBYTES_MLOFFYES_DMLOE_MASK) >> DMA_TCD14_NBYTES_MLOFFYES_DMLOE_SHIFT)
#define DMA_BRD_TCD14_NBYTES_MLOFFYES_DMLOE(base) (BITBAND_ACCESS32(&DMA_TCD14_NBYTES_MLOFFYES_REG(base), DMA_TCD14_NBYTES_MLOFFYES_DMLOE_SHIFT))

/*! @brief Set the DMLOE field to a new value. */
#define DMA_WR_TCD14_NBYTES_MLOFFYES_DMLOE(base, value) (DMA_RMW_TCD14_NBYTES_MLOFFYES(base, DMA_TCD14_NBYTES_MLOFFYES_DMLOE_MASK, DMA_TCD14_NBYTES_MLOFFYES_DMLOE(value)))
#define DMA_BWR_TCD14_NBYTES_MLOFFYES_DMLOE(base, value) (BITBAND_ACCESS32(&DMA_TCD14_NBYTES_MLOFFYES_REG(base), DMA_TCD14_NBYTES_MLOFFYES_DMLOE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_TCD14_NBYTES_MLOFFYES, field SMLOE[31] (RW)
 *
 * Selects whether the minor loop offset is applied to the source address upon
 * minor loop completion.
 *
 * Values:
 * - 0b0 - The minor loop offset is not applied to the SADDR
 * - 0b1 - The minor loop offset is applied to the SADDR
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD14_NBYTES_MLOFFYES_SMLOE field. */
#define DMA_RD_TCD14_NBYTES_MLOFFYES_SMLOE(base) ((DMA_TCD14_NBYTES_MLOFFYES_REG(base) & DMA_TCD14_NBYTES_MLOFFYES_SMLOE_MASK) >> DMA_TCD14_NBYTES_MLOFFYES_SMLOE_SHIFT)
#define DMA_BRD_TCD14_NBYTES_MLOFFYES_SMLOE(base) (BITBAND_ACCESS32(&DMA_TCD14_NBYTES_MLOFFYES_REG(base), DMA_TCD14_NBYTES_MLOFFYES_SMLOE_SHIFT))

/*! @brief Set the SMLOE field to a new value. */
#define DMA_WR_TCD14_NBYTES_MLOFFYES_SMLOE(base, value) (DMA_RMW_TCD14_NBYTES_MLOFFYES(base, DMA_TCD14_NBYTES_MLOFFYES_SMLOE_MASK, DMA_TCD14_NBYTES_MLOFFYES_SMLOE(value)))
#define DMA_BWR_TCD14_NBYTES_MLOFFYES_SMLOE(base, value) (BITBAND_ACCESS32(&DMA_TCD14_NBYTES_MLOFFYES_REG(base), DMA_TCD14_NBYTES_MLOFFYES_SMLOE_SHIFT) = (value))
/*@}*/

