nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the ESG field to a new value. */
#define DMA_WR_TCD14_CSR_ESG(base, value) (DMA_RMW_TCD14_CSR(base, DMA_TCD14_CSR_ESG_MASK, DMA_TCD14_CSR_ESG(value)))
#define DMA_BWR_TCD14_CSR_ESG(base, value) (BITBAND_ACCESS16(&DMA_TCD14_CSR_REG(base), DMA_TCD14_CSR_ESG_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_TCD14_CSR, field MAJORELINK[5] (RW)
 *
 * As the channel completes the major loop, this flag enables the linking to
 * another channel, defined by MAJORLINKCH. The link target channel initiates a
 * channel service request via an internal mechanism that sets the TCDn_CSR[START]
 * bit of the specified channel. To support the dynamic linking coherency model,
 * this field is forced to zero when written to while the TCDn_CSR[DONE] bit is set.
 *
 * Values:
 * - 0b0 - The channel-to-channel linking is disabled.
 * - 0b1 - The channel-to-channel linking is enabled.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD14_CSR_MAJORELINK field. */
#define DMA_RD_TCD14_CSR_MAJORELINK(base) ((DMA_TCD14_CSR_REG(base) & DMA_TCD14_CSR_MAJORELINK_MASK) >> DMA_TCD14_CSR_MAJORELINK_SHIFT)
#define DMA_BRD_TCD14_CSR_MAJORELINK(base) (BITBAND_ACCESS16(&DMA_TCD14_CSR_REG(base), DMA_TCD14_CSR_MAJORELINK_SHIFT))

/*! @brief Set the MAJORELINK field to a new value. */
#define DMA_WR_TCD14_CSR_MAJORELINK(base, value) (DMA_RMW_TCD14_CSR(base, DMA_TCD14_CSR_MAJORELINK_MASK, DMA_TCD14_CSR_MAJORELINK(value)))
#define DMA_BWR_TCD14_CSR_MAJORELINK(base, value) (BITBAND_ACCESS16(&DMA_TCD14_CSR_REG(base), DMA_TCD14_CSR_MAJORELINK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_TCD14_CSR, field ACTIVE[6] (RW)
 *
 * This flag signals the channel is currently in execution. It is set when
 * channel service begins, and is cleared by the eDMA as the minor loop completes or
 * when any error condition is detected.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD14_CSR_ACTIVE field. */
#define DMA_RD_TCD14_CSR_ACTIVE(base) ((DMA_TCD14_CSR_REG(base) & DMA_TCD14_CSR_ACTIVE_MASK) >> DMA_TCD14_CSR_ACTIVE_SHIFT)
#define DMA_BRD_TCD14_CSR_ACTIVE(base) (BITBAND_ACCESS16(&DMA_TCD14_CSR_REG(base), DMA_TCD14_CSR_ACTIVE_SHIFT))

/*! @brief Set the ACTIVE field to a new value. */
#define DMA_WR_TCD14_CSR_ACTIVE(base, value) (DMA_RMW_TCD14_CSR(base, DMA_TCD14_CSR_ACTIVE_MASK, DMA_TCD14_CSR_ACTIVE(value)))
#define DMA_BWR_TCD14_CSR_ACTIVE(base, value) (BITBAND_ACCESS16(&DMA_TCD14_CSR_REG(base), DMA_TCD14_CSR_ACTIVE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_TCD14_CSR, field DONE[7] (RW)
 *
 * This flag indicates the eDMA has completed the major loop. The eDMA engine
 * sets it as the CITER count reaches zero. The software clears it, or the hardware
 * when the channel is activated. This bit must be cleared to write the
 * MAJORELINK or ESG bits.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD14_CSR_DONE field. */
#define DMA_RD_TCD14_CSR_DONE(base) ((DMA_TCD14_CSR_REG(base) & DMA_TCD14_CSR_DONE_MASK) >> DMA_TCD14_CSR_DONE_SHIFT)
#define DMA_BRD_TCD14_CSR_DONE(base) (BITBAND_ACCESS16(&DMA_TCD14_CSR_REG(base), DMA_TCD14_CSR_DONE_SHIFT))

/*! @brief Set the DONE field to a new value. */
#define DMA_WR_TCD14_CSR_DONE(base, value) (DMA_RMW_TCD14_CSR(base, DMA_TCD14_CSR_DONE_MASK, DMA_TCD14_CSR_DONE(value)))
#define DMA_BWR_TCD14_CSR_DONE(base, value) (BITBAND_ACCESS16(&DMA_TCD14_CSR_REG(base), DMA_TCD14_CSR_DONE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_TCD14_CSR, field MAJORLINKCH[11:8] (RW)
 *
 * If (MAJORELINK = 0) then: No channel-to-channel linking, or chaining, is
 * performed after the major loop counter is exhausted. Otherwise: After the major
 * loop counter is exhausted, the eDMA engine initiates a channel service request
 * at the channel defined by this field by setting that channel's TCDn_CSR[START]
 * bit.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD14_CSR_MAJORLINKCH field. */
#define DMA_RD_TCD14_CSR_MAJORLINKCH(base) ((DMA_TCD14_CSR_REG(base) & DMA_TCD14_CSR_MAJORLINKCH_MASK) >> DMA_TCD14_CSR_MAJORLINKCH_SHIFT)
#define DMA_BRD_TCD14_CSR_MAJORLINKCH(base) (DMA_RD_TCD14_CSR_MAJORLINKCH(base))

/*! @brief Set the MAJORLINKCH field to a new value. */
#define DMA_WR_TCD14_CSR_MAJORLINKCH(base, value) (DMA_RMW_TCD14_CSR(base, DMA_TCD14_CSR_MAJORLINKCH_MASK, DMA_TCD14_CSR_MAJORLINKCH(value)))
#define DMA_BWR_TCD14_CSR_MAJORLINKCH(base, value) (DMA_WR_TCD14_CSR_MAJORLINKCH(base, value))
/*@}*/

/*!
 * @name Register DMA_TCD14_CSR, field BWC[15:14] (RW)
 *
 * Throttles the amount of bus bandwidth consumed by the eDMA. Generally, as the
 * eDMA processes the minor loop, it continuously generates read/write sequences
 * until the minor count is exhausted. This field forces the eDMA to stall after
 * the completion of each read/write access to control the bus request bandwidth
 * seen by the crossbar switch. If the source and destination sizes are equal,
 * this field is ignored between the first and second transfers and after the last
 * write of each minor loop. This behavior is a side effect of reducing start-up
 * latency.
 *
 * Values:
 * - 0b00 - No eDMA engine stalls
 * - 0b01 - Reserved
 * - 0b10 - eDMA engine stalls for 4 cycles after each R/W.
 * - 0b11 - eDMA engine stalls for 8 cycles after each R/W.
 */
/*@{*/
/*! @brief Read current value of the DMA_TCD14_CSR_BWC field. */
#define DMA_RD_TCD14_CSR_BWC(base) ((DMA_TCD14_CSR_REG(base) & DMA_TCD14_CSR_BWC_MASK) >> DMA_TCD14_CSR_BWC_SHIFT)
#define DMA_BRD_TCD14_CSR_BWC(base) (DMA_RD_TCD14_CSR_BWC(base))

/*! @brief Set the BWC field to a new value. */
#define DMA_WR_TCD14_CSR_BWC(base, value) (DMA_RMW_TCD14_CSR(base, DMA_TCD14_CSR_BWC_MASK, DMA_TCD14_CSR_BWC(value)))
#define DMA_BWR_TCD14_CSR_BWC(base, value) (DMA_WR_TCD14_CSR_BWC(base, value))
/*@}*/

/*******************************************************************************
 * DMA_TCD14_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 ******************************************************************************/

/*!
 * @brief DMA_TCD14_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled) (RW)
 *
 * Reset value: 0x0000U
 *
 * If the TCDn_BITER[ELINK] bit is cleared, the TCDn_BITER register is defined
 * as follows.
 */
/*!
 * @name Constants and macros for entire DMA_TCD14_BITER_ELINKNO register
 */
/*@{*/
#define DMA_RD_TCD14_BITER_ELINKNO(base) (DMA_TCD14_BITER_ELINKNO_REG(base))
#define DMA_WR_TCD14_BITER_ELINKNO(base, value) (DMA_TCD14_BITER_ELINKNO_REG(base) = (value))
#define DMA_RMW_TCD14_BITER_ELINKNO(base, mask, value) (DMA_WR_TCD14_BITER_ELINKNO(base, (DMA_RD_TCD14_BITER_ELINKNO(base) & ~(mask)) | (value)))
#define DMA_SET_TCD14_BITER_ELINKNO(base, value) (DMA_WR_TCD14_BITER_ELINKNO(base, DMA_RD_TCD14_BITER_ELINKNO(base) |  (value)))
#define DMA_CLR_TCD14_BITER_ELINKNO(base, value) (DMA_WR_TCD14_BITER_ELINKNO(base, DMA_RD_TCD14_BITER_ELINKNO(base) & ~(value)))
#define DMA_TOG_TCD14_BITER_ELINKNO(base, value) (DMA_WR_TCD14_BITER_ELINKNO(base, DMA_RD_TCD14_BITER_ELINKNO(base) ^  (value)))
/*@}*/

