nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * FLEXIO_TIMIEN - Timer Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief FLEXIO_TIMIEN - Timer Interrupt Enable Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
/*!
 * @name Constants and macros for entire FLEXIO_TIMIEN register
 */
/*@{*/
#define FLEXIO_RD_TIMIEN(base)   (FLEXIO_TIMIEN_REG(base))
#define FLEXIO_WR_TIMIEN(base, value) (FLEXIO_TIMIEN_REG(base) = (value))
#define FLEXIO_RMW_TIMIEN(base, mask, value) (FLEXIO_WR_TIMIEN(base, (FLEXIO_RD_TIMIEN(base) & ~(mask)) | (value)))
#define FLEXIO_SET_TIMIEN(base, value) (FLEXIO_WR_TIMIEN(base, FLEXIO_RD_TIMIEN(base) |  (value)))
#define FLEXIO_CLR_TIMIEN(base, value) (FLEXIO_WR_TIMIEN(base, FLEXIO_RD_TIMIEN(base) & ~(value)))
#define FLEXIO_TOG_TIMIEN(base, value) (FLEXIO_WR_TIMIEN(base, FLEXIO_RD_TIMIEN(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_TIMIEN bitfields
 */

/*!
 * @name Register FLEXIO_TIMIEN, field TEIE[3:0] (RW)
 *
 * Enables interrupt generation when corresponding TSF is set.
 *
 * Values:
 * - 0b0000 - Timer Status Flag interrupt is disabled
 * - 0b0001 - Timer Status Flag interrupt is enabled
 */
/*@{*/
/*! @brief Read current value of the FLEXIO_TIMIEN_TEIE field. */
#define FLEXIO_RD_TIMIEN_TEIE(base) ((FLEXIO_TIMIEN_REG(base) & FLEXIO_TIMIEN_TEIE_MASK) >> FLEXIO_TIMIEN_TEIE_SHIFT)
#define FLEXIO_BRD_TIMIEN_TEIE(base) (FLEXIO_RD_TIMIEN_TEIE(base))

/*! @brief Set the TEIE field to a new value. */
#define FLEXIO_WR_TIMIEN_TEIE(base, value) (FLEXIO_RMW_TIMIEN(base, FLEXIO_TIMIEN_TEIE_MASK, FLEXIO_TIMIEN_TEIE(value)))
#define FLEXIO_BWR_TIMIEN_TEIE(base, value) (FLEXIO_WR_TIMIEN_TEIE(base, value))
/*@}*/

/*******************************************************************************
 * FLEXIO_SHIFTSDEN - Shifter Status DMA Enable
 ******************************************************************************/

/*!
 * @brief FLEXIO_SHIFTSDEN - Shifter Status DMA Enable (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
/*!
 * @name Constants and macros for entire FLEXIO_SHIFTSDEN register
 */
/*@{*/
#define FLEXIO_RD_SHIFTSDEN(base) (FLEXIO_SHIFTSDEN_REG(base))
#define FLEXIO_WR_SHIFTSDEN(base, value) (FLEXIO_SHIFTSDEN_REG(base) = (value))
#define FLEXIO_RMW_SHIFTSDEN(base, mask, value) (FLEXIO_WR_SHIFTSDEN(base, (FLEXIO_RD_SHIFTSDEN(base) & ~(mask)) | (value)))
#define FLEXIO_SET_SHIFTSDEN(base, value) (FLEXIO_WR_SHIFTSDEN(base, FLEXIO_RD_SHIFTSDEN(base) |  (value)))
#define FLEXIO_CLR_SHIFTSDEN(base, value) (FLEXIO_WR_SHIFTSDEN(base, FLEXIO_RD_SHIFTSDEN(base) & ~(value)))
#define FLEXIO_TOG_SHIFTSDEN(base, value) (FLEXIO_WR_SHIFTSDEN(base, FLEXIO_RD_SHIFTSDEN(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_SHIFTSDEN bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTSDEN, field SSDE[3:0] (RW)
 *
 * Enables DMA request generation when corresponding SSF is set.
 *
 * Values:
 * - 0b0000 - Shifter Status Flag DMA request is disabled
 * - 0b0001 - Shifter Status Flag DMA request is enabled
 */
/*@{*/
/*! @brief Read current value of the FLEXIO_SHIFTSDEN_SSDE field. */
#define FLEXIO_RD_SHIFTSDEN_SSDE(base) ((FLEXIO_SHIFTSDEN_REG(base) & FLEXIO_SHIFTSDEN_SSDE_MASK) >> FLEXIO_SHIFTSDEN_SSDE_SHIFT)
#define FLEXIO_BRD_SHIFTSDEN_SSDE(base) (FLEXIO_RD_SHIFTSDEN_SSDE(base))

/*! @brief Set the SSDE field to a new value. */
#define FLEXIO_WR_SHIFTSDEN_SSDE(base, value) (FLEXIO_RMW_SHIFTSDEN(base, FLEXIO_SHIFTSDEN_SSDE_MASK, FLEXIO_SHIFTSDEN_SSDE(value)))
#define FLEXIO_BWR_SHIFTSDEN_SSDE(base, value) (FLEXIO_WR_SHIFTSDEN_SSDE(base, value))
/*@}*/

/*******************************************************************************
 * FLEXIO_SHIFTSTATE - Shifter State Register
 ******************************************************************************/

/*!
 * @brief FLEXIO_SHIFTSTATE - Shifter State Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
/*!
 * @name Constants and macros for entire FLEXIO_SHIFTSTATE register
 */
/*@{*/
#define FLEXIO_RD_SHIFTSTATE(base) (FLEXIO_SHIFTSTATE_REG(base))
#define FLEXIO_WR_SHIFTSTATE(base, value) (FLEXIO_SHIFTSTATE_REG(base) = (value))
#define FLEXIO_RMW_SHIFTSTATE(base, mask, value) (FLEXIO_WR_SHIFTSTATE(base, (FLEXIO_RD_SHIFTSTATE(base) & ~(mask)) | (value)))
#define FLEXIO_SET_SHIFTSTATE(base, value) (FLEXIO_WR_SHIFTSTATE(base, FLEXIO_RD_SHIFTSTATE(base) |  (value)))
#define FLEXIO_CLR_SHIFTSTATE(base, value) (FLEXIO_WR_SHIFTSTATE(base, FLEXIO_RD_SHIFTSTATE(base) & ~(value)))
#define FLEXIO_TOG_SHIFTSTATE(base, value) (FLEXIO_WR_SHIFTSTATE(base, FLEXIO_RD_SHIFTSTATE(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FLEXIO_SHIFTSTATE bitfields
 */

/*!
 * @name Register FLEXIO_SHIFTSTATE, field STATE[2:0] (RW)
 *
 * The current state field maintains a pointer to keep track of the current
 * Shifter (configured for State mode) enabled to drive outputs and compute the next
 * state. See 'State Mode' section for more detail.
 */
/*@{*/
/*! @brief Read current value of the FLEXIO_SHIFTSTATE_STATE field. */
#define FLEXIO_RD_SHIFTSTATE_STATE(base) ((FLEXIO_SHIFTSTATE_REG(base) & FLEXIO_SHIFTSTATE_STATE_MASK) >> FLEXIO_SHIFTSTATE_STATE_SHIFT)
#define FLEXIO_BRD_SHIFTSTATE_STATE(base) (FLEXIO_RD_SHIFTSTATE_STATE(base))

/*! @brief Set the STATE field to a new value. */
#define FLEXIO_WR_SHIFTSTATE_STATE(base, value) (FLEXIO_RMW_SHIFTSTATE(base, FLEXIO_SHIFTSTATE_STATE_MASK, FLEXIO_SHIFTSTATE_STATE(value)))
#define FLEXIO_BWR_SHIFTSTATE_STATE(base, value) (FLEXIO_WR_SHIFTSTATE_STATE(base, value))
/*@}*/

/*******************************************************************************
 * FLEXIO_SHIFTCTL - Shifter Control N Register
 ******************************************************************************/

/*!
 * @brief FLEXIO_SHIFTCTL - Shifter Control N Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * .
 */
/*!
 * @name Constants and macros for entire FLEXIO_SHIFTCTL register
 */
/*@{*/
#define FLEXIO_RD_SHIFTCTL(base, index) (FLEXIO_SHIFTCTL_REG(base, index))
#define FLEXIO_WR_SHIFTCTL(base, index, value) (FLEXIO_SHIFTCTL_REG(base, index) = (value))
#define FLEXIO_RMW_SHIFTCTL(base, index, mask, value) (FLEXIO_WR_SHIFTCTL(base, index, (FLEXIO_RD_SHIFTCTL(base, index) & ~(mask)) | (value)))
#define FLEXIO_SET_SHIFTCTL(base, index, value) (FLEXIO_WR_SHIFTCTL(base, index, FLEXIO_RD_SHIFTCTL(base, index) |  (value)))
#define FLEXIO_CLR_SHIFTCTL(base, index, value) (FLEXIO_WR_SHIFTCTL(base, index, FLEXIO_RD_SHIFTCTL(base, index) & ~(value)))
#define FLEXIO_TOG_SHIFTCTL(base, index, value) (FLEXIO_WR_SHIFTCTL(base, index, FLEXIO_RD_SHIFTCTL(base, index) ^  (value)))
/*@}*/

