nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the ACCERR field to a new value. */
#define FTFE_WR_FSTAT_ACCERR(base, value) (FTFE_RMW_FSTAT(base, (FTFE_FSTAT_ACCERR_MASK | FTFE_FSTAT_FPVIOL_MASK | FTFE_FSTAT_RDCOLERR_MASK | FTFE_FSTAT_CCIF_MASK), FTFE_FSTAT_ACCERR(value)))
#define FTFE_BWR_FSTAT_ACCERR(base, value) (BITBAND_ACCESS8(&FTFE_FSTAT_REG(base), FTFE_FSTAT_ACCERR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTFE_FSTAT, field RDCOLERR[6] (W1C)
 *
 * The RDCOLERR error bit indicates that the MCU attempted a read from an FTFE
 * resource that was being manipulated by an FTFE command (CCIF=0). Any
 * simultaneous access is detected as a collision error by the block arbitration logic. The
 * read data in this case cannot be guaranteed. The RDCOLERR bit is cleared by
 * writing a 1 to it. Writing a 0 to RDCOLERR has no effect.
 *
 * Values:
 * - 0b0 - No collision error detected
 * - 0b1 - Collision error detected
 */
/*@{*/
/*! @brief Read current value of the FTFE_FSTAT_RDCOLERR field. */
#define FTFE_RD_FSTAT_RDCOLERR(base) ((FTFE_FSTAT_REG(base) & FTFE_FSTAT_RDCOLERR_MASK) >> FTFE_FSTAT_RDCOLERR_SHIFT)
#define FTFE_BRD_FSTAT_RDCOLERR(base) (BITBAND_ACCESS8(&FTFE_FSTAT_REG(base), FTFE_FSTAT_RDCOLERR_SHIFT))

/*! @brief Set the RDCOLERR field to a new value. */
#define FTFE_WR_FSTAT_RDCOLERR(base, value) (FTFE_RMW_FSTAT(base, (FTFE_FSTAT_RDCOLERR_MASK | FTFE_FSTAT_FPVIOL_MASK | FTFE_FSTAT_ACCERR_MASK | FTFE_FSTAT_CCIF_MASK), FTFE_FSTAT_RDCOLERR(value)))
#define FTFE_BWR_FSTAT_RDCOLERR(base, value) (BITBAND_ACCESS8(&FTFE_FSTAT_REG(base), FTFE_FSTAT_RDCOLERR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTFE_FSTAT, field CCIF[7] (W1C)
 *
 * The CCIF flag indicates that a FTFE command or EEPROM file system operation
 * has completed. The CCIF flag is cleared by writing a 1 to CCIF to launch a
 * command, and CCIF stays low until command completion or command violation. The
 * CCIF flag is also cleared by a successful write to FlexRAM while enabled for EEE,
 * and CCIF stays low until the EEPROM file system has created the associated
 * EEPROM data record. The CCIF bit is reset to 0 but is set to 1 by the memory
 * controller at the end of the reset initialization sequence. Depending on how
 * quickly the read occurs after reset release, the user may or may not see the 0
 * hardware reset value.
 *
 * Values:
 * - 0b0 - FTFE command or EEPROM file system operation in progress
 * - 0b1 - FTFE command or EEPROM file system operation has completed
 */
/*@{*/
/*! @brief Read current value of the FTFE_FSTAT_CCIF field. */
#define FTFE_RD_FSTAT_CCIF(base) ((FTFE_FSTAT_REG(base) & FTFE_FSTAT_CCIF_MASK) >> FTFE_FSTAT_CCIF_SHIFT)
#define FTFE_BRD_FSTAT_CCIF(base) (BITBAND_ACCESS8(&FTFE_FSTAT_REG(base), FTFE_FSTAT_CCIF_SHIFT))

/*! @brief Set the CCIF field to a new value. */
#define FTFE_WR_FSTAT_CCIF(base, value) (FTFE_RMW_FSTAT(base, (FTFE_FSTAT_CCIF_MASK | FTFE_FSTAT_FPVIOL_MASK | FTFE_FSTAT_ACCERR_MASK | FTFE_FSTAT_RDCOLERR_MASK), FTFE_FSTAT_CCIF(value)))
#define FTFE_BWR_FSTAT_CCIF(base, value) (BITBAND_ACCESS8(&FTFE_FSTAT_REG(base), FTFE_FSTAT_CCIF_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * FTFE_FCNFG - Flash Configuration Register
 ******************************************************************************/

/*!
 * @brief FTFE_FCNFG - Flash Configuration Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register provides information on the current functional state of the
 * FTFE module. The erase control bits (ERSAREQ and ERSSUSP) have write
 * restrictions. PFLSH, RAMRDY, and EEERDY are read-only status bits. The reset values for
 * the PFLSH, RAMRDY, and EEERDY bits are determined during the reset sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_FCNFG register
 */
/*@{*/
#define FTFE_RD_FCNFG(base)      (FTFE_FCNFG_REG(base))
#define FTFE_WR_FCNFG(base, value) (FTFE_FCNFG_REG(base) = (value))
#define FTFE_RMW_FCNFG(base, mask, value) (FTFE_WR_FCNFG(base, (FTFE_RD_FCNFG(base) & ~(mask)) | (value)))
#define FTFE_SET_FCNFG(base, value) (FTFE_WR_FCNFG(base, FTFE_RD_FCNFG(base) |  (value)))
#define FTFE_CLR_FCNFG(base, value) (FTFE_WR_FCNFG(base, FTFE_RD_FCNFG(base) & ~(value)))
#define FTFE_TOG_FCNFG(base, value) (FTFE_WR_FCNFG(base, FTFE_RD_FCNFG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FTFE_FCNFG bitfields
 */

/*!
 * @name Register FTFE_FCNFG, field EEERDY[0] (RO)
 *
 * This flag indicates if the EEPROM backup data has been copied to the FlexRAM
 * and is therefore available for read access. During the reset sequence, the
 * EEERDY flag remains clear while CCIF=0 and only sets if the FlexNVM block is
 * partitioned for EEPROM.
 *
 * Values:
 * - 0b0 - FlexRAM is not available for EEPROM operation
 * - 0b1 - FlexRAM is available for EEPROM operations where: reads from the
 *     FlexRAM return data previously written to the FlexRAM in EEPROM mode and
 *     writes launch an EEPROM operation to store the written data in the FlexRAM and
 *     EEPROM backup
 */
/*@{*/
/*! @brief Read current value of the FTFE_FCNFG_EEERDY field. */
#define FTFE_RD_FCNFG_EEERDY(base) ((FTFE_FCNFG_REG(base) & FTFE_FCNFG_EEERDY_MASK) >> FTFE_FCNFG_EEERDY_SHIFT)
#define FTFE_BRD_FCNFG_EEERDY(base) (BITBAND_ACCESS8(&FTFE_FCNFG_REG(base), FTFE_FCNFG_EEERDY_SHIFT))
/*@}*/

/*!
 * @name Register FTFE_FCNFG, field RAMRDY[1] (RO)
 *
 * This flag indicates the current status of the FlexRAM. The state of the
 * RAMRDY flag is normally controlled by the Set FlexRAM Function command. During the
 * reset sequence, the RAMRDY flag is cleared if the FlexNVM block is partitioned
 * for EEPROM and will be set if the FlexNVM block is not partitioned for EEPROM
 * . The RAMRDY flag is cleared if the Program Partition command is run to
 * partition the FlexNVM block for EEPROM. The RAMRDY flag sets after completion of
 * the Erase All Blocks command or execution of the erase-all operation triggered
 * external to the FTFE.
 *
 * Values:
 * - 0b0 - FlexRAM is not available for traditional RAM access
 * - 0b1 - FlexRAM is available as traditional RAM only; writes to the FlexRAM
 *     do not trigger EEPROM operations
 */
/*@{*/
/*! @brief Read current value of the FTFE_FCNFG_RAMRDY field. */
#define FTFE_RD_FCNFG_RAMRDY(base) ((FTFE_FCNFG_REG(base) & FTFE_FCNFG_RAMRDY_MASK) >> FTFE_FCNFG_RAMRDY_SHIFT)
#define FTFE_BRD_FCNFG_RAMRDY(base) (BITBAND_ACCESS8(&FTFE_FCNFG_REG(base), FTFE_FCNFG_RAMRDY_SHIFT))
/*@}*/

/*!
 * @name Register FTFE_FCNFG, field PFLSH[2] (RO)
 *
 * Values:
 * - 0b0 - FTFE configuration supports two program flash blocks and two FlexNVM
 *     blocks
 * - 0b1 - Reserved
 */
/*@{*/
/*! @brief Read current value of the FTFE_FCNFG_PFLSH field. */
#define FTFE_RD_FCNFG_PFLSH(base) ((FTFE_FCNFG_REG(base) & FTFE_FCNFG_PFLSH_MASK) >> FTFE_FCNFG_PFLSH_SHIFT)
#define FTFE_BRD_FCNFG_PFLSH(base) (BITBAND_ACCESS8(&FTFE_FCNFG_REG(base), FTFE_FCNFG_PFLSH_SHIFT))
/*@}*/

/*!
 * @name Register FTFE_FCNFG, field ERSSUSP[4] (RW)
 *
 * The ERSSUSP bit allows the user to suspend (interrupt) the Erase Flash Sector
 * command while it is executing.
 *
 * Values:
 * - 0b0 - No suspend requested
 * - 0b1 - Suspend the current Erase Flash Sector command execution
 */
/*@{*/
/*! @brief Read current value of the FTFE_FCNFG_ERSSUSP field. */
#define FTFE_RD_FCNFG_ERSSUSP(base) ((FTFE_FCNFG_REG(base) & FTFE_FCNFG_ERSSUSP_MASK) >> FTFE_FCNFG_ERSSUSP_SHIFT)
#define FTFE_BRD_FCNFG_ERSSUSP(base) (BITBAND_ACCESS8(&FTFE_FCNFG_REG(base), FTFE_FCNFG_ERSSUSP_SHIFT))

