nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * FTFE_FOPT - Flash Option Register
 ******************************************************************************/

/*!
 * @brief FTFE_FOPT - Flash Option Register (RO)
 *
 * Reset value: 0x00U
 *
 * The flash option register allows the MCU to customize its operations by
 * examining the state of these read-only bits, which are loaded from NVM at reset.
 * The function of the bits is defined in the device's Chip Configuration details.
 * All bits in the register are read-only. During the reset sequence, the
 * register is loaded from the flash nonvolatile option byte in the Flash Configuration
 * Field located in program flash memory. The flash basis for the values is
 * signified by X in the reset value.
 */
/*!
 * @name Constants and macros for entire FTFE_FOPT register
 */
/*@{*/
#define FTFE_RD_FOPT(base)       (FTFE_FOPT_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB register
 */
/*@{*/
#define FTFE_RD_FCCOB(base, index) (FTFE_FCCOB_REG(base, index))
#define FTFE_WR_FCCOB(base, index, value) (FTFE_FCCOB_REG(base, index) = (value))
#define FTFE_RMW_FCCOB(base, index, mask, value) (FTFE_WR_FCCOB(base, index, (FTFE_RD_FCCOB(base, index) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB(base, index, value) (FTFE_WR_FCCOB(base, index, FTFE_RD_FCCOB(base, index) |  (value)))
#define FTFE_CLR_FCCOB(base, index, value) (FTFE_WR_FCCOB(base, index, FTFE_RD_FCCOB(base, index) & ~(value)))
#define FTFE_TOG_FCCOB(base, index, value) (FTFE_WR_FCCOB(base, index, FTFE_RD_FCCOB(base, index) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FPROT - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FPROT - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which program flash regions are protected from
 * program and erase operations. Protected flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any FTFE command. Unprotected regions can be changed by program and erase
 * operations. The four FPROT registers allow up to 32 protectable regions of equal
 * memory size. Program flash protection register Program flash protection bits
 * FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3 PROT[7:0] During
 * the reset sequence, the FPROT registers are loaded with the contents of the
 * program flash protection bytes in the Flash Configuration Field as indicated in
 * the following table. Program flash protection register Flash Configuration Field
 * offset address FPROT0 0x000B FPROT1 0x000A FPROT2 0x0009 FPROT3 0x0008 To
 * change the program flash protection that is loaded during the reset sequence,
 * unprotect the sector of program flash memory that contains the Flash
 * Configuration Field. Then, reprogram the program flash protection byte.
 */
/*!
 * @name Constants and macros for entire FTFE_FPROT register
 */
/*@{*/
#define FTFE_RD_FPROT(base, index) (FTFE_FPROT_REG(base, index))
#define FTFE_WR_FPROT(base, index, value) (FTFE_FPROT_REG(base, index) = (value))
#define FTFE_RMW_FPROT(base, index, mask, value) (FTFE_WR_FPROT(base, index, (FTFE_RD_FPROT(base, index) & ~(mask)) | (value)))
#define FTFE_SET_FPROT(base, index, value) (FTFE_WR_FPROT(base, index, FTFE_RD_FPROT(base, index) |  (value)))
#define FTFE_CLR_FPROT(base, index, value) (FTFE_WR_FPROT(base, index, FTFE_RD_FPROT(base, index) & ~(value)))
#define FTFE_TOG_FPROT(base, index, value) (FTFE_WR_FPROT(base, index, FTFE_RD_FPROT(base, index) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FEPROT - EEPROM Protection Register
 ******************************************************************************/

/*!
 * @brief FTFE_FEPROT - EEPROM Protection Register (RW)
 *
 * Reset value: 0x00U
 *
 * The FEPROT register defines which EEPROM regions of the FlexRAM are protected
 * against program and erase operations. Protected EEPROM regions cannot have
 * their content changed by writing to it. Unprotected regions can be changed by
 * writing to the FlexRAM.
 */
/*!
 * @name Constants and macros for entire FTFE_FEPROT register
 */
/*@{*/
#define FTFE_RD_FEPROT(base)     (FTFE_FEPROT_REG(base))
#define FTFE_WR_FEPROT(base, value) (FTFE_FEPROT_REG(base) = (value))
#define FTFE_RMW_FEPROT(base, mask, value) (FTFE_WR_FEPROT(base, (FTFE_RD_FEPROT(base) & ~(mask)) | (value)))
#define FTFE_SET_FEPROT(base, value) (FTFE_WR_FEPROT(base, FTFE_RD_FEPROT(base) |  (value)))
#define FTFE_CLR_FEPROT(base, value) (FTFE_WR_FEPROT(base, FTFE_RD_FEPROT(base) & ~(value)))
#define FTFE_TOG_FEPROT(base, value) (FTFE_WR_FEPROT(base, FTFE_RD_FEPROT(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FDPROT - Data Flash Protection Register
 ******************************************************************************/

/*!
 * @brief FTFE_FDPROT - Data Flash Protection Register (RW)
 *
 * Reset value: 0x00U
 *
 * The FDPROT register defines which data flash regions are protected against
 * program and erase operations. Protected Flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any FTFE command. Unprotected regions can be changed by both program and erase
 * operations.
 */
/*!
 * @name Constants and macros for entire FTFE_FDPROT register
 */
/*@{*/
#define FTFE_RD_FDPROT(base)     (FTFE_FDPROT_REG(base))
#define FTFE_WR_FDPROT(base, value) (FTFE_FDPROT_REG(base) = (value))
#define FTFE_RMW_FDPROT(base, mask, value) (FTFE_WR_FDPROT(base, (FTFE_RD_FDPROT(base) & ~(mask)) | (value)))
#define FTFE_SET_FDPROT(base, value) (FTFE_WR_FDPROT(base, FTFE_RD_FDPROT(base) |  (value)))
#define FTFE_CLR_FDPROT(base, value) (FTFE_WR_FDPROT(base, FTFE_RD_FDPROT(base) & ~(value)))
#define FTFE_TOG_FDPROT(base, value) (FTFE_WR_FDPROT(base, FTFE_RD_FDPROT(base) ^  (value)))
/*@}*/

