nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * FTFE_FERSTAT - Flash Error Status Register
 ******************************************************************************/

/*!
 * @brief FTFE_FERSTAT - Flash Error Status Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register reports the detection of uncorrected ECC errors during read
 * access to the FTFE module. The DFDIF flag is readable and writable. The
 * unassigned bits read 0 and are not writable.
 */
/*!
 * @name Constants and macros for entire FTFE_FERSTAT register
 */
/*@{*/
#define FTFE_RD_FERSTAT(base)    (FTFE_FERSTAT_REG(base))
#define FTFE_WR_FERSTAT(base, value) (FTFE_FERSTAT_REG(base) = (value))
#define FTFE_RMW_FERSTAT(base, mask, value) (FTFE_WR_FERSTAT(base, (FTFE_RD_FERSTAT(base) & ~(mask)) | (value)))
#define FTFE_SET_FERSTAT(base, value) (FTFE_WR_FERSTAT(base, FTFE_RD_FERSTAT(base) |  (value)))
#define FTFE_CLR_FERSTAT(base, value) (FTFE_WR_FERSTAT(base, FTFE_RD_FERSTAT(base) & ~(value)))
#define FTFE_TOG_FERSTAT(base, value) (FTFE_WR_FERSTAT(base, FTFE_RD_FERSTAT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FTFE_FERSTAT bitfields
 */

/*!
 * @name Register FTFE_FERSTAT, field DFDIF[1] (W1C)
 *
 * The DFDIF flag indicates an uncorrectable ECC fault was detected during a
 * valid flash read access from the platform flash controller. The DFDIF flag is
 * cleared by writing a 1 to it. Writing a 0 to DFDIF has no effect.
 *
 * Values:
 * - 0b0 - Double bit fault not detected during a valid flash read access from
 *     the platform flash controller
 * - 0b1 - Double bit fault detected (or FERCNFG[FDFD] is set) during a valid
 *     flash read access from the platform flash controller
 */
/*@{*/
/*! @brief Read current value of the FTFE_FERSTAT_DFDIF field. */
#define FTFE_RD_FERSTAT_DFDIF(base) ((FTFE_FERSTAT_REG(base) & FTFE_FERSTAT_DFDIF_MASK) >> FTFE_FERSTAT_DFDIF_SHIFT)
#define FTFE_BRD_FERSTAT_DFDIF(base) (BITBAND_ACCESS8(&FTFE_FERSTAT_REG(base), FTFE_FERSTAT_DFDIF_SHIFT))

/*! @brief Set the DFDIF field to a new value. */
#define FTFE_WR_FERSTAT_DFDIF(base, value) (FTFE_RMW_FERSTAT(base, FTFE_FERSTAT_DFDIF_MASK, FTFE_FERSTAT_DFDIF(value)))
#define FTFE_BWR_FERSTAT_DFDIF(base, value) (BITBAND_ACCESS8(&FTFE_FERSTAT_REG(base), FTFE_FERSTAT_DFDIF_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * FTFE_FERCNFG - Flash Error Configuration Register
 ******************************************************************************/

/*!
 * @brief FTFE_FERCNFG - Flash Error Configuration Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register enables the force and interrupt of uncorrected ECC errors
 * detected during read access to the FTFE module. The FDFD and DFDIE bits are
 * readable and writable. The unassigned bits read 0 and are not writable.
 */
/*!
 * @name Constants and macros for entire FTFE_FERCNFG register
 */
/*@{*/
#define FTFE_RD_FERCNFG(base)    (FTFE_FERCNFG_REG(base))
#define FTFE_WR_FERCNFG(base, value) (FTFE_FERCNFG_REG(base) = (value))
#define FTFE_RMW_FERCNFG(base, mask, value) (FTFE_WR_FERCNFG(base, (FTFE_RD_FERCNFG(base) & ~(mask)) | (value)))
#define FTFE_SET_FERCNFG(base, value) (FTFE_WR_FERCNFG(base, FTFE_RD_FERCNFG(base) |  (value)))
#define FTFE_CLR_FERCNFG(base, value) (FTFE_WR_FERCNFG(base, FTFE_RD_FERCNFG(base) & ~(value)))
#define FTFE_TOG_FERCNFG(base, value) (FTFE_WR_FERCNFG(base, FTFE_RD_FERCNFG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FTFE_FERCNFG bitfields
 */

/*!
 * @name Register FTFE_FERCNFG, field DFDIE[1] (RW)
 *
 * The DFDIE bit controls interrupt generation when an uncorrectable ECC fault
 * is detected during a valid flash read access from the platform flash controller.
 *
 * Values:
 * - 0b0 - Double bit fault detect interrupt disabled
 * - 0b1 - Double bit fault detect interrupt enabled. An interrupt request is
 *     generated whenever the FERSTAT[DFDIF] flag is set.
 */
/*@{*/
/*! @brief Read current value of the FTFE_FERCNFG_DFDIE field. */
#define FTFE_RD_FERCNFG_DFDIE(base) ((FTFE_FERCNFG_REG(base) & FTFE_FERCNFG_DFDIE_MASK) >> FTFE_FERCNFG_DFDIE_SHIFT)
#define FTFE_BRD_FERCNFG_DFDIE(base) (BITBAND_ACCESS8(&FTFE_FERCNFG_REG(base), FTFE_FERCNFG_DFDIE_SHIFT))

/*! @brief Set the DFDIE field to a new value. */
#define FTFE_WR_FERCNFG_DFDIE(base, value) (FTFE_RMW_FERCNFG(base, FTFE_FERCNFG_DFDIE_MASK, FTFE_FERCNFG_DFDIE(value)))
#define FTFE_BWR_FERCNFG_DFDIE(base, value) (BITBAND_ACCESS8(&FTFE_FERCNFG_REG(base), FTFE_FERCNFG_DFDIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTFE_FERCNFG, field FDFD[5] (RW)
 *
 * The FDFD bit enables the user to emulate the setting of the FERSTAT[DFDIF]
 * flag to check the associated interrupt routine. The FDFD bit is cleared by
 * writing a 0 to FDFD.
 *
 * Values:
 * - 0b0 - FERSTAT[DFDIF] sets only if a double bit fault is detected during
 *     read access from the platform flash controller
 * - 0b1 - FERSTAT[DFDIF] sets during any valid flash read access from the
 *     platform flash controller. An interrupt request is generated if the DFDIE bit
 *     is set.
 */
/*@{*/
/*! @brief Read current value of the FTFE_FERCNFG_FDFD field. */
#define FTFE_RD_FERCNFG_FDFD(base) ((FTFE_FERCNFG_REG(base) & FTFE_FERCNFG_FDFD_MASK) >> FTFE_FERCNFG_FDFD_SHIFT)
#define FTFE_BRD_FERCNFG_FDFD(base) (BITBAND_ACCESS8(&FTFE_FERCNFG_REG(base), FTFE_FERCNFG_FDFD_SHIFT))

/*! @brief Set the FDFD field to a new value. */
#define FTFE_WR_FERCNFG_FDFD(base, value) (FTFE_RMW_FERCNFG(base, FTFE_FERCNFG_FDFD_MASK, FTFE_FERCNFG_FDFD(value)))
#define FTFE_BWR_FERCNFG_FDFD(base, value) (BITBAND_ACCESS8(&FTFE_FERCNFG_REG(base), FTFE_FERCNFG_FDFD_SHIFT) = (value))
/*@}*/

/*
 * S32K144 FTM
 *
 * FlexTimer Module
 *
 * Registers defined in this header file:
 * - FTM_SC - Status And Control
 * - FTM_CNT - Counter
 * - FTM_MOD - Modulo
 * - FTM_C0SC - Channel (n) Status And Control
 * - FTM_C0V - Channel (n) Value
 * - FTM_C1SC - Channel (n) Status And Control
 * - FTM_C1V - Channel (n) Value
 * - FTM_C2SC - Channel (n) Status And Control
 * - FTM_C2V - Channel (n) Value
 * - FTM_C3SC - Channel (n) Status And Control
 * - FTM_C3V - Channel (n) Value
 * - FTM_C4SC - Channel (n) Status And Control
 * - FTM_C4V - Channel (n) Value
 * - FTM_C5SC - Channel (n) Status And Control
 * - FTM_C5V - Channel (n) Value
 * - FTM_C6SC - Channel (n) Status And Control
 * - FTM_C6V - Channel (n) Value
 * - FTM_C7SC - Channel (n) Status And Control
 * - FTM_C7V - Channel (n) Value
 * - FTM_CNTIN - Counter Initial Value
 * - FTM_STATUS - Capture And Compare Status
 * - FTM_MODE - Features Mode Selection
 * - FTM_SYNC - Synchronization
 * - FTM_OUTINIT - Initial State For Channels Output
 * - FTM_OUTMASK - Output Mask
 * - FTM_COMBINE - Function For Linked Channels
 * - FTM_DEADTIME - Deadtime Insertion Control
 * - FTM_EXTTRIG - FTM External Trigger
 * - FTM_POL - Channels Polarity
 * - FTM_FMS - Fault Mode Status
 * - FTM_FILTER - Input Capture Filter Control
 * - FTM_FLTCTRL - Fault Control
 * - FTM_QDCTRL - Quadrature Decoder Control And Status
 * - FTM_CONF - Configuration
 * - FTM_FLTPOL - FTM Fault Input Polarity
 * - FTM_SYNCONF - Synchronization Configuration
 * - FTM_INVCTRL - FTM Inverting Control
 * - FTM_SWOCTRL - FTM Software Output Control
 * - FTM_PWMLOAD - FTM PWM Load
 * - FTM_HCR - Half Cycle Register
 */

#define FTM_INSTANCE_COUNT (4U) /*!< Number of instances of the FTM module. */
#define FTM0_IDX (0U) /*!< Instance number for FTM0. */
#define FTM1_IDX (1U) /*!< Instance number for FTM1. */
#define FTM2_IDX (2U) /*!< Instance number for FTM2. */
#define FTM3_IDX (3U) /*!< Instance number for FTM3. */

