nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the TOF field to a new value. */
#define FTM_WR_SC_TOF(base, value) (FTM_RMW_SC(base, FTM_SC_TOF_MASK, FTM_SC_TOF(value)))
#define FTM_BWR_SC_TOF(base, value) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_TOF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_SC, field PWMEN0[16] (RW)
 *
 * This bit enables the PWM channel output. This bit should be set to 0 (output
 * disabled) when an input mode is used.
 *
 * Values:
 * - 0b0 - Channel output port is disabled
 * - 0b1 - Channel output port is enabled
 */
/*@{*/
/*! @brief Read current value of the FTM_SC_PWMEN0 field. */
#define FTM_RD_SC_PWMEN0(base) ((FTM_SC_REG(base) & FTM_SC_PWMEN0_MASK) >> FTM_SC_PWMEN0_SHIFT)
#define FTM_BRD_SC_PWMEN0(base) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN0_SHIFT))

/*! @brief Set the PWMEN0 field to a new value. */
#define FTM_WR_SC_PWMEN0(base, value) (FTM_RMW_SC(base, FTM_SC_PWMEN0_MASK, FTM_SC_PWMEN0(value)))
#define FTM_BWR_SC_PWMEN0(base, value) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_SC, field PWMEN1[17] (RW)
 *
 * This bit enables the PWM channel output. This bit should be set to 0 (output
 * disabled) when an input mode is used.
 *
 * Values:
 * - 0b0 - Channel output port is disabled
 * - 0b1 - Channel output port is enabled
 */
/*@{*/
/*! @brief Read current value of the FTM_SC_PWMEN1 field. */
#define FTM_RD_SC_PWMEN1(base) ((FTM_SC_REG(base) & FTM_SC_PWMEN1_MASK) >> FTM_SC_PWMEN1_SHIFT)
#define FTM_BRD_SC_PWMEN1(base) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN1_SHIFT))

/*! @brief Set the PWMEN1 field to a new value. */
#define FTM_WR_SC_PWMEN1(base, value) (FTM_RMW_SC(base, FTM_SC_PWMEN1_MASK, FTM_SC_PWMEN1(value)))
#define FTM_BWR_SC_PWMEN1(base, value) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_SC, field PWMEN2[18] (RW)
 *
 * This bit enables the PWM channel output. This bit should be set to 0 (output
 * disabled) when an input mode is used.
 *
 * Values:
 * - 0b0 - Channel output port is disabled
 * - 0b1 - Channel output port is enabled
 */
/*@{*/
/*! @brief Read current value of the FTM_SC_PWMEN2 field. */
#define FTM_RD_SC_PWMEN2(base) ((FTM_SC_REG(base) & FTM_SC_PWMEN2_MASK) >> FTM_SC_PWMEN2_SHIFT)
#define FTM_BRD_SC_PWMEN2(base) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN2_SHIFT))

/*! @brief Set the PWMEN2 field to a new value. */
#define FTM_WR_SC_PWMEN2(base, value) (FTM_RMW_SC(base, FTM_SC_PWMEN2_MASK, FTM_SC_PWMEN2(value)))
#define FTM_BWR_SC_PWMEN2(base, value) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_SC, field PWMEN3[19] (RW)
 *
 * This bit enables the PWM channel output. This bit should be set to 0 (output
 * disabled) when an input mode is used.
 *
 * Values:
 * - 0b0 - Channel output port is disabled
 * - 0b1 - Channel output port is enabled
 */
/*@{*/
/*! @brief Read current value of the FTM_SC_PWMEN3 field. */
#define FTM_RD_SC_PWMEN3(base) ((FTM_SC_REG(base) & FTM_SC_PWMEN3_MASK) >> FTM_SC_PWMEN3_SHIFT)
#define FTM_BRD_SC_PWMEN3(base) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN3_SHIFT))

/*! @brief Set the PWMEN3 field to a new value. */
#define FTM_WR_SC_PWMEN3(base, value) (FTM_RMW_SC(base, FTM_SC_PWMEN3_MASK, FTM_SC_PWMEN3(value)))
#define FTM_BWR_SC_PWMEN3(base, value) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_SC, field PWMEN4[20] (RW)
 *
 * This bit enables the PWM channel output. This bit should be set to 0 (output
 * disabled) when an input mode is used.
 *
 * Values:
 * - 0b0 - Channel output port is disabled
 * - 0b1 - Channel output port is enabled
 */
/*@{*/
/*! @brief Read current value of the FTM_SC_PWMEN4 field. */
#define FTM_RD_SC_PWMEN4(base) ((FTM_SC_REG(base) & FTM_SC_PWMEN4_MASK) >> FTM_SC_PWMEN4_SHIFT)
#define FTM_BRD_SC_PWMEN4(base) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN4_SHIFT))

/*! @brief Set the PWMEN4 field to a new value. */
#define FTM_WR_SC_PWMEN4(base, value) (FTM_RMW_SC(base, FTM_SC_PWMEN4_MASK, FTM_SC_PWMEN4(value)))
#define FTM_BWR_SC_PWMEN4(base, value) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN4_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_SC, field PWMEN5[21] (RW)
 *
 * This bit enables the PWM channel output. This bit should be set to 0 (output
 * disabled) when an input mode is used.
 *
 * Values:
 * - 0b0 - Channel output port is disabled
 * - 0b1 - Channel output port is enabled
 */
/*@{*/
/*! @brief Read current value of the FTM_SC_PWMEN5 field. */
#define FTM_RD_SC_PWMEN5(base) ((FTM_SC_REG(base) & FTM_SC_PWMEN5_MASK) >> FTM_SC_PWMEN5_SHIFT)
#define FTM_BRD_SC_PWMEN5(base) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN5_SHIFT))

/*! @brief Set the PWMEN5 field to a new value. */
#define FTM_WR_SC_PWMEN5(base, value) (FTM_RMW_SC(base, FTM_SC_PWMEN5_MASK, FTM_SC_PWMEN5(value)))
#define FTM_BWR_SC_PWMEN5(base, value) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN5_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_SC, field PWMEN6[22] (RW)
 *
 * This bit enables the PWM channel output. This bit should be set to 0 (output
 * disabled) when an input mode is used.
 *
 * Values:
 * - 0b0 - Channel output port is disabled
 * - 0b1 - Channel output port is enabled
 */
/*@{*/
/*! @brief Read current value of the FTM_SC_PWMEN6 field. */
#define FTM_RD_SC_PWMEN6(base) ((FTM_SC_REG(base) & FTM_SC_PWMEN6_MASK) >> FTM_SC_PWMEN6_SHIFT)
#define FTM_BRD_SC_PWMEN6(base) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN6_SHIFT))

/*! @brief Set the PWMEN6 field to a new value. */
#define FTM_WR_SC_PWMEN6(base, value) (FTM_RMW_SC(base, FTM_SC_PWMEN6_MASK, FTM_SC_PWMEN6(value)))
#define FTM_BWR_SC_PWMEN6(base, value) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN6_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_SC, field PWMEN7[23] (RW)
 *
 * This bit enables the PWM channel output. This bit should be set to 0 (output
 * disabled) when an input mode is used.
 *
 * Values:
 * - 0b0 - Channel output port is disabled
 * - 0b1 - Channel output port is enabled
 */
/*@{*/
/*! @brief Read current value of the FTM_SC_PWMEN7 field. */
#define FTM_RD_SC_PWMEN7(base) ((FTM_SC_REG(base) & FTM_SC_PWMEN7_MASK) >> FTM_SC_PWMEN7_SHIFT)
#define FTM_BRD_SC_PWMEN7(base) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN7_SHIFT))

/*! @brief Set the PWMEN7 field to a new value. */
#define FTM_WR_SC_PWMEN7(base, value) (FTM_RMW_SC(base, FTM_SC_PWMEN7_MASK, FTM_SC_PWMEN7(value)))
#define FTM_BWR_SC_PWMEN7(base, value) (BITBAND_ACCESS32(&FTM_SC_REG(base), FTM_SC_PWMEN7_SHIFT) = (value))
/*@}*/

