nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual FTM_C0SC bitfields
 */

/*!
 * @name Register FTM_C0SC, field DMA[0] (RW)
 *
 * Enables DMA transfers for the channel.
 *
 * Values:
 * - 0b0 - Disable DMA transfers.
 * - 0b1 - Enable DMA transfers.
 */
/*@{*/
/*! @brief Read current value of the FTM_C0SC_DMA field. */
#define FTM_RD_C0SC_DMA(base) ((FTM_C0SC_REG(base) & FTM_C0SC_DMA_MASK) >> FTM_C0SC_DMA_SHIFT)
#define FTM_BRD_C0SC_DMA(base) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_DMA_SHIFT))

/*! @brief Set the DMA field to a new value. */
#define FTM_WR_C0SC_DMA(base, value) (FTM_RMW_C0SC(base, FTM_C0SC_DMA_MASK, FTM_C0SC_DMA(value)))
#define FTM_BWR_C0SC_DMA(base, value) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_DMA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C0SC, field ICRST[1] (RW)
 *
 * FTM counter reset is driven by the selected event of the channel (n) in the
 * Input Capture mode. This field is write protected. It can be written only when
 * MODE[WPDIS] = 1.
 *
 * Values:
 * - 0b0 - FTM counter is not reset when the selected channel (n) input event is
 *     detected.
 * - 0b1 - FTM counter is reset when the selected channel (n) input event is
 *     detected.
 */
/*@{*/
/*! @brief Read current value of the FTM_C0SC_ICRST field. */
#define FTM_RD_C0SC_ICRST(base) ((FTM_C0SC_REG(base) & FTM_C0SC_ICRST_MASK) >> FTM_C0SC_ICRST_SHIFT)
#define FTM_BRD_C0SC_ICRST(base) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_ICRST_SHIFT))

/*! @brief Set the ICRST field to a new value. */
#define FTM_WR_C0SC_ICRST(base, value) (FTM_RMW_C0SC(base, FTM_C0SC_ICRST_MASK, FTM_C0SC_ICRST(value)))
#define FTM_BWR_C0SC_ICRST(base, value) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_ICRST_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C0SC, field ELSA[2] (RW)
 *
 * The functionality of ELSB and ELSA depends on the channel mode. See the
 * table. This field is write protected. It can be written only when MODE[WPDIS] = 1.
 */
/*@{*/
/*! @brief Read current value of the FTM_C0SC_ELSA field. */
#define FTM_RD_C0SC_ELSA(base) ((FTM_C0SC_REG(base) & FTM_C0SC_ELSA_MASK) >> FTM_C0SC_ELSA_SHIFT)
#define FTM_BRD_C0SC_ELSA(base) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_ELSA_SHIFT))

/*! @brief Set the ELSA field to a new value. */
#define FTM_WR_C0SC_ELSA(base, value) (FTM_RMW_C0SC(base, FTM_C0SC_ELSA_MASK, FTM_C0SC_ELSA(value)))
#define FTM_BWR_C0SC_ELSA(base, value) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_ELSA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C0SC, field ELSB[3] (RW)
 *
 * The functionality of ELSB and ELSA depends on the channel mode. See the
 * table. This field is write protected. It can be written only when MODE[WPDIS] = 1.
 */
/*@{*/
/*! @brief Read current value of the FTM_C0SC_ELSB field. */
#define FTM_RD_C0SC_ELSB(base) ((FTM_C0SC_REG(base) & FTM_C0SC_ELSB_MASK) >> FTM_C0SC_ELSB_SHIFT)
#define FTM_BRD_C0SC_ELSB(base) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_ELSB_SHIFT))

/*! @brief Set the ELSB field to a new value. */
#define FTM_WR_C0SC_ELSB(base, value) (FTM_RMW_C0SC(base, FTM_C0SC_ELSB_MASK, FTM_C0SC_ELSB(value)))
#define FTM_BWR_C0SC_ELSB(base, value) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_ELSB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C0SC, field MSA[4] (RW)
 *
 * Used for further selections in the channel logic. Its functionality is
 * dependent on the channel mode. See the table. This field is write protected. It can
 * be written only when MODE[WPDIS] = 1.
 */
/*@{*/
/*! @brief Read current value of the FTM_C0SC_MSA field. */
#define FTM_RD_C0SC_MSA(base) ((FTM_C0SC_REG(base) & FTM_C0SC_MSA_MASK) >> FTM_C0SC_MSA_SHIFT)
#define FTM_BRD_C0SC_MSA(base) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_MSA_SHIFT))

/*! @brief Set the MSA field to a new value. */
#define FTM_WR_C0SC_MSA(base, value) (FTM_RMW_C0SC(base, FTM_C0SC_MSA_MASK, FTM_C0SC_MSA(value)))
#define FTM_BWR_C0SC_MSA(base, value) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_MSA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C0SC, field MSB[5] (RW)
 *
 * Used for further selections in the channel logic. Its functionality is
 * dependent on the channel mode. See the table. This field is write protected. It can
 * be written only when MODE[WPDIS] = 1.
 */
/*@{*/
/*! @brief Read current value of the FTM_C0SC_MSB field. */
#define FTM_RD_C0SC_MSB(base) ((FTM_C0SC_REG(base) & FTM_C0SC_MSB_MASK) >> FTM_C0SC_MSB_SHIFT)
#define FTM_BRD_C0SC_MSB(base) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_MSB_SHIFT))

/*! @brief Set the MSB field to a new value. */
#define FTM_WR_C0SC_MSB(base, value) (FTM_RMW_C0SC(base, FTM_C0SC_MSB_MASK, FTM_C0SC_MSB(value)))
#define FTM_BWR_C0SC_MSB(base, value) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_MSB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C0SC, field CHIE[6] (RW)
 *
 * Enables channel interrupts.
 *
 * Values:
 * - 0b0 - Disable channel interrupts. Use software polling.
 * - 0b1 - Enable channel interrupts.
 */
/*@{*/
/*! @brief Read current value of the FTM_C0SC_CHIE field. */
#define FTM_RD_C0SC_CHIE(base) ((FTM_C0SC_REG(base) & FTM_C0SC_CHIE_MASK) >> FTM_C0SC_CHIE_SHIFT)
#define FTM_BRD_C0SC_CHIE(base) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_CHIE_SHIFT))

/*! @brief Set the CHIE field to a new value. */
#define FTM_WR_C0SC_CHIE(base, value) (FTM_RMW_C0SC(base, FTM_C0SC_CHIE_MASK, FTM_C0SC_CHIE(value)))
#define FTM_BWR_C0SC_CHIE(base, value) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_CHIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C0SC, field CHF[7] (ROWZ)
 *
 * Set by hardware when an event occurs on the channel. CHF is cleared by
 * reading the CSC register while CHnF is set and then writing a 0 to the CHF bit.
 * Writing a 1 to CHF has no effect. If another event occurs between the read and
 * write operations, the write operation has no effect; therefore, CHF remains set
 * indicating an event has occurred. In this case a CHF interrupt request is not
 * lost due to the clearing sequence for a previous CHF.
 *
 * Values:
 * - 0b0 - No channel event has occurred.
 * - 0b1 - A channel event has occurred.
 */
/*@{*/
/*! @brief Read current value of the FTM_C0SC_CHF field. */
#define FTM_RD_C0SC_CHF(base) ((FTM_C0SC_REG(base) & FTM_C0SC_CHF_MASK) >> FTM_C0SC_CHF_SHIFT)
#define FTM_BRD_C0SC_CHF(base) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_CHF_SHIFT))

/*! @brief Set the CHF field to a new value. */
#define FTM_WR_C0SC_CHF(base, value) (FTM_RMW_C0SC(base, FTM_C0SC_CHF_MASK, FTM_C0SC_CHF(value)))
#define FTM_BWR_C0SC_CHF(base, value) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_CHF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C0SC, field TRIGMODE[8] (RW)
 *
 * This bit controls the trigger generation on FTM channel outputs. This mode is
 * allowed only when FTM channel is configured to EPWM (up counting) or CPWM
 * (up-down counting) modes. If a match in the channel occurs, a trigger pulse with
 * one FTM clock cycle width will be generated in the channel output. See Channel
 * trigger output for more details about trigger mode feature. This field is
 * write protected. It can be written only when MODE[WPDIS] = 1.
 *
 * Values:
 * - 0b0 - Channel outputs will generate the normal PWM outputs without
 *     generating a pulse.
 * - 0b1 - If a match in the channel occurs, a trigger generation on channel
 *     output will happen. The trigger pulse width has one FTM clock cycle.
 */
/*@{*/
/*! @brief Read current value of the FTM_C0SC_TRIGMODE field. */
#define FTM_RD_C0SC_TRIGMODE(base) ((FTM_C0SC_REG(base) & FTM_C0SC_TRIGMODE_MASK) >> FTM_C0SC_TRIGMODE_SHIFT)
#define FTM_BRD_C0SC_TRIGMODE(base) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_TRIGMODE_SHIFT))

/*! @brief Set the TRIGMODE field to a new value. */
#define FTM_WR_C0SC_TRIGMODE(base, value) (FTM_RMW_C0SC(base, FTM_C0SC_TRIGMODE_MASK, FTM_C0SC_TRIGMODE(value)))
#define FTM_BWR_C0SC_TRIGMODE(base, value) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_TRIGMODE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C0SC, field CHIS[9] (RO)
 *
 * This bit returns the value of channel input pin after filter mechanism (if
 * enabled to the specific channel).
 *
 * Values:
 * - 0b0 - Channel input pin is at low state.
 * - 0b1 - Channel input pin is at high state.
 */
/*@{*/
/*! @brief Read current value of the FTM_C0SC_CHIS field. */
#define FTM_RD_C0SC_CHIS(base) ((FTM_C0SC_REG(base) & FTM_C0SC_CHIS_MASK) >> FTM_C0SC_CHIS_SHIFT)
#define FTM_BRD_C0SC_CHIS(base) (BITBAND_ACCESS32(&FTM_C0SC_REG(base), FTM_C0SC_CHIS_SHIFT))
/*@}*/

