nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * FTM_C4V - Channel (n) Value
 ******************************************************************************/

/*!
 * @brief FTM_C4V - Channel (n) Value (RW)
 *
 * Reset value: 0x00000000U
 *
 * These registers contain the captured FTM counter value for the input modes or
 * the match value for the output modes. In Input Capture, Capture Test, and
 * Dual Edge Capture modes, any write to a CnV register is ignored. In output modes,
 * writing to a CnV register latches the value into a buffer. A CnV register is
 * updated with the value of its write buffer according to Registers updated from
 * write buffers. If FTMEN = 0, this write coherency mechanism may be manually
 * reset by writing to the CnSC register whether Debug mode is active or not.
 */
/*!
 * @name Constants and macros for entire FTM_C4V register
 */
/*@{*/
#define FTM_RD_C4V(base)         (FTM_C4V_REG(base))
#define FTM_WR_C4V(base, value)  (FTM_C4V_REG(base) = (value))
#define FTM_RMW_C4V(base, mask, value) (FTM_WR_C4V(base, (FTM_RD_C4V(base) & ~(mask)) | (value)))
#define FTM_SET_C4V(base, value) (FTM_WR_C4V(base, FTM_RD_C4V(base) |  (value)))
#define FTM_CLR_C4V(base, value) (FTM_WR_C4V(base, FTM_RD_C4V(base) & ~(value)))
#define FTM_TOG_C4V(base, value) (FTM_WR_C4V(base, FTM_RD_C4V(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FTM_C4V bitfields
 */

/*!
 * @name Register FTM_C4V, field VAL[15:0] (RW)
 *
 * Captured FTM counter value of the input modes or the match value for the
 * output modes
 */
/*@{*/
/*! @brief Read current value of the FTM_C4V_VAL field. */
#define FTM_RD_C4V_VAL(base) ((FTM_C4V_REG(base) & FTM_C4V_VAL_MASK) >> FTM_C4V_VAL_SHIFT)
#define FTM_BRD_C4V_VAL(base) (FTM_RD_C4V_VAL(base))

/*! @brief Set the VAL field to a new value. */
#define FTM_WR_C4V_VAL(base, value) (FTM_RMW_C4V(base, FTM_C4V_VAL_MASK, FTM_C4V_VAL(value)))
#define FTM_BWR_C4V_VAL(base, value) (FTM_WR_C4V_VAL(base, value))
/*@}*/

/*******************************************************************************
 * FTM_C5SC - Channel (n) Status And Control
 ******************************************************************************/

/*!
 * @brief FTM_C5SC - Channel (n) Status And Control (RW)
 *
 * Reset value: 0x00000000U
 *
 * CnSC contains the channel-interrupt-status flag and control bits used to
 * configure the interrupt enable, channel configuration, and pin function. This
 * register also contains the trigger mode control and input pin state bits. Mode,
 * edge, and level selection DECAPEN COMBINE CPWMS MSnB:MSnA ELSnB:ELSnA Mode
 * Configuration X X X XX 00 Pin not used for FTM-revert the channel pin to general
 * purpose I/O or other peripheral control 0 0 0 00 01 Input Capture Capture on
 * Rising Edge Only 10 Capture on Falling Edge Only 11 Capture on Rising or Falling
 * Edge 01 01 Output Compare Toggle Output on match 10 Clear Output on match 11
 * Set Output on match 1X 10 Edge-Aligned PWM High-true pulses (clear Output on
 * match) X1 Low-true pulses (set Output on match) 1 XX 10 Center-Aligned PWM
 * High-true pulses (clear Output on match-up) X1 Low-true pulses (set Output on
 * match-up) 1 0 XX 10 Combine PWM High-true pulses (set on channel (n) match, and
 * clear on channel (n+1) match) X1 Low-true pulses (clear on channel (n) match, and
 * set on channel (n+1) match) 1 0 0 X0 See the table. Dual Edge Capture
 * One-Shot Capture mode X1 Continuous Capture mode Dual Edge Capture mode - edge
 * polarity selection ELSnB ELSnA Channel Port Enable Detected Edges 0 0 Disabled No
 * edge 0 1 Enabled Rising edge 1 0 Enabled Falling edge 1 1 Enabled Rising and
 * falling edges
 */
/*!
 * @name Constants and macros for entire FTM_C5SC register
 */
/*@{*/
#define FTM_RD_C5SC(base)        (FTM_C5SC_REG(base))
#define FTM_WR_C5SC(base, value) (FTM_C5SC_REG(base) = (value))
#define FTM_RMW_C5SC(base, mask, value) (FTM_WR_C5SC(base, (FTM_RD_C5SC(base) & ~(mask)) | (value)))
#define FTM_SET_C5SC(base, value) (FTM_WR_C5SC(base, FTM_RD_C5SC(base) |  (value)))
#define FTM_CLR_C5SC(base, value) (FTM_WR_C5SC(base, FTM_RD_C5SC(base) & ~(value)))
#define FTM_TOG_C5SC(base, value) (FTM_WR_C5SC(base, FTM_RD_C5SC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FTM_C5SC bitfields
 */

/*!
 * @name Register FTM_C5SC, field DMA[0] (RW)
 *
 * Enables DMA transfers for the channel.
 *
 * Values:
 * - 0b0 - Disable DMA transfers.
 * - 0b1 - Enable DMA transfers.
 */
/*@{*/
/*! @brief Read current value of the FTM_C5SC_DMA field. */
#define FTM_RD_C5SC_DMA(base) ((FTM_C5SC_REG(base) & FTM_C5SC_DMA_MASK) >> FTM_C5SC_DMA_SHIFT)
#define FTM_BRD_C5SC_DMA(base) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_DMA_SHIFT))

/*! @brief Set the DMA field to a new value. */
#define FTM_WR_C5SC_DMA(base, value) (FTM_RMW_C5SC(base, FTM_C5SC_DMA_MASK, FTM_C5SC_DMA(value)))
#define FTM_BWR_C5SC_DMA(base, value) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_DMA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C5SC, field ICRST[1] (RW)
 *
 * FTM counter reset is driven by the selected event of the channel (n) in the
 * Input Capture mode. This field is write protected. It can be written only when
 * MODE[WPDIS] = 1.
 *
 * Values:
 * - 0b0 - FTM counter is not reset when the selected channel (n) input event is
 *     detected.
 * - 0b1 - FTM counter is reset when the selected channel (n) input event is
 *     detected.
 */
/*@{*/
/*! @brief Read current value of the FTM_C5SC_ICRST field. */
#define FTM_RD_C5SC_ICRST(base) ((FTM_C5SC_REG(base) & FTM_C5SC_ICRST_MASK) >> FTM_C5SC_ICRST_SHIFT)
#define FTM_BRD_C5SC_ICRST(base) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_ICRST_SHIFT))

/*! @brief Set the ICRST field to a new value. */
#define FTM_WR_C5SC_ICRST(base, value) (FTM_RMW_C5SC(base, FTM_C5SC_ICRST_MASK, FTM_C5SC_ICRST(value)))
#define FTM_BWR_C5SC_ICRST(base, value) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_ICRST_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C5SC, field ELSA[2] (RW)
 *
 * The functionality of ELSB and ELSA depends on the channel mode. See the
 * table. This field is write protected. It can be written only when MODE[WPDIS] = 1.
 */
/*@{*/
/*! @brief Read current value of the FTM_C5SC_ELSA field. */
#define FTM_RD_C5SC_ELSA(base) ((FTM_C5SC_REG(base) & FTM_C5SC_ELSA_MASK) >> FTM_C5SC_ELSA_SHIFT)
#define FTM_BRD_C5SC_ELSA(base) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_ELSA_SHIFT))

/*! @brief Set the ELSA field to a new value. */
#define FTM_WR_C5SC_ELSA(base, value) (FTM_RMW_C5SC(base, FTM_C5SC_ELSA_MASK, FTM_C5SC_ELSA(value)))
#define FTM_BWR_C5SC_ELSA(base, value) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_ELSA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C5SC, field ELSB[3] (RW)
 *
 * The functionality of ELSB and ELSA depends on the channel mode. See the
 * table. This field is write protected. It can be written only when MODE[WPDIS] = 1.
 */
/*@{*/
/*! @brief Read current value of the FTM_C5SC_ELSB field. */
#define FTM_RD_C5SC_ELSB(base) ((FTM_C5SC_REG(base) & FTM_C5SC_ELSB_MASK) >> FTM_C5SC_ELSB_SHIFT)
#define FTM_BRD_C5SC_ELSB(base) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_ELSB_SHIFT))

/*! @brief Set the ELSB field to a new value. */
#define FTM_WR_C5SC_ELSB(base, value) (FTM_RMW_C5SC(base, FTM_C5SC_ELSB_MASK, FTM_C5SC_ELSB(value)))
#define FTM_BWR_C5SC_ELSB(base, value) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_ELSB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C5SC, field MSA[4] (RW)
 *
 * Used for further selections in the channel logic. Its functionality is
 * dependent on the channel mode. See the table. This field is write protected. It can
 * be written only when MODE[WPDIS] = 1.
 */
/*@{*/
/*! @brief Read current value of the FTM_C5SC_MSA field. */
#define FTM_RD_C5SC_MSA(base) ((FTM_C5SC_REG(base) & FTM_C5SC_MSA_MASK) >> FTM_C5SC_MSA_SHIFT)
#define FTM_BRD_C5SC_MSA(base) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_MSA_SHIFT))

/*! @brief Set the MSA field to a new value. */
#define FTM_WR_C5SC_MSA(base, value) (FTM_RMW_C5SC(base, FTM_C5SC_MSA_MASK, FTM_C5SC_MSA(value)))
#define FTM_BWR_C5SC_MSA(base, value) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_MSA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C5SC, field MSB[5] (RW)
 *
 * Used for further selections in the channel logic. Its functionality is
 * dependent on the channel mode. See the table. This field is write protected. It can
 * be written only when MODE[WPDIS] = 1.
 */
/*@{*/
/*! @brief Read current value of the FTM_C5SC_MSB field. */
#define FTM_RD_C5SC_MSB(base) ((FTM_C5SC_REG(base) & FTM_C5SC_MSB_MASK) >> FTM_C5SC_MSB_SHIFT)
#define FTM_BRD_C5SC_MSB(base) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_MSB_SHIFT))

/*! @brief Set the MSB field to a new value. */
#define FTM_WR_C5SC_MSB(base, value) (FTM_RMW_C5SC(base, FTM_C5SC_MSB_MASK, FTM_C5SC_MSB(value)))
#define FTM_BWR_C5SC_MSB(base, value) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_MSB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C5SC, field CHIE[6] (RW)
 *
 * Enables channel interrupts.
 *
 * Values:
 * - 0b0 - Disable channel interrupts. Use software polling.
 * - 0b1 - Enable channel interrupts.
 */
/*@{*/
/*! @brief Read current value of the FTM_C5SC_CHIE field. */
#define FTM_RD_C5SC_CHIE(base) ((FTM_C5SC_REG(base) & FTM_C5SC_CHIE_MASK) >> FTM_C5SC_CHIE_SHIFT)
#define FTM_BRD_C5SC_CHIE(base) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_CHIE_SHIFT))

/*! @brief Set the CHIE field to a new value. */
#define FTM_WR_C5SC_CHIE(base, value) (FTM_RMW_C5SC(base, FTM_C5SC_CHIE_MASK, FTM_C5SC_CHIE(value)))
#define FTM_BWR_C5SC_CHIE(base, value) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_CHIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C5SC, field CHF[7] (ROWZ)
 *
 * Set by hardware when an event occurs on the channel. CHF is cleared by
 * reading the CSC register while CHnF is set and then writing a 0 to the CHF bit.
 * Writing a 1 to CHF has no effect. If another event occurs between the read and
 * write operations, the write operation has no effect; therefore, CHF remains set
 * indicating an event has occurred. In this case a CHF interrupt request is not
 * lost due to the clearing sequence for a previous CHF.
 *
 * Values:
 * - 0b0 - No channel event has occurred.
 * - 0b1 - A channel event has occurred.
 */
/*@{*/
/*! @brief Read current value of the FTM_C5SC_CHF field. */
#define FTM_RD_C5SC_CHF(base) ((FTM_C5SC_REG(base) & FTM_C5SC_CHF_MASK) >> FTM_C5SC_CHF_SHIFT)
#define FTM_BRD_C5SC_CHF(base) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_CHF_SHIFT))

/*! @brief Set the CHF field to a new value. */
#define FTM_WR_C5SC_CHF(base, value) (FTM_RMW_C5SC(base, FTM_C5SC_CHF_MASK, FTM_C5SC_CHF(value)))
#define FTM_BWR_C5SC_CHF(base, value) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_CHF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C5SC, field TRIGMODE[8] (RW)
 *
 * This bit controls the trigger generation on FTM channel outputs. This mode is
 * allowed only when FTM channel is configured to EPWM (up counting) or CPWM
 * (up-down counting) modes. If a match in the channel occurs, a trigger pulse with
 * one FTM clock cycle width will be generated in the channel output. See Channel
 * trigger output for more details about trigger mode feature. This field is
 * write protected. It can be written only when MODE[WPDIS] = 1.
 *
 * Values:
 * - 0b0 - Channel outputs will generate the normal PWM outputs without
 *     generating a pulse.
 * - 0b1 - If a match in the channel occurs, a trigger generation on channel
 *     output will happen. The trigger pulse width has one FTM clock cycle.
 */
/*@{*/
/*! @brief Read current value of the FTM_C5SC_TRIGMODE field. */
#define FTM_RD_C5SC_TRIGMODE(base) ((FTM_C5SC_REG(base) & FTM_C5SC_TRIGMODE_MASK) >> FTM_C5SC_TRIGMODE_SHIFT)
#define FTM_BRD_C5SC_TRIGMODE(base) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_TRIGMODE_SHIFT))

/*! @brief Set the TRIGMODE field to a new value. */
#define FTM_WR_C5SC_TRIGMODE(base, value) (FTM_RMW_C5SC(base, FTM_C5SC_TRIGMODE_MASK, FTM_C5SC_TRIGMODE(value)))
#define FTM_BWR_C5SC_TRIGMODE(base, value) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_TRIGMODE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_C5SC, field CHIS[9] (RO)
 *
 * This bit returns the value of channel input pin after filter mechanism (if
 * enabled to the specific channel).
 *
 * Values:
 * - 0b0 - Channel input pin is at low state.
 * - 0b1 - Channel input pin is at high state.
 */
/*@{*/
/*! @brief Read current value of the FTM_C5SC_CHIS field. */
#define FTM_RD_C5SC_CHIS(base) ((FTM_C5SC_REG(base) & FTM_C5SC_CHIS_MASK) >> FTM_C5SC_CHIS_SHIFT)
#define FTM_BRD_C5SC_CHIS(base) (BITBAND_ACCESS32(&FTM_C5SC_REG(base), FTM_C5SC_CHIS_SHIFT))
/*@}*/

