nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the LDOK field to a new value. */
#define FTM_WR_PWMLOAD_LDOK(base, value) (FTM_RMW_PWMLOAD(base, FTM_PWMLOAD_LDOK_MASK, FTM_PWMLOAD_LDOK(value)))
#define FTM_BWR_PWMLOAD_LDOK(base, value) (BITBAND_ACCESS32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_LDOK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_PWMLOAD, field GLEN[10] (RW)
 *
 * This bit enables the global load mechanism implemented by GLDOK. If enabled,
 * then an external event asserted by the FTM global load input can set the LDOK
 * bit. If disabled, the LDOK bit is controlled only locally with writes from
 * CPU, independently of the module global load input.
 *
 * Values:
 * - 0b0 - Global Load Ok disabled.
 * - 0b1 - Global Load OK enabled. A pulse event on the module global load input
 *     sets the LDOK bit.
 */
/*@{*/
/*! @brief Read current value of the FTM_PWMLOAD_GLEN field. */
#define FTM_RD_PWMLOAD_GLEN(base) ((FTM_PWMLOAD_REG(base) & FTM_PWMLOAD_GLEN_MASK) >> FTM_PWMLOAD_GLEN_SHIFT)
#define FTM_BRD_PWMLOAD_GLEN(base) (BITBAND_ACCESS32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_GLEN_SHIFT))

/*! @brief Set the GLEN field to a new value. */
#define FTM_WR_PWMLOAD_GLEN(base, value) (FTM_RMW_PWMLOAD(base, FTM_PWMLOAD_GLEN_MASK, FTM_PWMLOAD_GLEN(value)))
#define FTM_BWR_PWMLOAD_GLEN(base, value) (BITBAND_ACCESS32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_GLEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTM_PWMLOAD, field GLDOK[11] (WORZ)
 *
 * This bit controls the global load mechanism. It generates a pulse at FTM
 * module global load output with one FTM clock cycle width, which is used to set
 * LDOK bits of FTM and other modules (including other FTMs). This bit is
 * self-cleared and read value is always zero. The global load mechanism depends on SoC
 * specific information. Refer to the Chip-specific FTM information for more details.
 *
 * Values:
 * - 0b0 - No action.
 * - 0b1 - LDOK bit is set.
 */
/*@{*/
/*! @brief Set the GLDOK field to a new value. */
#define FTM_WR_PWMLOAD_GLDOK(base, value) (FTM_RMW_PWMLOAD(base, FTM_PWMLOAD_GLDOK_MASK, FTM_PWMLOAD_GLDOK(value)))
#define FTM_BWR_PWMLOAD_GLDOK(base, value) (BITBAND_ACCESS32(&FTM_PWMLOAD_REG(base), FTM_PWMLOAD_GLDOK_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * FTM_HCR - Half Cycle Register
 ******************************************************************************/

/*!
 * @brief FTM_HCR - Half Cycle Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Half Cycle Register contains the match value for FTM half cycle reload
 * feature. After FTM counter reaches this value, a reload opportunity is generated
 * if FTM_PWMLOAD[HCSEL] is enabled. Writing to the HCR register latches the
 * value into a buffer. The HCR register is updated with the value of its write
 * buffer according to Registers updated from write buffers.
 */
/*!
 * @name Constants and macros for entire FTM_HCR register
 */
/*@{*/
#define FTM_RD_HCR(base)         (FTM_HCR_REG(base))
#define FTM_WR_HCR(base, value)  (FTM_HCR_REG(base) = (value))
#define FTM_RMW_HCR(base, mask, value) (FTM_WR_HCR(base, (FTM_RD_HCR(base) & ~(mask)) | (value)))
#define FTM_SET_HCR(base, value) (FTM_WR_HCR(base, FTM_RD_HCR(base) |  (value)))
#define FTM_CLR_HCR(base, value) (FTM_WR_HCR(base, FTM_RD_HCR(base) & ~(value)))
#define FTM_TOG_HCR(base, value) (FTM_WR_HCR(base, FTM_RD_HCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FTM_HCR bitfields
 */

/*!
 * @name Register FTM_HCR, field HCVAL[15:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the FTM_HCR_HCVAL field. */
#define FTM_RD_HCR_HCVAL(base) ((FTM_HCR_REG(base) & FTM_HCR_HCVAL_MASK) >> FTM_HCR_HCVAL_SHIFT)
#define FTM_BRD_HCR_HCVAL(base) (FTM_RD_HCR_HCVAL(base))

/*! @brief Set the HCVAL field to a new value. */
#define FTM_WR_HCR_HCVAL(base, value) (FTM_RMW_HCR(base, FTM_HCR_HCVAL_MASK, FTM_HCR_HCVAL(value)))
#define FTM_BWR_HCR_HCVAL(base, value) (FTM_WR_HCR_HCVAL(base, value))
/*@}*/

/*
 * S32K144 GPIO
 *
 * General Purpose Input/Output
 *
 * Registers defined in this header file:
 * - GPIO_PDOR - Port Data Output Register
 * - GPIO_PSOR - Port Set Output Register
 * - GPIO_PCOR - Port Clear Output Register
 * - GPIO_PTOR - Port Toggle Output Register
 * - GPIO_PDIR - Port Data Input Register
 * - GPIO_PDDR - Port Data Direction Register
 */

#define GPIO_INSTANCE_COUNT (5U) /*!< Number of instances of the GPIO module. */
#define PTA_IDX (0U) /*!< Instance number for PTA. */
#define PTB_IDX (1U) /*!< Instance number for PTB. */
#define PTC_IDX (2U) /*!< Instance number for PTC. */
#define PTD_IDX (3U) /*!< Instance number for PTD. */
#define PTE_IDX (4U) /*!< Instance number for PTE. */

/*******************************************************************************
 * GPIO_PDOR - Port Data Output Register
 ******************************************************************************/

/*!
 * @brief GPIO_PDOR - Port Data Output Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register configures the logic levels that are driven on each
 * general-purpose output pins. Do not modify pin configuration registers associated with
 * pins not available in your selected package. All unbonded pins not available in
 * your package will default to DISABLE state for lowest power consumption.
 */
/*!
 * @name Constants and macros for entire GPIO_PDOR register
 */
/*@{*/
#define GPIO_RD_PDOR(base)       (GPIO_PDOR_REG(base))
#define GPIO_WR_PDOR(base, value) (GPIO_PDOR_REG(base) = (value))
#define GPIO_RMW_PDOR(base, mask, value) (GPIO_WR_PDOR(base, (GPIO_RD_PDOR(base) & ~(mask)) | (value)))
#define GPIO_SET_PDOR(base, value) (GPIO_WR_PDOR(base, GPIO_RD_PDOR(base) |  (value)))
#define GPIO_CLR_PDOR(base, value) (GPIO_WR_PDOR(base, GPIO_RD_PDOR(base) & ~(value)))
#define GPIO_TOG_PDOR(base, value) (GPIO_WR_PDOR(base, GPIO_RD_PDOR(base) ^  (value)))
/*@}*/

