nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * GPIO_PSOR - Port Set Output Register
 ******************************************************************************/

/*!
 * @brief GPIO_PSOR - Port Set Output Register (WORZ)
 *
 * Reset value: 0x00000000U
 *
 * This register configures whether to set the fields of the PDOR.
 */
/*!
 * @name Constants and macros for entire GPIO_PSOR register
 */
/*@{*/
#define GPIO_RD_PSOR(base)       (GPIO_PSOR_REG(base))
#define GPIO_WR_PSOR(base, value) (GPIO_PSOR_REG(base) = (value))
#define GPIO_RMW_PSOR(base, mask, value) (GPIO_WR_PSOR(base, (GPIO_RD_PSOR(base) & ~(mask)) | (value)))
/*@}*/

/*******************************************************************************
 * GPIO_PCOR - Port Clear Output Register
 ******************************************************************************/

/*!
 * @brief GPIO_PCOR - Port Clear Output Register (WORZ)
 *
 * Reset value: 0x00000000U
 *
 * This register configures whether to clear the fields of PDOR.
 */
/*!
 * @name Constants and macros for entire GPIO_PCOR register
 */
/*@{*/
#define GPIO_RD_PCOR(base)       (GPIO_PCOR_REG(base))
#define GPIO_WR_PCOR(base, value) (GPIO_PCOR_REG(base) = (value))
#define GPIO_RMW_PCOR(base, mask, value) (GPIO_WR_PCOR(base, (GPIO_RD_PCOR(base) & ~(mask)) | (value)))
/*@}*/

/*******************************************************************************
 * GPIO_PTOR - Port Toggle Output Register
 ******************************************************************************/

/*!
 * @brief GPIO_PTOR - Port Toggle Output Register (WORZ)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire GPIO_PTOR register
 */
/*@{*/
#define GPIO_RD_PTOR(base)       (GPIO_PTOR_REG(base))
#define GPIO_WR_PTOR(base, value) (GPIO_PTOR_REG(base) = (value))
#define GPIO_RMW_PTOR(base, mask, value) (GPIO_WR_PTOR(base, (GPIO_RD_PTOR(base) & ~(mask)) | (value)))
/*@}*/

/*******************************************************************************
 * GPIO_PDIR - Port Data Input Register
 ******************************************************************************/

/*!
 * @brief GPIO_PDIR - Port Data Input Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * Do not modify pin configuration registers associated with pins not available
 * in your selected package. All unbonded pins not available in your package will
 * default to DISABLE state for lowest power consumption.
 */
/*!
 * @name Constants and macros for entire GPIO_PDIR register
 */
/*@{*/
#define GPIO_RD_PDIR(base)       (GPIO_PDIR_REG(base))
/*@}*/

/*******************************************************************************
 * GPIO_PDDR - Port Data Direction Register
 ******************************************************************************/

/*!
 * @brief GPIO_PDDR - Port Data Direction Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The PDDR configures the individual port pins for input or output.
 */
/*!
 * @name Constants and macros for entire GPIO_PDDR register
 */
/*@{*/
#define GPIO_RD_PDDR(base)       (GPIO_PDDR_REG(base))
#define GPIO_WR_PDDR(base, value) (GPIO_PDDR_REG(base) = (value))
#define GPIO_RMW_PDDR(base, mask, value) (GPIO_WR_PDDR(base, (GPIO_RD_PDDR(base) & ~(mask)) | (value)))
#define GPIO_SET_PDDR(base, value) (GPIO_WR_PDDR(base, GPIO_RD_PDDR(base) |  (value)))
#define GPIO_CLR_PDDR(base, value) (GPIO_WR_PDDR(base, GPIO_RD_PDDR(base) & ~(value)))
#define GPIO_TOG_PDDR(base, value) (GPIO_WR_PDDR(base, GPIO_RD_PDDR(base) ^  (value)))
/*@}*/

/*
 * S32K144 LMEM
 *
 * Local Memory Controller
 *
 * Registers defined in this header file:
 * - LMEM_PCCCR - Cache control register
 * - LMEM_PCCLCR - Cache line control register
 * - LMEM_PCCSAR - Cache search address register
 * - LMEM_PCCCVR - Cache read/write value register
 * - LMEM_PCCRMR - Cache regions mode register
 */

#define LMEM_INSTANCE_COUNT (1U) /*!< Number of instances of the LMEM module. */
#define LMEM_IDX (0U) /*!< Instance number for LMEM. */

/*******************************************************************************
 * LMEM_PCCCR - Cache control register
 ******************************************************************************/

/*!
 * @brief LMEM_PCCCR - Cache control register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LMEM_PCCCR register
 */
/*@{*/
#define LMEM_RD_PCCCR(base)      (LMEM_PCCCR_REG(base))
#define LMEM_WR_PCCCR(base, value) (LMEM_PCCCR_REG(base) = (value))
#define LMEM_RMW_PCCCR(base, mask, value) (LMEM_WR_PCCCR(base, (LMEM_RD_PCCCR(base) & ~(mask)) | (value)))
#define LMEM_SET_PCCCR(base, value) (LMEM_WR_PCCCR(base, LMEM_RD_PCCCR(base) |  (value)))
#define LMEM_CLR_PCCCR(base, value) (LMEM_WR_PCCCR(base, LMEM_RD_PCCCR(base) & ~(value)))
#define LMEM_TOG_PCCCR(base, value) (LMEM_WR_PCCCR(base, LMEM_RD_PCCCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LMEM_PCCCR bitfields
 */

/*!
 * @name Register LMEM_PCCCR, field ENCACHE[0] (RW)
 *
 * Values:
 * - 0b0 - Cache disabled
 * - 0b1 - Cache enabled
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_ENCACHE field. */
#define LMEM_RD_PCCCR_ENCACHE(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_ENCACHE_MASK) >> LMEM_PCCCR_ENCACHE_SHIFT)
#define LMEM_BRD_PCCCR_ENCACHE(base) (LMEM_RD_PCCCR_ENCACHE(base))

/*! @brief Set the ENCACHE field to a new value. */
#define LMEM_WR_PCCCR_ENCACHE(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_ENCACHE_MASK, LMEM_PCCCR_ENCACHE(value)))
#define LMEM_BWR_PCCCR_ENCACHE(base, value) (LMEM_WR_PCCCR_ENCACHE(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field ENWRBUF[1] (RW)
 *
 * Values:
 * - 0b0 - Write buffer disabled
 * - 0b1 - Write buffer enabled
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_ENWRBUF field. */
#define LMEM_RD_PCCCR_ENWRBUF(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_ENWRBUF_MASK) >> LMEM_PCCCR_ENWRBUF_SHIFT)
#define LMEM_BRD_PCCCR_ENWRBUF(base) (LMEM_RD_PCCCR_ENWRBUF(base))

/*! @brief Set the ENWRBUF field to a new value. */
#define LMEM_WR_PCCCR_ENWRBUF(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_ENWRBUF_MASK, LMEM_PCCCR_ENWRBUF(value)))
#define LMEM_BWR_PCCCR_ENWRBUF(base, value) (LMEM_WR_PCCCR_ENWRBUF(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field PCCR2[2] (RW)
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_PCCR2 field. */
#define LMEM_RD_PCCCR_PCCR2(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_PCCR2_MASK) >> LMEM_PCCCR_PCCR2_SHIFT)
#define LMEM_BRD_PCCCR_PCCR2(base) (LMEM_RD_PCCCR_PCCR2(base))

