nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the PCCR2 field to a new value. */
#define LMEM_WR_PCCCR_PCCR2(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_PCCR2_MASK, LMEM_PCCCR_PCCR2(value)))
#define LMEM_BWR_PCCCR_PCCR2(base, value) (LMEM_WR_PCCCR_PCCR2(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field PCCR3[3] (RW)
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_PCCR3 field. */
#define LMEM_RD_PCCCR_PCCR3(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_PCCR3_MASK) >> LMEM_PCCCR_PCCR3_SHIFT)
#define LMEM_BRD_PCCCR_PCCR3(base) (LMEM_RD_PCCCR_PCCR3(base))

/*! @brief Set the PCCR3 field to a new value. */
#define LMEM_WR_PCCCR_PCCR3(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_PCCR3_MASK, LMEM_PCCCR_PCCR3(value)))
#define LMEM_BWR_PCCCR_PCCR3(base, value) (LMEM_WR_PCCCR_PCCR3(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field INVW0[24] (RW)
 *
 * If the PUSHW0 and INVW0 bits are set, then after setting the GO bit, push all
 * modified lines in way 0 and invalidate all lines in way 0 (clear way 0).
 *
 * Values:
 * - 0b0 - No operation
 * - 0b1 - When setting the GO bit, invalidate all lines in way 0.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_INVW0 field. */
#define LMEM_RD_PCCCR_INVW0(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_INVW0_MASK) >> LMEM_PCCCR_INVW0_SHIFT)
#define LMEM_BRD_PCCCR_INVW0(base) (LMEM_RD_PCCCR_INVW0(base))

/*! @brief Set the INVW0 field to a new value. */
#define LMEM_WR_PCCCR_INVW0(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_INVW0_MASK, LMEM_PCCCR_INVW0(value)))
#define LMEM_BWR_PCCCR_INVW0(base, value) (LMEM_WR_PCCCR_INVW0(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field PUSHW0[25] (RW)
 *
 * Values:
 * - 0b0 - No operation
 * - 0b1 - When setting the GO bit, push all modified lines in way 0
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_PUSHW0 field. */
#define LMEM_RD_PCCCR_PUSHW0(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_PUSHW0_MASK) >> LMEM_PCCCR_PUSHW0_SHIFT)
#define LMEM_BRD_PCCCR_PUSHW0(base) (LMEM_RD_PCCCR_PUSHW0(base))

/*! @brief Set the PUSHW0 field to a new value. */
#define LMEM_WR_PCCCR_PUSHW0(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_PUSHW0_MASK, LMEM_PCCCR_PUSHW0(value)))
#define LMEM_BWR_PCCCR_PUSHW0(base, value) (LMEM_WR_PCCCR_PUSHW0(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field INVW1[26] (RW)
 *
 * If the PUSHW1 and INVW1 bits are set, then after setting the GO bit, push all
 * modified lines in way 1 and invalidate all lines in way 1 (clear way 1).
 *
 * Values:
 * - 0b0 - No operation
 * - 0b1 - When setting the GO bit, invalidate all lines in way 1
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_INVW1 field. */
#define LMEM_RD_PCCCR_INVW1(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_INVW1_MASK) >> LMEM_PCCCR_INVW1_SHIFT)
#define LMEM_BRD_PCCCR_INVW1(base) (LMEM_RD_PCCCR_INVW1(base))

/*! @brief Set the INVW1 field to a new value. */
#define LMEM_WR_PCCCR_INVW1(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_INVW1_MASK, LMEM_PCCCR_INVW1(value)))
#define LMEM_BWR_PCCCR_INVW1(base, value) (LMEM_WR_PCCCR_INVW1(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field PUSHW1[27] (RW)
 *
 * Values:
 * - 0b0 - No operation
 * - 0b1 - When setting the GO bit, push all modified lines in way 1
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_PUSHW1 field. */
#define LMEM_RD_PCCCR_PUSHW1(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_PUSHW1_MASK) >> LMEM_PCCCR_PUSHW1_SHIFT)
#define LMEM_BRD_PCCCR_PUSHW1(base) (LMEM_RD_PCCCR_PUSHW1(base))

/*! @brief Set the PUSHW1 field to a new value. */
#define LMEM_WR_PCCCR_PUSHW1(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_PUSHW1_MASK, LMEM_PCCCR_PUSHW1(value)))
#define LMEM_BWR_PCCCR_PUSHW1(base, value) (LMEM_WR_PCCCR_PUSHW1(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCCR, field GO[31] (RW)
 *
 * Setting this bit initiates the cache command indicated by bits 27-24. Reading
 * this bit indicates if a command is active This bit stays set until the
 * command completes. Writing zero has no effect.
 *
 * Values:
 * - 0b0 - Write: no effect. Read: no cache command active.
 * - 0b1 - Write: initiate command indicated by bits 27-24. Read: cache command
 *     active.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCCR_GO field. */
#define LMEM_RD_PCCCR_GO(base) ((LMEM_PCCCR_REG(base) & LMEM_PCCCR_GO_MASK) >> LMEM_PCCCR_GO_SHIFT)
#define LMEM_BRD_PCCCR_GO(base) (LMEM_RD_PCCCR_GO(base))

/*! @brief Set the GO field to a new value. */
#define LMEM_WR_PCCCR_GO(base, value) (LMEM_RMW_PCCCR(base, LMEM_PCCCR_GO_MASK, LMEM_PCCCR_GO(value)))
#define LMEM_BWR_PCCCR_GO(base, value) (LMEM_WR_PCCCR_GO(base, value))
/*@}*/

/*******************************************************************************
 * LMEM_PCCLCR - Cache line control register
 ******************************************************************************/

/*!
 * @brief LMEM_PCCLCR - Cache line control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines specific line-sized cache operations to be performed
 * using a specific cache line address or a physical address. If a physical address
 * is specified, both ways of the cache are searched, and the command is only
 * performed on the way which hits.
 */
/*!
 * @name Constants and macros for entire LMEM_PCCLCR register
 */
/*@{*/
#define LMEM_RD_PCCLCR(base)     (LMEM_PCCLCR_REG(base))
#define LMEM_WR_PCCLCR(base, value) (LMEM_PCCLCR_REG(base) = (value))
#define LMEM_RMW_PCCLCR(base, mask, value) (LMEM_WR_PCCLCR(base, (LMEM_RD_PCCLCR(base) & ~(mask)) | (value)))
#define LMEM_SET_PCCLCR(base, value) (LMEM_WR_PCCLCR(base, LMEM_RD_PCCLCR(base) |  (value)))
#define LMEM_CLR_PCCLCR(base, value) (LMEM_WR_PCCLCR(base, LMEM_RD_PCCLCR(base) & ~(value)))
#define LMEM_TOG_PCCLCR(base, value) (LMEM_WR_PCCLCR(base, LMEM_RD_PCCLCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LMEM_PCCLCR bitfields
 */

/*!
 * @name Register LMEM_PCCLCR, field LGO[0] (RW)
 *
 * Setting this bit initiates the cache line command indicated by bits 27-24.
 * Reading this bit indicates if a line command is active This bit stays set until
 * the command completes. Writing zero has no effect. This bit is shared with
 * CSAR[LGO]
 *
 * Values:
 * - 0b0 - Write: no effect. Read: no line command active.
 * - 0b1 - Write: initiate line command indicated by bits 27-24. Read: line
 *     command active.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LGO field. */
#define LMEM_RD_PCCLCR_LGO(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LGO_MASK) >> LMEM_PCCLCR_LGO_SHIFT)
#define LMEM_BRD_PCCLCR_LGO(base) (LMEM_RD_PCCLCR_LGO(base))

/*! @brief Set the LGO field to a new value. */
#define LMEM_WR_PCCLCR_LGO(base, value) (LMEM_RMW_PCCLCR(base, LMEM_PCCLCR_LGO_MASK, LMEM_PCCLCR_LGO(value)))
#define LMEM_BWR_PCCLCR_LGO(base, value) (LMEM_WR_PCCLCR_LGO(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field CACHEADDR[11:2] (RW)
 *
 * CLCR[11:4] bits are used to access the tag arrays CLCR[11:2] bits are used to
 * access the data arrays
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_CACHEADDR field. */
#define LMEM_RD_PCCLCR_CACHEADDR(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_CACHEADDR_MASK) >> LMEM_PCCLCR_CACHEADDR_SHIFT)
#define LMEM_BRD_PCCLCR_CACHEADDR(base) (LMEM_RD_PCCLCR_CACHEADDR(base))

