nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the R14 field to a new value. */
#define LMEM_WR_PCCRMR_R14(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R14_MASK, LMEM_PCCRMR_R14(value)))
#define LMEM_BWR_PCCRMR_R14(base, value) (LMEM_WR_PCCRMR_R14(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R13[5:4] (RW)
 *
 * Controls the cache mode for region 13
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R13 field. */
#define LMEM_RD_PCCRMR_R13(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R13_MASK) >> LMEM_PCCRMR_R13_SHIFT)
#define LMEM_BRD_PCCRMR_R13(base) (LMEM_RD_PCCRMR_R13(base))

/*! @brief Set the R13 field to a new value. */
#define LMEM_WR_PCCRMR_R13(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R13_MASK, LMEM_PCCRMR_R13(value)))
#define LMEM_BWR_PCCRMR_R13(base, value) (LMEM_WR_PCCRMR_R13(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R12[7:6] (RW)
 *
 * Controls the cache mode for region 12
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R12 field. */
#define LMEM_RD_PCCRMR_R12(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R12_MASK) >> LMEM_PCCRMR_R12_SHIFT)
#define LMEM_BRD_PCCRMR_R12(base) (LMEM_RD_PCCRMR_R12(base))

/*! @brief Set the R12 field to a new value. */
#define LMEM_WR_PCCRMR_R12(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R12_MASK, LMEM_PCCRMR_R12(value)))
#define LMEM_BWR_PCCRMR_R12(base, value) (LMEM_WR_PCCRMR_R12(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R11[9:8] (RW)
 *
 * Controls the cache mode for region 11
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R11 field. */
#define LMEM_RD_PCCRMR_R11(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R11_MASK) >> LMEM_PCCRMR_R11_SHIFT)
#define LMEM_BRD_PCCRMR_R11(base) (LMEM_RD_PCCRMR_R11(base))

/*! @brief Set the R11 field to a new value. */
#define LMEM_WR_PCCRMR_R11(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R11_MASK, LMEM_PCCRMR_R11(value)))
#define LMEM_BWR_PCCRMR_R11(base, value) (LMEM_WR_PCCRMR_R11(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R10[11:10] (RW)
 *
 * Controls the cache mode for region 10
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R10 field. */
#define LMEM_RD_PCCRMR_R10(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R10_MASK) >> LMEM_PCCRMR_R10_SHIFT)
#define LMEM_BRD_PCCRMR_R10(base) (LMEM_RD_PCCRMR_R10(base))

/*! @brief Set the R10 field to a new value. */
#define LMEM_WR_PCCRMR_R10(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R10_MASK, LMEM_PCCRMR_R10(value)))
#define LMEM_BWR_PCCRMR_R10(base, value) (LMEM_WR_PCCRMR_R10(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R9[13:12] (RW)
 *
 * Controls the cache mode for region 9
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R9 field. */
#define LMEM_RD_PCCRMR_R9(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R9_MASK) >> LMEM_PCCRMR_R9_SHIFT)
#define LMEM_BRD_PCCRMR_R9(base) (LMEM_RD_PCCRMR_R9(base))

/*! @brief Set the R9 field to a new value. */
#define LMEM_WR_PCCRMR_R9(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R9_MASK, LMEM_PCCRMR_R9(value)))
#define LMEM_BWR_PCCRMR_R9(base, value) (LMEM_WR_PCCRMR_R9(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R8[15:14] (RW)
 *
 * Controls the cache mode for region 8
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R8 field. */
#define LMEM_RD_PCCRMR_R8(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R8_MASK) >> LMEM_PCCRMR_R8_SHIFT)
#define LMEM_BRD_PCCRMR_R8(base) (LMEM_RD_PCCRMR_R8(base))

/*! @brief Set the R8 field to a new value. */
#define LMEM_WR_PCCRMR_R8(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R8_MASK, LMEM_PCCRMR_R8(value)))
#define LMEM_BWR_PCCRMR_R8(base, value) (LMEM_WR_PCCRMR_R8(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R7[17:16] (RW)
 *
 * Controls the cache mode for region 7
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R7 field. */
#define LMEM_RD_PCCRMR_R7(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R7_MASK) >> LMEM_PCCRMR_R7_SHIFT)
#define LMEM_BRD_PCCRMR_R7(base) (LMEM_RD_PCCRMR_R7(base))

/*! @brief Set the R7 field to a new value. */
#define LMEM_WR_PCCRMR_R7(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R7_MASK, LMEM_PCCRMR_R7(value)))
#define LMEM_BWR_PCCRMR_R7(base, value) (LMEM_WR_PCCRMR_R7(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R6[19:18] (RW)
 *
 * Controls the cache mode for region 6
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R6 field. */
#define LMEM_RD_PCCRMR_R6(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R6_MASK) >> LMEM_PCCRMR_R6_SHIFT)
#define LMEM_BRD_PCCRMR_R6(base) (LMEM_RD_PCCRMR_R6(base))

/*! @brief Set the R6 field to a new value. */
#define LMEM_WR_PCCRMR_R6(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R6_MASK, LMEM_PCCRMR_R6(value)))
#define LMEM_BWR_PCCRMR_R6(base, value) (LMEM_WR_PCCRMR_R6(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R5[21:20] (RW)
 *
 * Controls the cache mode for region 5
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R5 field. */
#define LMEM_RD_PCCRMR_R5(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R5_MASK) >> LMEM_PCCRMR_R5_SHIFT)
#define LMEM_BRD_PCCRMR_R5(base) (LMEM_RD_PCCRMR_R5(base))

/*! @brief Set the R5 field to a new value. */
#define LMEM_WR_PCCRMR_R5(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R5_MASK, LMEM_PCCRMR_R5(value)))
#define LMEM_BWR_PCCRMR_R5(base, value) (LMEM_WR_PCCRMR_R5(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R4[23:22] (RW)
 *
 * Controls the cache mode for region 4
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R4 field. */
#define LMEM_RD_PCCRMR_R4(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R4_MASK) >> LMEM_PCCRMR_R4_SHIFT)
#define LMEM_BRD_PCCRMR_R4(base) (LMEM_RD_PCCRMR_R4(base))

