nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the R4 field to a new value. */
#define LMEM_WR_PCCRMR_R4(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R4_MASK, LMEM_PCCRMR_R4(value)))
#define LMEM_BWR_PCCRMR_R4(base, value) (LMEM_WR_PCCRMR_R4(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R3[25:24] (RW)
 *
 * Controls the cache mode for region 3
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R3 field. */
#define LMEM_RD_PCCRMR_R3(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R3_MASK) >> LMEM_PCCRMR_R3_SHIFT)
#define LMEM_BRD_PCCRMR_R3(base) (LMEM_RD_PCCRMR_R3(base))

/*! @brief Set the R3 field to a new value. */
#define LMEM_WR_PCCRMR_R3(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R3_MASK, LMEM_PCCRMR_R3(value)))
#define LMEM_BWR_PCCRMR_R3(base, value) (LMEM_WR_PCCRMR_R3(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R2[27:26] (RW)
 *
 * Controls the cache mode for region 2
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R2 field. */
#define LMEM_RD_PCCRMR_R2(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R2_MASK) >> LMEM_PCCRMR_R2_SHIFT)
#define LMEM_BRD_PCCRMR_R2(base) (LMEM_RD_PCCRMR_R2(base))

/*! @brief Set the R2 field to a new value. */
#define LMEM_WR_PCCRMR_R2(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R2_MASK, LMEM_PCCRMR_R2(value)))
#define LMEM_BWR_PCCRMR_R2(base, value) (LMEM_WR_PCCRMR_R2(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R1[29:28] (RW)
 *
 * Controls the cache mode for region 1
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R1 field. */
#define LMEM_RD_PCCRMR_R1(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R1_MASK) >> LMEM_PCCRMR_R1_SHIFT)
#define LMEM_BRD_PCCRMR_R1(base) (LMEM_RD_PCCRMR_R1(base))

/*! @brief Set the R1 field to a new value. */
#define LMEM_WR_PCCRMR_R1(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R1_MASK, LMEM_PCCRMR_R1(value)))
#define LMEM_BWR_PCCRMR_R1(base, value) (LMEM_WR_PCCRMR_R1(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R0[31:30] (RW)
 *
 * Controls the cache mode for region 0
 *
 * Values:
 * - 0b00 - Non-cacheable
 * - 0b01 - Non-cacheable
 * - 0b10 - Write-through
 * - 0b11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R0 field. */
#define LMEM_RD_PCCRMR_R0(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R0_MASK) >> LMEM_PCCRMR_R0_SHIFT)
#define LMEM_BRD_PCCRMR_R0(base) (LMEM_RD_PCCRMR_R0(base))

/*! @brief Set the R0 field to a new value. */
#define LMEM_WR_PCCRMR_R0(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R0_MASK, LMEM_PCCRMR_R0(value)))
#define LMEM_BWR_PCCRMR_R0(base, value) (LMEM_WR_PCCRMR_R0(base, value))
/*@}*/

/*
 * S32K144 LPI2C
 *
 * The LPI2C Memory Map/Register Definition can be found here.
 *
 * Registers defined in this header file:
 * - LPI2C_VERID - Version ID Register
 * - LPI2C_PARAM - Parameter Register
 * - LPI2C_MCR - Master Control Register
 * - LPI2C_MSR - Master Status Register
 * - LPI2C_MIER - Master Interrupt Enable Register
 * - LPI2C_MDER - Master DMA Enable Register
 * - LPI2C_MCFGR0 - Master Configuration Register 0
 * - LPI2C_MCFGR1 - Master Configuration Register 1
 * - LPI2C_MCFGR2 - Master Configuration Register 2
 * - LPI2C_MCFGR3 - Master Configuration Register 3
 * - LPI2C_MDMR - Master Data Match Register
 * - LPI2C_MCCR0 - Master Clock Configuration Register 0
 * - LPI2C_MCCR1 - Master Clock Configuration Register 1
 * - LPI2C_MFCR - Master FIFO Control Register
 * - LPI2C_MFSR - Master FIFO Status Register
 * - LPI2C_MTDR - Master Transmit Data Register
 * - LPI2C_MRDR - Master Receive Data Register
 * - LPI2C_SCR - Slave Control Register
 * - LPI2C_SSR - Slave Status Register
 * - LPI2C_SIER - Slave Interrupt Enable Register
 * - LPI2C_SDER - Slave DMA Enable Register
 * - LPI2C_SCFGR1 - Slave Configuration Register 1
 * - LPI2C_SCFGR2 - Slave Configuration Register 2
 * - LPI2C_SAMR - Slave Address Match Register
 * - LPI2C_SASR - Slave Address Status Register
 * - LPI2C_STAR - Slave Transmit ACK Register
 * - LPI2C_STDR - Slave Transmit Data Register
 * - LPI2C_SRDR - Slave Receive Data Register
 */

#define LPI2C_INSTANCE_COUNT (2U) /*!< Number of instances of the LPI2C module. */
#define LPI2C0_IDX (0U) /*!< Instance number for LPI2C0. */
#define LPI2C1_IDX (1U) /*!< Instance number for LPI2C1. */

/*******************************************************************************
 * LPI2C_VERID - Version ID Register
 ******************************************************************************/

/*!
 * @brief LPI2C_VERID - Version ID Register (RO)
 *
 * Reset value: 0x01000003U
 *
 * .
 */
/*!
 * @name Constants and macros for entire LPI2C_VERID register
 */
/*@{*/
#define LPI2C_RD_VERID(base)     (LPI2C_VERID_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPI2C_VERID bitfields
 */

/*!
 * @name Register LPI2C_VERID, field FEATURE[15:0] (RO)
 *
 * This read only field returns the feature set number.
 *
 * Values:
 * - 0b0000000000000010 - Master only with standard feature set.
 * - 0b0000000000000011 - Master and slave with standard feature set.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_VERID_FEATURE field. */
#define LPI2C_RD_VERID_FEATURE(base) ((LPI2C_VERID_REG(base) & LPI2C_VERID_FEATURE_MASK) >> LPI2C_VERID_FEATURE_SHIFT)
#define LPI2C_BRD_VERID_FEATURE(base) (LPI2C_RD_VERID_FEATURE(base))
/*@}*/

/*!
 * @name Register LPI2C_VERID, field MINOR[23:16] (RO)
 *
 * This read only field returns the minor version number for the specification.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_VERID_MINOR field. */
#define LPI2C_RD_VERID_MINOR(base) ((LPI2C_VERID_REG(base) & LPI2C_VERID_MINOR_MASK) >> LPI2C_VERID_MINOR_SHIFT)
#define LPI2C_BRD_VERID_MINOR(base) (LPI2C_RD_VERID_MINOR(base))
/*@}*/

/*!
 * @name Register LPI2C_VERID, field MAJOR[31:24] (RO)
 *
 * This read only field returns the major version number for the specification.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_VERID_MAJOR field. */
#define LPI2C_RD_VERID_MAJOR(base) ((LPI2C_VERID_REG(base) & LPI2C_VERID_MAJOR_MASK) >> LPI2C_VERID_MAJOR_SHIFT)
#define LPI2C_BRD_VERID_MAJOR(base) (LPI2C_RD_VERID_MAJOR(base))
/*@}*/

