nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the PLTIE field to a new value. */
#define LPI2C_WR_MIER_PLTIE(base, value) (LPI2C_RMW_MIER(base, LPI2C_MIER_PLTIE_MASK, LPI2C_MIER_PLTIE(value)))
#define LPI2C_BWR_MIER_PLTIE(base, value) (BITBAND_ACCESS32(&LPI2C_MIER_REG(base), LPI2C_MIER_PLTIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPI2C_MIER, field DMIE[14] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MIER_DMIE field. */
#define LPI2C_RD_MIER_DMIE(base) ((LPI2C_MIER_REG(base) & LPI2C_MIER_DMIE_MASK) >> LPI2C_MIER_DMIE_SHIFT)
#define LPI2C_BRD_MIER_DMIE(base) (BITBAND_ACCESS32(&LPI2C_MIER_REG(base), LPI2C_MIER_DMIE_SHIFT))

/*! @brief Set the DMIE field to a new value. */
#define LPI2C_WR_MIER_DMIE(base, value) (LPI2C_RMW_MIER(base, LPI2C_MIER_DMIE_MASK, LPI2C_MIER_DMIE(value)))
#define LPI2C_BWR_MIER_DMIE(base, value) (BITBAND_ACCESS32(&LPI2C_MIER_REG(base), LPI2C_MIER_DMIE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LPI2C_MDER - Master DMA Enable Register
 ******************************************************************************/

/*!
 * @brief LPI2C_MDER - Master DMA Enable Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_MDER register
 */
/*@{*/
#define LPI2C_RD_MDER(base)      (LPI2C_MDER_REG(base))
#define LPI2C_WR_MDER(base, value) (LPI2C_MDER_REG(base) = (value))
#define LPI2C_RMW_MDER(base, mask, value) (LPI2C_WR_MDER(base, (LPI2C_RD_MDER(base) & ~(mask)) | (value)))
#define LPI2C_SET_MDER(base, value) (LPI2C_WR_MDER(base, LPI2C_RD_MDER(base) |  (value)))
#define LPI2C_CLR_MDER(base, value) (LPI2C_WR_MDER(base, LPI2C_RD_MDER(base) & ~(value)))
#define LPI2C_TOG_MDER(base, value) (LPI2C_WR_MDER(base, LPI2C_RD_MDER(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MDER bitfields
 */

/*!
 * @name Register LPI2C_MDER, field TDDE[0] (RW)
 *
 * Values:
 * - 0b0 - DMA request disabled.
 * - 0b1 - DMA request enabled
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MDER_TDDE field. */
#define LPI2C_RD_MDER_TDDE(base) ((LPI2C_MDER_REG(base) & LPI2C_MDER_TDDE_MASK) >> LPI2C_MDER_TDDE_SHIFT)
#define LPI2C_BRD_MDER_TDDE(base) (BITBAND_ACCESS32(&LPI2C_MDER_REG(base), LPI2C_MDER_TDDE_SHIFT))

/*! @brief Set the TDDE field to a new value. */
#define LPI2C_WR_MDER_TDDE(base, value) (LPI2C_RMW_MDER(base, LPI2C_MDER_TDDE_MASK, LPI2C_MDER_TDDE(value)))
#define LPI2C_BWR_MDER_TDDE(base, value) (BITBAND_ACCESS32(&LPI2C_MDER_REG(base), LPI2C_MDER_TDDE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPI2C_MDER, field RDDE[1] (RW)
 *
 * Values:
 * - 0b0 - DMA request disabled.
 * - 0b1 - DMA request enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MDER_RDDE field. */
#define LPI2C_RD_MDER_RDDE(base) ((LPI2C_MDER_REG(base) & LPI2C_MDER_RDDE_MASK) >> LPI2C_MDER_RDDE_SHIFT)
#define LPI2C_BRD_MDER_RDDE(base) (BITBAND_ACCESS32(&LPI2C_MDER_REG(base), LPI2C_MDER_RDDE_SHIFT))

/*! @brief Set the RDDE field to a new value. */
#define LPI2C_WR_MDER_RDDE(base, value) (LPI2C_RMW_MDER(base, LPI2C_MDER_RDDE_MASK, LPI2C_MDER_RDDE(value)))
#define LPI2C_BWR_MDER_RDDE(base, value) (BITBAND_ACCESS32(&LPI2C_MDER_REG(base), LPI2C_MDER_RDDE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LPI2C_MCFGR0 - Master Configuration Register 0
 ******************************************************************************/

/*!
 * @brief LPI2C_MCFGR0 - Master Configuration Register 0 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_MCFGR0 register
 */
/*@{*/
#define LPI2C_RD_MCFGR0(base)    (LPI2C_MCFGR0_REG(base))
#define LPI2C_WR_MCFGR0(base, value) (LPI2C_MCFGR0_REG(base) = (value))
#define LPI2C_RMW_MCFGR0(base, mask, value) (LPI2C_WR_MCFGR0(base, (LPI2C_RD_MCFGR0(base) & ~(mask)) | (value)))
#define LPI2C_SET_MCFGR0(base, value) (LPI2C_WR_MCFGR0(base, LPI2C_RD_MCFGR0(base) |  (value)))
#define LPI2C_CLR_MCFGR0(base, value) (LPI2C_WR_MCFGR0(base, LPI2C_RD_MCFGR0(base) & ~(value)))
#define LPI2C_TOG_MCFGR0(base, value) (LPI2C_WR_MCFGR0(base, LPI2C_RD_MCFGR0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MCFGR0 bitfields
 */

/*!
 * @name Register LPI2C_MCFGR0, field HREN[0] (RW)
 *
 * When enabled, the LPI2C master will only initiate a START condition if the
 * host request input is asserted and the bus is idle. A repeated START is not
 * affected by the host request.
 *
 * Values:
 * - 0b0 - Host request input is disabled.
 * - 0b1 - Host request input is enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR0_HREN field. */
#define LPI2C_RD_MCFGR0_HREN(base) ((LPI2C_MCFGR0_REG(base) & LPI2C_MCFGR0_HREN_MASK) >> LPI2C_MCFGR0_HREN_SHIFT)
#define LPI2C_BRD_MCFGR0_HREN(base) (BITBAND_ACCESS32(&LPI2C_MCFGR0_REG(base), LPI2C_MCFGR0_HREN_SHIFT))

/*! @brief Set the HREN field to a new value. */
#define LPI2C_WR_MCFGR0_HREN(base, value) (LPI2C_RMW_MCFGR0(base, LPI2C_MCFGR0_HREN_MASK, LPI2C_MCFGR0_HREN(value)))
#define LPI2C_BWR_MCFGR0_HREN(base, value) (BITBAND_ACCESS32(&LPI2C_MCFGR0_REG(base), LPI2C_MCFGR0_HREN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPI2C_MCFGR0, field HRPOL[1] (RW)
 *
 * Configures the polarity of the host request input pin.
 *
 * Values:
 * - 0b0 - Active low.
 * - 0b1 - Active high.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR0_HRPOL field. */
#define LPI2C_RD_MCFGR0_HRPOL(base) ((LPI2C_MCFGR0_REG(base) & LPI2C_MCFGR0_HRPOL_MASK) >> LPI2C_MCFGR0_HRPOL_SHIFT)
#define LPI2C_BRD_MCFGR0_HRPOL(base) (BITBAND_ACCESS32(&LPI2C_MCFGR0_REG(base), LPI2C_MCFGR0_HRPOL_SHIFT))

/*! @brief Set the HRPOL field to a new value. */
#define LPI2C_WR_MCFGR0_HRPOL(base, value) (LPI2C_RMW_MCFGR0(base, LPI2C_MCFGR0_HRPOL_MASK, LPI2C_MCFGR0_HRPOL(value)))
#define LPI2C_BWR_MCFGR0_HRPOL(base, value) (BITBAND_ACCESS32(&LPI2C_MCFGR0_REG(base), LPI2C_MCFGR0_HRPOL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPI2C_MCFGR0, field HRSEL[2] (RW)
 *
 * Selects the source of the host request input.
 *
 * Values:
 * - 0b0 - Host request input is pin LPI2C_HREQ.
 * - 0b1 - Host request input is input trigger.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR0_HRSEL field. */
#define LPI2C_RD_MCFGR0_HRSEL(base) ((LPI2C_MCFGR0_REG(base) & LPI2C_MCFGR0_HRSEL_MASK) >> LPI2C_MCFGR0_HRSEL_SHIFT)
#define LPI2C_BRD_MCFGR0_HRSEL(base) (BITBAND_ACCESS32(&LPI2C_MCFGR0_REG(base), LPI2C_MCFGR0_HRSEL_SHIFT))

/*! @brief Set the HRSEL field to a new value. */
#define LPI2C_WR_MCFGR0_HRSEL(base, value) (LPI2C_RMW_MCFGR0(base, LPI2C_MCFGR0_HRSEL_MASK, LPI2C_MCFGR0_HRSEL(value)))
#define LPI2C_BWR_MCFGR0_HRSEL(base, value) (BITBAND_ACCESS32(&LPI2C_MCFGR0_REG(base), LPI2C_MCFGR0_HRSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPI2C_MCFGR0, field CIRFIFO[8] (RW)
 *
 * When enabled, the transmit FIFO read pointer is saved to a temporary
 * register. The transmit FIFO will be emptied as normal, but once the LPI2C master is
 * idle and the transmit FIFO is empty, then the read pointer value will be
 * restored from the temporary register. This will cause the contents of the transmit
 * FIFO to be cycled through repeatedly. If AUTOSTOP is set, a STOP condition will
 * be sent whenever the transmit FIFO is empty and the read pointer is restored.
 *
 * Values:
 * - 0b0 - Circular FIFO is disabled.
 * - 0b1 - Circular FIFO is enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR0_CIRFIFO field. */
#define LPI2C_RD_MCFGR0_CIRFIFO(base) ((LPI2C_MCFGR0_REG(base) & LPI2C_MCFGR0_CIRFIFO_MASK) >> LPI2C_MCFGR0_CIRFIFO_SHIFT)
#define LPI2C_BRD_MCFGR0_CIRFIFO(base) (BITBAND_ACCESS32(&LPI2C_MCFGR0_REG(base), LPI2C_MCFGR0_CIRFIFO_SHIFT))

/*! @brief Set the CIRFIFO field to a new value. */
#define LPI2C_WR_MCFGR0_CIRFIFO(base, value) (LPI2C_RMW_MCFGR0(base, LPI2C_MCFGR0_CIRFIFO_MASK, LPI2C_MCFGR0_CIRFIFO(value)))
#define LPI2C_BWR_MCFGR0_CIRFIFO(base, value) (BITBAND_ACCESS32(&LPI2C_MCFGR0_REG(base), LPI2C_MCFGR0_CIRFIFO_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPI2C_MCFGR0, field RDMO[9] (RW)
 *
 * When enabled, all received data that does not cause DMF to set is discarded.
 * Once DMF is set, the RDMO configuration is ignored. When disabling RDMO, clear
 * RDMO before clearing DMF to ensure no receive data is lost.
 *
 * Values:
 * - 0b0 - Received data is stored in the receive FIFO as normal.
 * - 0b1 - Received data is discarded unless the RMF is set.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR0_RDMO field. */
#define LPI2C_RD_MCFGR0_RDMO(base) ((LPI2C_MCFGR0_REG(base) & LPI2C_MCFGR0_RDMO_MASK) >> LPI2C_MCFGR0_RDMO_SHIFT)
#define LPI2C_BRD_MCFGR0_RDMO(base) (BITBAND_ACCESS32(&LPI2C_MCFGR0_REG(base), LPI2C_MCFGR0_RDMO_SHIFT))

/*! @brief Set the RDMO field to a new value. */
#define LPI2C_WR_MCFGR0_RDMO(base, value) (LPI2C_RMW_MCFGR0(base, LPI2C_MCFGR0_RDMO_MASK, LPI2C_MCFGR0_RDMO(value)))
#define LPI2C_BWR_MCFGR0_RDMO(base, value) (BITBAND_ACCESS32(&LPI2C_MCFGR0_REG(base), LPI2C_MCFGR0_RDMO_SHIFT) = (value))
/*@}*/

