nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the PINCFG field to a new value. */
#define LPI2C_WR_MCFGR1_PINCFG(base, value) (LPI2C_RMW_MCFGR1(base, LPI2C_MCFGR1_PINCFG_MASK, LPI2C_MCFGR1_PINCFG(value)))
#define LPI2C_BWR_MCFGR1_PINCFG(base, value) (LPI2C_WR_MCFGR1_PINCFG(base, value))
/*@}*/

/*******************************************************************************
 * LPI2C_MCFGR2 - Master Configuration Register 2
 ******************************************************************************/

/*!
 * @brief LPI2C_MCFGR2 - Master Configuration Register 2 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MCFGR2 should only be written when the I2C Master is disabled.
 */
/*!
 * @name Constants and macros for entire LPI2C_MCFGR2 register
 */
/*@{*/
#define LPI2C_RD_MCFGR2(base)    (LPI2C_MCFGR2_REG(base))
#define LPI2C_WR_MCFGR2(base, value) (LPI2C_MCFGR2_REG(base) = (value))
#define LPI2C_RMW_MCFGR2(base, mask, value) (LPI2C_WR_MCFGR2(base, (LPI2C_RD_MCFGR2(base) & ~(mask)) | (value)))
#define LPI2C_SET_MCFGR2(base, value) (LPI2C_WR_MCFGR2(base, LPI2C_RD_MCFGR2(base) |  (value)))
#define LPI2C_CLR_MCFGR2(base, value) (LPI2C_WR_MCFGR2(base, LPI2C_RD_MCFGR2(base) & ~(value)))
#define LPI2C_TOG_MCFGR2(base, value) (LPI2C_WR_MCFGR2(base, LPI2C_RD_MCFGR2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MCFGR2 bitfields
 */

/*!
 * @name Register LPI2C_MCFGR2, field BUSIDLE[11:0] (RW)
 *
 * Configures the bus idle timeout period in clock cycles. If both SCL and SDA
 * are high for longer than BUSIDLE cycles, then the I2C bus is assumed to be idle
 * and the master can generate a START condition. When set to zero, this feature
 * is disabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR2_BUSIDLE field. */
#define LPI2C_RD_MCFGR2_BUSIDLE(base) ((LPI2C_MCFGR2_REG(base) & LPI2C_MCFGR2_BUSIDLE_MASK) >> LPI2C_MCFGR2_BUSIDLE_SHIFT)
#define LPI2C_BRD_MCFGR2_BUSIDLE(base) (LPI2C_RD_MCFGR2_BUSIDLE(base))

/*! @brief Set the BUSIDLE field to a new value. */
#define LPI2C_WR_MCFGR2_BUSIDLE(base, value) (LPI2C_RMW_MCFGR2(base, LPI2C_MCFGR2_BUSIDLE_MASK, LPI2C_MCFGR2_BUSIDLE(value)))
#define LPI2C_BWR_MCFGR2_BUSIDLE(base, value) (LPI2C_WR_MCFGR2_BUSIDLE(base, value))
/*@}*/

/*!
 * @name Register LPI2C_MCFGR2, field FILTSCL[19:16] (RW)
 *
 * Configures the I2C master digital glitch filters for SCL input, a
 * configuration of 0 will disable the glitch filter. Glitches equal to or less than FILTSCL
 * cycles long will be filtered out and ignored. The latency through the glitch
 * filter is equal to FILTSCL cycles and must be configured less than the minimum
 * SCL low or high period. The glitch filter cycle count is not affected by the
 * PRESCALE configuration and is automatically bypassed in High Speed mode.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR2_FILTSCL field. */
#define LPI2C_RD_MCFGR2_FILTSCL(base) ((LPI2C_MCFGR2_REG(base) & LPI2C_MCFGR2_FILTSCL_MASK) >> LPI2C_MCFGR2_FILTSCL_SHIFT)
#define LPI2C_BRD_MCFGR2_FILTSCL(base) (LPI2C_RD_MCFGR2_FILTSCL(base))

/*! @brief Set the FILTSCL field to a new value. */
#define LPI2C_WR_MCFGR2_FILTSCL(base, value) (LPI2C_RMW_MCFGR2(base, LPI2C_MCFGR2_FILTSCL_MASK, LPI2C_MCFGR2_FILTSCL(value)))
#define LPI2C_BWR_MCFGR2_FILTSCL(base, value) (LPI2C_WR_MCFGR2_FILTSCL(base, value))
/*@}*/

/*!
 * @name Register LPI2C_MCFGR2, field FILTSDA[27:24] (RW)
 *
 * Configures the I2C master digital glitch filters for SDA input, a
 * configuration of 0 will disable the glitch filter. Glitches equal to or less than FILTSDA
 * cycles long will be filtered out and ignored. The latency through the glitch
 * filter is equal to FILTSDA cycles and must be configured less than the minimum
 * SCL low or high period. The glitch filter cycle count is not affected by the
 * PRESCALE configuration and is automatically bypassed in High Speed mode.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR2_FILTSDA field. */
#define LPI2C_RD_MCFGR2_FILTSDA(base) ((LPI2C_MCFGR2_REG(base) & LPI2C_MCFGR2_FILTSDA_MASK) >> LPI2C_MCFGR2_FILTSDA_SHIFT)
#define LPI2C_BRD_MCFGR2_FILTSDA(base) (LPI2C_RD_MCFGR2_FILTSDA(base))

/*! @brief Set the FILTSDA field to a new value. */
#define LPI2C_WR_MCFGR2_FILTSDA(base, value) (LPI2C_RMW_MCFGR2(base, LPI2C_MCFGR2_FILTSDA_MASK, LPI2C_MCFGR2_FILTSDA(value)))
#define LPI2C_BWR_MCFGR2_FILTSDA(base, value) (LPI2C_WR_MCFGR2_FILTSDA(base, value))
/*@}*/

/*******************************************************************************
 * LPI2C_MCFGR3 - Master Configuration Register 3
 ******************************************************************************/

/*!
 * @brief LPI2C_MCFGR3 - Master Configuration Register 3 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MCFGR3 should only be written when the I2C Master is disabled.
 */
/*!
 * @name Constants and macros for entire LPI2C_MCFGR3 register
 */
/*@{*/
#define LPI2C_RD_MCFGR3(base)    (LPI2C_MCFGR3_REG(base))
#define LPI2C_WR_MCFGR3(base, value) (LPI2C_MCFGR3_REG(base) = (value))
#define LPI2C_RMW_MCFGR3(base, mask, value) (LPI2C_WR_MCFGR3(base, (LPI2C_RD_MCFGR3(base) & ~(mask)) | (value)))
#define LPI2C_SET_MCFGR3(base, value) (LPI2C_WR_MCFGR3(base, LPI2C_RD_MCFGR3(base) |  (value)))
#define LPI2C_CLR_MCFGR3(base, value) (LPI2C_WR_MCFGR3(base, LPI2C_RD_MCFGR3(base) & ~(value)))
#define LPI2C_TOG_MCFGR3(base, value) (LPI2C_WR_MCFGR3(base, LPI2C_RD_MCFGR3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MCFGR3 bitfields
 */

/*!
 * @name Register LPI2C_MCFGR3, field PINLOW[19:8] (RW)
 *
 * Configures the pin low timeout flag in clock cycles. If SCL and/or SDA is low
 * for longer than (PINLOW * 256) cycles then PLTF is set. When set to zero,
 * this feature is disabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR3_PINLOW field. */
#define LPI2C_RD_MCFGR3_PINLOW(base) ((LPI2C_MCFGR3_REG(base) & LPI2C_MCFGR3_PINLOW_MASK) >> LPI2C_MCFGR3_PINLOW_SHIFT)
#define LPI2C_BRD_MCFGR3_PINLOW(base) (LPI2C_RD_MCFGR3_PINLOW(base))

