nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the TXWATER field to a new value. */
#define LPI2C_WR_MFCR_TXWATER(base, value) (LPI2C_RMW_MFCR(base, LPI2C_MFCR_TXWATER_MASK, LPI2C_MFCR_TXWATER(value)))
#define LPI2C_BWR_MFCR_TXWATER(base, value) (LPI2C_WR_MFCR_TXWATER(base, value))
/*@}*/

/*!
 * @name Register LPI2C_MFCR, field RXWATER[23:16] (RW)
 *
 * The Receive Data Flag is set whenever the number of words in the receive FIFO
 * is greater than RXWATER. Writing a value equal or greater than the FIFO size
 * will be truncated.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MFCR_RXWATER field. */
#define LPI2C_RD_MFCR_RXWATER(base) ((LPI2C_MFCR_REG(base) & LPI2C_MFCR_RXWATER_MASK) >> LPI2C_MFCR_RXWATER_SHIFT)
#define LPI2C_BRD_MFCR_RXWATER(base) (LPI2C_RD_MFCR_RXWATER(base))

/*! @brief Set the RXWATER field to a new value. */
#define LPI2C_WR_MFCR_RXWATER(base, value) (LPI2C_RMW_MFCR(base, LPI2C_MFCR_RXWATER_MASK, LPI2C_MFCR_RXWATER(value)))
#define LPI2C_BWR_MFCR_RXWATER(base, value) (LPI2C_WR_MFCR_RXWATER(base, value))
/*@}*/

/*******************************************************************************
 * LPI2C_MFSR - Master FIFO Status Register
 ******************************************************************************/

/*!
 * @brief LPI2C_MFSR - Master FIFO Status Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_MFSR register
 */
/*@{*/
#define LPI2C_RD_MFSR(base)      (LPI2C_MFSR_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MFSR bitfields
 */

/*!
 * @name Register LPI2C_MFSR, field TXCOUNT[7:0] (RO)
 *
 * Returns the number of words in the transmit FIFO.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MFSR_TXCOUNT field. */
#define LPI2C_RD_MFSR_TXCOUNT(base) ((LPI2C_MFSR_REG(base) & LPI2C_MFSR_TXCOUNT_MASK) >> LPI2C_MFSR_TXCOUNT_SHIFT)
#define LPI2C_BRD_MFSR_TXCOUNT(base) (LPI2C_RD_MFSR_TXCOUNT(base))
/*@}*/

/*!
 * @name Register LPI2C_MFSR, field RXCOUNT[23:16] (RO)
 *
 * Returns the number of words in the receive FIFO.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MFSR_RXCOUNT field. */
#define LPI2C_RD_MFSR_RXCOUNT(base) ((LPI2C_MFSR_REG(base) & LPI2C_MFSR_RXCOUNT_MASK) >> LPI2C_MFSR_RXCOUNT_SHIFT)
#define LPI2C_BRD_MFSR_RXCOUNT(base) (LPI2C_RD_MFSR_RXCOUNT(base))
/*@}*/

/*******************************************************************************
 * LPI2C_MTDR - Master Transmit Data Register
 ******************************************************************************/

/*!
 * @brief LPI2C_MTDR - Master Transmit Data Register (WO)
 *
 * Reset value: 0x00000000U
 *
 * An 8-bit write to the CMD field will store the data in the Command FIFO, but
 * does not increment the FIFO write pointer. An 8-bit write to the DATA field
 * will zero extend the CMD field unless the CMD field has been written separately
 * since the last FIFO write, it also increments the FIFO write pointer. A 16-bit
 * or 32-bit will write both the CMD and DATA fields and increment the FIFO.
 */
/*!
 * @name Constants and macros for entire LPI2C_MTDR register
 */
/*@{*/
#define LPI2C_RD_MTDR(base)      (LPI2C_MTDR_REG(base))
#define LPI2C_WR_MTDR(base, value) (LPI2C_MTDR_REG(base) = (value))
#define LPI2C_RMW_MTDR(base, mask, value) (LPI2C_WR_MTDR(base, (LPI2C_RD_MTDR(base) & ~(mask)) | (value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MTDR bitfields
 */

/*!
 * @name Register LPI2C_MTDR, field DATA[7:0] (WO)
 *
 * Performing an 8-bit write to DATA will zero extend the CMD field.
 */
/*@{*/
/*! @brief Set the DATA field to a new value. */
#define LPI2C_WR_MTDR_DATA(base, value) (LPI2C_RMW_MTDR(base, LPI2C_MTDR_DATA_MASK, LPI2C_MTDR_DATA(value)))
#define LPI2C_BWR_MTDR_DATA(base, value) (LPI2C_WR_MTDR_DATA(base, value))
/*@}*/

/*!
 * @name Register LPI2C_MTDR, field CMD[10:8] (WO)
 *
 * Values:
 * - 0b000 - Transmit DATA[7:0].
 * - 0b001 - Receive (DATA[7:0] + 1) bytes.
 * - 0b010 - Generate STOP condition.
 * - 0b011 - Receive and discard (DATA[7:0] + 1) bytes.
 * - 0b100 - Generate (repeated) START and transmit address in DATA[7:0].
 * - 0b101 - Generate (repeated) START and transmit address in DATA[7:0]. This
 *     transfer expects a NACK to be returned.
 * - 0b110 - Generate (repeated) START and transmit address in DATA[7:0] using
 *     high speed mode.
 * - 0b111 - Generate (repeated) START and transmit address in DATA[7:0] using
 *     high speed mode. This transfer expects a NACK to be returned.
 */
/*@{*/
/*! @brief Set the CMD field to a new value. */
#define LPI2C_WR_MTDR_CMD(base, value) (LPI2C_RMW_MTDR(base, LPI2C_MTDR_CMD_MASK, LPI2C_MTDR_CMD(value)))
#define LPI2C_BWR_MTDR_CMD(base, value) (LPI2C_WR_MTDR_CMD(base, value))
/*@}*/

/*******************************************************************************
 * LPI2C_MRDR - Master Receive Data Register
 ******************************************************************************/

/*!
 * @brief LPI2C_MRDR - Master Receive Data Register (RO)
 *
 * Reset value: 0x00004000U
 */
/*!
 * @name Constants and macros for entire LPI2C_MRDR register
 */
/*@{*/
#define LPI2C_RD_MRDR(base)      (LPI2C_MRDR_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MRDR bitfields
 */

/*!
 * @name Register LPI2C_MRDR, field DATA[7:0] (RO)
 *
 * Reading this register returns the data received by the I2C master that has
 * not been discarded. Receive data can be discarded due to the CMD field or the
 * master can be configured to discard non-matching data.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MRDR_DATA field. */
#define LPI2C_RD_MRDR_DATA(base) ((LPI2C_MRDR_REG(base) & LPI2C_MRDR_DATA_MASK) >> LPI2C_MRDR_DATA_SHIFT)
#define LPI2C_BRD_MRDR_DATA(base) (LPI2C_RD_MRDR_DATA(base))
/*@}*/

/*!
 * @name Register LPI2C_MRDR, field RXEMPTY[14] (RO)
 *
 * Values:
 * - 0b0 - Receive FIFO is not empty.
 * - 0b1 - Receive FIFO is empty.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MRDR_RXEMPTY field. */
#define LPI2C_RD_MRDR_RXEMPTY(base) ((LPI2C_MRDR_REG(base) & LPI2C_MRDR_RXEMPTY_MASK) >> LPI2C_MRDR_RXEMPTY_SHIFT)
#define LPI2C_BRD_MRDR_RXEMPTY(base) (BITBAND_ACCESS32(&LPI2C_MRDR_REG(base), LPI2C_MRDR_RXEMPTY_SHIFT))
/*@}*/

