nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the CLKHOLD field to a new value. */
#define LPI2C_WR_SCFGR2_CLKHOLD(base, value) (LPI2C_RMW_SCFGR2(base, LPI2C_SCFGR2_CLKHOLD_MASK, LPI2C_SCFGR2_CLKHOLD(value)))
#define LPI2C_BWR_SCFGR2_CLKHOLD(base, value) (LPI2C_WR_SCFGR2_CLKHOLD(base, value))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR2, field DATAVD[13:8] (RW)
 *
 * Configures the SDA data valid delay time for the I2C slave equal to
 * FILTSCL+DATAVD+3 cycles. This data valid delay must be configured to less than the
 * minimum SCL low period. The I2C slave data valid delay time is not affected by the
 * PRESCALE configuration, and is disabled in high speed mode.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR2_DATAVD field. */
#define LPI2C_RD_SCFGR2_DATAVD(base) ((LPI2C_SCFGR2_REG(base) & LPI2C_SCFGR2_DATAVD_MASK) >> LPI2C_SCFGR2_DATAVD_SHIFT)
#define LPI2C_BRD_SCFGR2_DATAVD(base) (LPI2C_RD_SCFGR2_DATAVD(base))

/*! @brief Set the DATAVD field to a new value. */
#define LPI2C_WR_SCFGR2_DATAVD(base, value) (LPI2C_RMW_SCFGR2(base, LPI2C_SCFGR2_DATAVD_MASK, LPI2C_SCFGR2_DATAVD(value)))
#define LPI2C_BWR_SCFGR2_DATAVD(base, value) (LPI2C_WR_SCFGR2_DATAVD(base, value))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR2, field FILTSCL[19:16] (RW)
 *
 * Configures the I2C slave digital glitch filters for SCL input, a
 * configuration of 0 will disable the glitch filter. Glitches equal to or less than FILTSCL
 * cycles long will be filtered out and ignored. The latency through the glitch
 * filter is equal to FILTSCL+3 cycles and must be configured less than the
 * minimum SCL low or high period. The glitch filter cycle count is not affected by the
 * PRESCALE configuration, and is disabled in high speed mode.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR2_FILTSCL field. */
#define LPI2C_RD_SCFGR2_FILTSCL(base) ((LPI2C_SCFGR2_REG(base) & LPI2C_SCFGR2_FILTSCL_MASK) >> LPI2C_SCFGR2_FILTSCL_SHIFT)
#define LPI2C_BRD_SCFGR2_FILTSCL(base) (LPI2C_RD_SCFGR2_FILTSCL(base))

/*! @brief Set the FILTSCL field to a new value. */
#define LPI2C_WR_SCFGR2_FILTSCL(base, value) (LPI2C_RMW_SCFGR2(base, LPI2C_SCFGR2_FILTSCL_MASK, LPI2C_SCFGR2_FILTSCL(value)))
#define LPI2C_BWR_SCFGR2_FILTSCL(base, value) (LPI2C_WR_SCFGR2_FILTSCL(base, value))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR2, field FILTSDA[27:24] (RW)
 *
 * Configures the I2C slave digital glitch filters for SDA input, a
 * configuration of 0 will disable the glitch filter. Glitches equal to or less than FILTSDA
 * cycles long will be filtered out and ignored. The latency through the glitch
 * filter is equal to FILTSDA+3 cycles and must be configured less than the
 * minimum SCL low or high period. The glitch filter cycle count is not affected by the
 * PRESCALE configuration, and is disabled in high speed mode.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR2_FILTSDA field. */
#define LPI2C_RD_SCFGR2_FILTSDA(base) ((LPI2C_SCFGR2_REG(base) & LPI2C_SCFGR2_FILTSDA_MASK) >> LPI2C_SCFGR2_FILTSDA_SHIFT)
#define LPI2C_BRD_SCFGR2_FILTSDA(base) (LPI2C_RD_SCFGR2_FILTSDA(base))

/*! @brief Set the FILTSDA field to a new value. */
#define LPI2C_WR_SCFGR2_FILTSDA(base, value) (LPI2C_RMW_SCFGR2(base, LPI2C_SCFGR2_FILTSDA_MASK, LPI2C_SCFGR2_FILTSDA(value)))
#define LPI2C_BWR_SCFGR2_FILTSDA(base, value) (LPI2C_WR_SCFGR2_FILTSDA(base, value))
/*@}*/

/*******************************************************************************
 * LPI2C_SAMR - Slave Address Match Register
 ******************************************************************************/

/*!
 * @brief LPI2C_SAMR - Slave Address Match Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_SAMR register
 */
/*@{*/
#define LPI2C_RD_SAMR(base)      (LPI2C_SAMR_REG(base))
#define LPI2C_WR_SAMR(base, value) (LPI2C_SAMR_REG(base) = (value))
#define LPI2C_RMW_SAMR(base, mask, value) (LPI2C_WR_SAMR(base, (LPI2C_RD_SAMR(base) & ~(mask)) | (value)))
#define LPI2C_SET_SAMR(base, value) (LPI2C_WR_SAMR(base, LPI2C_RD_SAMR(base) |  (value)))
#define LPI2C_CLR_SAMR(base, value) (LPI2C_WR_SAMR(base, LPI2C_RD_SAMR(base) & ~(value)))
#define LPI2C_TOG_SAMR(base, value) (LPI2C_WR_SAMR(base, LPI2C_RD_SAMR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_SAMR bitfields
 */

/*!
 * @name Register LPI2C_SAMR, field ADDR0[10:1] (RW)
 *
 * Compared against the received address to detect the Slave Address. In 10-bit
 * mode, the first address byte is compared to { 11110, ADDR0[10:9] } and the
 * second address byte is compared to ADDR0[8:1]. In 7-bit mode, the address is
 * compared to ADDR0[7:1].
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SAMR_ADDR0 field. */
#define LPI2C_RD_SAMR_ADDR0(base) ((LPI2C_SAMR_REG(base) & LPI2C_SAMR_ADDR0_MASK) >> LPI2C_SAMR_ADDR0_SHIFT)
#define LPI2C_BRD_SAMR_ADDR0(base) (LPI2C_RD_SAMR_ADDR0(base))

/*! @brief Set the ADDR0 field to a new value. */
#define LPI2C_WR_SAMR_ADDR0(base, value) (LPI2C_RMW_SAMR(base, LPI2C_SAMR_ADDR0_MASK, LPI2C_SAMR_ADDR0(value)))
#define LPI2C_BWR_SAMR_ADDR0(base, value) (LPI2C_WR_SAMR_ADDR0(base, value))
/*@}*/

/*!
 * @name Register LPI2C_SAMR, field ADDR1[26:17] (RW)
 *
 * Compared against the received address to detect the Slave Address. In 10-bit
 * mode, the first address byte is compared to { 11110, ADDR1[10:9] } and the
 * second address byte is compared to ADDR1[8:1]. In 7-bit mode, the address is
 * compared to ADDR1[7:1].
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SAMR_ADDR1 field. */
#define LPI2C_RD_SAMR_ADDR1(base) ((LPI2C_SAMR_REG(base) & LPI2C_SAMR_ADDR1_MASK) >> LPI2C_SAMR_ADDR1_SHIFT)
#define LPI2C_BRD_SAMR_ADDR1(base) (LPI2C_RD_SAMR_ADDR1(base))

/*! @brief Set the ADDR1 field to a new value. */
#define LPI2C_WR_SAMR_ADDR1(base, value) (LPI2C_RMW_SAMR(base, LPI2C_SAMR_ADDR1_MASK, LPI2C_SAMR_ADDR1(value)))
#define LPI2C_BWR_SAMR_ADDR1(base, value) (LPI2C_WR_SAMR_ADDR1(base, value))
/*@}*/

