nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * LPI2C_SASR - Slave Address Status Register
 ******************************************************************************/

/*!
 * @brief LPI2C_SASR - Slave Address Status Register (RO)
 *
 * Reset value: 0x00004000U
 */
/*!
 * @name Constants and macros for entire LPI2C_SASR register
 */
/*@{*/
#define LPI2C_RD_SASR(base)      (LPI2C_SASR_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPI2C_SASR bitfields
 */

/*!
 * @name Register LPI2C_SASR, field RADDR[10:0] (RO)
 *
 * RADDR updates whenever the AMF is set and the AMF is cleared by reading this
 * register. In 7-bit mode, the address byte is store in RADDR[7:0]. In 10-bit
 * mode, the first address byte is { 11110, RADDR[10:9], RADDR[0] } and the second
 * address byte is RADDR[8:1]. The R/W bit is therefore always stored in RADDR[0].
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SASR_RADDR field. */
#define LPI2C_RD_SASR_RADDR(base) ((LPI2C_SASR_REG(base) & LPI2C_SASR_RADDR_MASK) >> LPI2C_SASR_RADDR_SHIFT)
#define LPI2C_BRD_SASR_RADDR(base) (LPI2C_RD_SASR_RADDR(base))
/*@}*/

/*!
 * @name Register LPI2C_SASR, field ANV[14] (RO)
 *
 * Values:
 * - 0b0 - RADDR is valid.
 * - 0b1 - RADDR is not valid.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SASR_ANV field. */
#define LPI2C_RD_SASR_ANV(base) ((LPI2C_SASR_REG(base) & LPI2C_SASR_ANV_MASK) >> LPI2C_SASR_ANV_SHIFT)
#define LPI2C_BRD_SASR_ANV(base) (BITBAND_ACCESS32(&LPI2C_SASR_REG(base), LPI2C_SASR_ANV_SHIFT))
/*@}*/

/*******************************************************************************
 * LPI2C_STAR - Slave Transmit ACK Register
 ******************************************************************************/

/*!
 * @brief LPI2C_STAR - Slave Transmit ACK Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_STAR register
 */
/*@{*/
#define LPI2C_RD_STAR(base)      (LPI2C_STAR_REG(base))
#define LPI2C_WR_STAR(base, value) (LPI2C_STAR_REG(base) = (value))
#define LPI2C_RMW_STAR(base, mask, value) (LPI2C_WR_STAR(base, (LPI2C_RD_STAR(base) & ~(mask)) | (value)))
#define LPI2C_SET_STAR(base, value) (LPI2C_WR_STAR(base, LPI2C_RD_STAR(base) |  (value)))
#define LPI2C_CLR_STAR(base, value) (LPI2C_WR_STAR(base, LPI2C_RD_STAR(base) & ~(value)))
#define LPI2C_TOG_STAR(base, value) (LPI2C_WR_STAR(base, LPI2C_RD_STAR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_STAR bitfields
 */

/*!
 * @name Register LPI2C_STAR, field TXNACK[0] (RW)
 *
 * When NACKSTALL is set, must be written once for each matching address byte
 * and each received word. Can also be written when LPI2C Slave is disabled or idle
 * to configure the default ACK/NACK.
 *
 * Values:
 * - 0b0 - Transmit ACK for received word.
 * - 0b1 - Transmit NACK for received word.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_STAR_TXNACK field. */
#define LPI2C_RD_STAR_TXNACK(base) ((LPI2C_STAR_REG(base) & LPI2C_STAR_TXNACK_MASK) >> LPI2C_STAR_TXNACK_SHIFT)
#define LPI2C_BRD_STAR_TXNACK(base) (BITBAND_ACCESS32(&LPI2C_STAR_REG(base), LPI2C_STAR_TXNACK_SHIFT))

/*! @brief Set the TXNACK field to a new value. */
#define LPI2C_WR_STAR_TXNACK(base, value) (LPI2C_RMW_STAR(base, LPI2C_STAR_TXNACK_MASK, LPI2C_STAR_TXNACK(value)))
#define LPI2C_BWR_STAR_TXNACK(base, value) (BITBAND_ACCESS32(&LPI2C_STAR_REG(base), LPI2C_STAR_TXNACK_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LPI2C_STDR - Slave Transmit Data Register
 ******************************************************************************/

/*!
 * @brief LPI2C_STDR - Slave Transmit Data Register (WO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_STDR register
 */
/*@{*/
#define LPI2C_RD_STDR(base)      (LPI2C_STDR_REG(base))
#define LPI2C_WR_STDR(base, value) (LPI2C_STDR_REG(base) = (value))
#define LPI2C_RMW_STDR(base, mask, value) (LPI2C_WR_STDR(base, (LPI2C_RD_STDR(base) & ~(mask)) | (value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_STDR bitfields
 */

/*!
 * @name Register LPI2C_STDR, field DATA[7:0] (WO)
 *
 * Writing this register will store I2C slave transmit data in the transmit
 * register.
 */
/*@{*/
/*! @brief Set the DATA field to a new value. */
#define LPI2C_WR_STDR_DATA(base, value) (LPI2C_RMW_STDR(base, LPI2C_STDR_DATA_MASK, LPI2C_STDR_DATA(value)))
#define LPI2C_BWR_STDR_DATA(base, value) (LPI2C_WR_STDR_DATA(base, value))
/*@}*/

/*******************************************************************************
 * LPI2C_SRDR - Slave Receive Data Register
 ******************************************************************************/

/*!
 * @brief LPI2C_SRDR - Slave Receive Data Register (RO)
 *
 * Reset value: 0x00004000U
 */
/*!
 * @name Constants and macros for entire LPI2C_SRDR register
 */
/*@{*/
#define LPI2C_RD_SRDR(base)      (LPI2C_SRDR_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPI2C_SRDR bitfields
 */

/*!
 * @name Register LPI2C_SRDR, field DATA[7:0] (RO)
 *
 * Reading this register returns the data received by the I2C slave.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SRDR_DATA field. */
#define LPI2C_RD_SRDR_DATA(base) ((LPI2C_SRDR_REG(base) & LPI2C_SRDR_DATA_MASK) >> LPI2C_SRDR_DATA_SHIFT)
#define LPI2C_BRD_SRDR_DATA(base) (LPI2C_RD_SRDR_DATA(base))
/*@}*/

/*!
 * @name Register LPI2C_SRDR, field RXEMPTY[14] (RO)
 *
 * Values:
 * - 0b0 - The Receive Data Register is not empty.
 * - 0b1 - The Receive Data Register is empty.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SRDR_RXEMPTY field. */
#define LPI2C_RD_SRDR_RXEMPTY(base) ((LPI2C_SRDR_REG(base) & LPI2C_SRDR_RXEMPTY_MASK) >> LPI2C_SRDR_RXEMPTY_SHIFT)
#define LPI2C_BRD_SRDR_RXEMPTY(base) (BITBAND_ACCESS32(&LPI2C_SRDR_REG(base), LPI2C_SRDR_RXEMPTY_SHIFT))
/*@}*/

/*!
 * @name Register LPI2C_SRDR, field SOF[15] (RO)
 *
 * Values:
 * - 0b0 - Indicates this is not the first data word since a (repeated) START or
 *     STOP condition.
 * - 0b1 - Indicates this is the first data word since a (repeated) START or
 *     STOP condition.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SRDR_SOF field. */
#define LPI2C_RD_SRDR_SOF(base) ((LPI2C_SRDR_REG(base) & LPI2C_SRDR_SOF_MASK) >> LPI2C_SRDR_SOF_SHIFT)
#define LPI2C_BRD_SRDR_SOF(base) (BITBAND_ACCESS32(&LPI2C_SRDR_REG(base), LPI2C_SRDR_SOF_SHIFT))
/*@}*/

