nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * S32K144 LPIT
 *
 * Low Power Periodic Interrupt Timer (LPIT)
 *
 * Registers defined in this header file:
 * - LPIT_VERID - Version ID Register
 * - LPIT_PARAM - Parameter Register
 * - LPIT_MCR - Module Control Register
 * - LPIT_MSR - Module Status Register
 * - LPIT_MIER - Module Interrupt Enable Register
 * - LPIT_SETTEN - Set Timer Enable Register
 * - LPIT_CLRTEN - Clear Timer Enable Register
 * - LPIT_RSVD - Reserved Register
 * - LPIT_TVAL0 - Timer Value Register
 * - LPIT_CVAL0 - Current Timer Value
 * - LPIT_TCTRL0 - Timer Control Register
 * - LPIT_RFU0 - Reserved for Future Use
 * - LPIT_TVAL1 - Timer Value Register
 * - LPIT_CVAL1 - Current Timer Value
 * - LPIT_TCTRL1 - Timer Control Register
 * - LPIT_RFU1 - Reserved for Future Use
 * - LPIT_TVAL2 - Timer Value Register
 * - LPIT_CVAL2 - Current Timer Value
 * - LPIT_TCTRL2 - Timer Control Register
 * - LPIT_RFU2 - Reserved for Future Use
 * - LPIT_TVAL3 - Timer Value Register
 * - LPIT_CVAL3 - Current Timer Value
 * - LPIT_TCTRL3 - Timer Control Register
 * - LPIT_RFU3 - Reserved for Future Use
 */

#define LPIT_INSTANCE_COUNT (1U) /*!< Number of instances of the LPIT module. */
#define LPIT0_IDX (0U) /*!< Instance number for LPIT0. */

/*******************************************************************************
 * LPIT_VERID - Version ID Register
 ******************************************************************************/

/*!
 * @brief LPIT_VERID - Version ID Register (RO)
 *
 * Reset value: 0x01000000U
 */
/*!
 * @name Constants and macros for entire LPIT_VERID register
 */
/*@{*/
#define LPIT_RD_VERID(base)      (LPIT_VERID_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPIT_VERID bitfields
 */

/*!
 * @name Register LPIT_VERID, field FEATURE[15:0] (RO)
 *
 * This read only field returns the feature set number.
 */
/*@{*/
/*! @brief Read current value of the LPIT_VERID_FEATURE field. */
#define LPIT_RD_VERID_FEATURE(base) ((LPIT_VERID_REG(base) & LPIT_VERID_FEATURE_MASK) >> LPIT_VERID_FEATURE_SHIFT)
#define LPIT_BRD_VERID_FEATURE(base) (LPIT_RD_VERID_FEATURE(base))
/*@}*/

/*!
 * @name Register LPIT_VERID, field MINOR[23:16] (RO)
 *
 * This read only field returns the minor version number for the module
 * specification
 */
/*@{*/
/*! @brief Read current value of the LPIT_VERID_MINOR field. */
#define LPIT_RD_VERID_MINOR(base) ((LPIT_VERID_REG(base) & LPIT_VERID_MINOR_MASK) >> LPIT_VERID_MINOR_SHIFT)
#define LPIT_BRD_VERID_MINOR(base) (LPIT_RD_VERID_MINOR(base))
/*@}*/

/*!
 * @name Register LPIT_VERID, field MAJOR[31:24] (RO)
 *
 * This read only field returns the major version number for the module
 * specification
 */
/*@{*/
/*! @brief Read current value of the LPIT_VERID_MAJOR field. */
#define LPIT_RD_VERID_MAJOR(base) ((LPIT_VERID_REG(base) & LPIT_VERID_MAJOR_MASK) >> LPIT_VERID_MAJOR_SHIFT)
#define LPIT_BRD_VERID_MAJOR(base) (LPIT_RD_VERID_MAJOR(base))
/*@}*/

/*******************************************************************************
 * LPIT_PARAM - Parameter Register
 ******************************************************************************/

/*!
 * @brief LPIT_PARAM - Parameter Register (RO)
 *
 * Reset value: 0x00000404U
 *
 * This register provides details on the parameter settings that were used while
 * including this module in the device.
 */
/*!
 * @name Constants and macros for entire LPIT_PARAM register
 */
/*@{*/
#define LPIT_RD_PARAM(base)      (LPIT_PARAM_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPIT_PARAM bitfields
 */

/*!
 * @name Register LPIT_PARAM, field CHANNEL[7:0] (RO)
 *
 * Number of timer channels implemented.
 */
/*@{*/
/*! @brief Read current value of the LPIT_PARAM_CHANNEL field. */
#define LPIT_RD_PARAM_CHANNEL(base) ((LPIT_PARAM_REG(base) & LPIT_PARAM_CHANNEL_MASK) >> LPIT_PARAM_CHANNEL_SHIFT)
#define LPIT_BRD_PARAM_CHANNEL(base) (LPIT_RD_PARAM_CHANNEL(base))
/*@}*/

/*!
 * @name Register LPIT_PARAM, field EXT_TRIG[15:8] (RO)
 *
 * Number of external triggers implemented.
 */
/*@{*/
/*! @brief Read current value of the LPIT_PARAM_EXT_TRIG field. */
#define LPIT_RD_PARAM_EXT_TRIG(base) ((LPIT_PARAM_REG(base) & LPIT_PARAM_EXT_TRIG_MASK) >> LPIT_PARAM_EXT_TRIG_SHIFT)
#define LPIT_BRD_PARAM_EXT_TRIG(base) (LPIT_RD_PARAM_EXT_TRIG(base))
/*@}*/

/*******************************************************************************
 * LPIT_MCR - Module Control Register
 ******************************************************************************/

/*!
 * @brief LPIT_MCR - Module Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPIT_MCR register
 */
/*@{*/
#define LPIT_RD_MCR(base)        (LPIT_MCR_REG(base))
#define LPIT_WR_MCR(base, value) (LPIT_MCR_REG(base) = (value))
#define LPIT_RMW_MCR(base, mask, value) (LPIT_WR_MCR(base, (LPIT_RD_MCR(base) & ~(mask)) | (value)))
#define LPIT_SET_MCR(base, value) (LPIT_WR_MCR(base, LPIT_RD_MCR(base) |  (value)))
#define LPIT_CLR_MCR(base, value) (LPIT_WR_MCR(base, LPIT_RD_MCR(base) & ~(value)))
#define LPIT_TOG_MCR(base, value) (LPIT_WR_MCR(base, LPIT_RD_MCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPIT_MCR bitfields
 */

/*!
 * @name Register LPIT_MCR, field M_CEN[0] (RW)
 *
 * Enables the peripheral clock to the module timers. This bit must be asserted
 * when writing to timer registers. Both clocks (bus clock and peripheral clock)
 * must be enabled to allow for clock synchronization and update of register
 * bits. Writing to the SETTEN , CLRTEN, TCTRL, and TVAL while M_CEN = 0, will lead
 * to assertion of transfer error for that bus cycle. Writing to CVAL and Reserved
 * registers will always generate transfer error.
 *
 * Values:
 * - 0b0 - Protocol clock to timers is disabled
 * - 0b1 - Protocol clock to timers is enabled
 */
/*@{*/
/*! @brief Read current value of the LPIT_MCR_M_CEN field. */
#define LPIT_RD_MCR_M_CEN(base) ((LPIT_MCR_REG(base) & LPIT_MCR_M_CEN_MASK) >> LPIT_MCR_M_CEN_SHIFT)
#define LPIT_BRD_MCR_M_CEN(base) (BITBAND_ACCESS32(&LPIT_MCR_REG(base), LPIT_MCR_M_CEN_SHIFT))

/*! @brief Set the M_CEN field to a new value. */
#define LPIT_WR_MCR_M_CEN(base, value) (LPIT_RMW_MCR(base, LPIT_MCR_M_CEN_MASK, LPIT_MCR_M_CEN(value)))
#define LPIT_BWR_MCR_M_CEN(base, value) (BITBAND_ACCESS32(&LPIT_MCR_REG(base), LPIT_MCR_M_CEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPIT_MCR, field SW_RST[1] (RW)
 *
 * Resets all channels and registers, except the Module Control Register.
 * Remains set until cleared by software.
 *
 * Values:
 * - 0b0 - Timer channels and registers are not reset
 * - 0b1 - Timer channels and registers are reset
 */
/*@{*/
/*! @brief Read current value of the LPIT_MCR_SW_RST field. */
#define LPIT_RD_MCR_SW_RST(base) ((LPIT_MCR_REG(base) & LPIT_MCR_SW_RST_MASK) >> LPIT_MCR_SW_RST_SHIFT)
#define LPIT_BRD_MCR_SW_RST(base) (BITBAND_ACCESS32(&LPIT_MCR_REG(base), LPIT_MCR_SW_RST_SHIFT))

/*! @brief Set the SW_RST field to a new value. */
#define LPIT_WR_MCR_SW_RST(base, value) (LPIT_RMW_MCR(base, LPIT_MCR_SW_RST_MASK, LPIT_MCR_SW_RST(value)))
#define LPIT_BWR_MCR_SW_RST(base, value) (BITBAND_ACCESS32(&LPIT_MCR_REG(base), LPIT_MCR_SW_RST_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPIT_MCR, field DOZE_EN[2] (RW)
 *
 * Allows the timer channels to be stopped or continue to run when the device
 * enters the DOZE mode
 *
 * Values:
 * - 0b0 - Timer channels are stopped in DOZE mode
 * - 0b1 - Timer channels continue to run in DOZE mode
 */
/*@{*/
/*! @brief Read current value of the LPIT_MCR_DOZE_EN field. */
#define LPIT_RD_MCR_DOZE_EN(base) ((LPIT_MCR_REG(base) & LPIT_MCR_DOZE_EN_MASK) >> LPIT_MCR_DOZE_EN_SHIFT)
#define LPIT_BRD_MCR_DOZE_EN(base) (BITBAND_ACCESS32(&LPIT_MCR_REG(base), LPIT_MCR_DOZE_EN_SHIFT))

/*! @brief Set the DOZE_EN field to a new value. */
#define LPIT_WR_MCR_DOZE_EN(base, value) (LPIT_RMW_MCR(base, LPIT_MCR_DOZE_EN_MASK, LPIT_MCR_DOZE_EN(value)))
#define LPIT_BWR_MCR_DOZE_EN(base, value) (BITBAND_ACCESS32(&LPIT_MCR_REG(base), LPIT_MCR_DOZE_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPIT_MCR, field DBG_EN[3] (RW)
 *
 * Allows the timer channels to be stopped when the device enters the Debug mode
 *
 * Values:
 * - 0b0 - Timer channels are stopped in Debug mode
 * - 0b1 - Timer channels continue to run in Debug mode
 */
/*@{*/
/*! @brief Read current value of the LPIT_MCR_DBG_EN field. */
#define LPIT_RD_MCR_DBG_EN(base) ((LPIT_MCR_REG(base) & LPIT_MCR_DBG_EN_MASK) >> LPIT_MCR_DBG_EN_SHIFT)
#define LPIT_BRD_MCR_DBG_EN(base) (BITBAND_ACCESS32(&LPIT_MCR_REG(base), LPIT_MCR_DBG_EN_SHIFT))

/*! @brief Set the DBG_EN field to a new value. */
#define LPIT_WR_MCR_DBG_EN(base, value) (LPIT_RMW_MCR(base, LPIT_MCR_DBG_EN_MASK, LPIT_MCR_DBG_EN(value)))
#define LPIT_BWR_MCR_DBG_EN(base, value) (BITBAND_ACCESS32(&LPIT_MCR_REG(base), LPIT_MCR_DBG_EN_SHIFT) = (value))
/*@}*/

