nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * LPIT_RSVD - Reserved Register
 ******************************************************************************/

/*!
 * @brief LPIT_RSVD - Reserved Register (ROZ)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPIT_RSVD register
 */
/*@{*/
#define LPIT_RD_RSVD(base)       (LPIT_RSVD_REG(base))
/*@}*/

/*******************************************************************************
 * LPIT_TVAL0 - Timer Value Register
 ******************************************************************************/

/*!
 * @brief LPIT_TVAL0 - Timer Value Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * In compare modes, these registers select the timeout period for the timer
 * channels. In capture modes, these registers are loaded with the value of the
 * counter when the trigger asserts.
 */
/*!
 * @name Constants and macros for entire LPIT_TVAL0 register
 */
/*@{*/
#define LPIT_RD_TVAL0(base)      (LPIT_TVAL0_REG(base))
#define LPIT_WR_TVAL0(base, value) (LPIT_TVAL0_REG(base) = (value))
#define LPIT_RMW_TVAL0(base, mask, value) (LPIT_WR_TVAL0(base, (LPIT_RD_TVAL0(base) & ~(mask)) | (value)))
#define LPIT_SET_TVAL0(base, value) (LPIT_WR_TVAL0(base, LPIT_RD_TVAL0(base) |  (value)))
#define LPIT_CLR_TVAL0(base, value) (LPIT_WR_TVAL0(base, LPIT_RD_TVAL0(base) & ~(value)))
#define LPIT_TOG_TVAL0(base, value) (LPIT_WR_TVAL0(base, LPIT_RD_TVAL0(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * LPIT_CVAL0 - Current Timer Value
 ******************************************************************************/

/*!
 * @brief LPIT_CVAL0 - Current Timer Value (RO)
 *
 * Reset value: 0xFFFFFFFFU
 *
 * These registers indicate the current timer counter value.
 */
/*!
 * @name Constants and macros for entire LPIT_CVAL0 register
 */
/*@{*/
#define LPIT_RD_CVAL0(base)      (LPIT_CVAL0_REG(base))
/*@}*/

/*******************************************************************************
 * LPIT_TCTRL0 - Timer Control Register
 ******************************************************************************/

/*!
 * @brief LPIT_TCTRL0 - Timer Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * These registers contain the control bits for each timer channel
 */
/*!
 * @name Constants and macros for entire LPIT_TCTRL0 register
 */
/*@{*/
#define LPIT_RD_TCTRL0(base)     (LPIT_TCTRL0_REG(base))
#define LPIT_WR_TCTRL0(base, value) (LPIT_TCTRL0_REG(base) = (value))
#define LPIT_RMW_TCTRL0(base, mask, value) (LPIT_WR_TCTRL0(base, (LPIT_RD_TCTRL0(base) & ~(mask)) | (value)))
#define LPIT_SET_TCTRL0(base, value) (LPIT_WR_TCTRL0(base, LPIT_RD_TCTRL0(base) |  (value)))
#define LPIT_CLR_TCTRL0(base, value) (LPIT_WR_TCTRL0(base, LPIT_RD_TCTRL0(base) & ~(value)))
#define LPIT_TOG_TCTRL0(base, value) (LPIT_WR_TCTRL0(base, LPIT_RD_TCTRL0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPIT_TCTRL0 bitfields
 */

/*!
 * @name Register LPIT_TCTRL0, field T_EN[0] (RW)
 *
 * Enables or disables the Timer Channel
 *
 * Values:
 * - 0b0 - Timer Channel is disabled
 * - 0b1 - Timer Channel is enabled
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL0_T_EN field. */
#define LPIT_RD_TCTRL0_T_EN(base) ((LPIT_TCTRL0_REG(base) & LPIT_TCTRL0_T_EN_MASK) >> LPIT_TCTRL0_T_EN_SHIFT)
#define LPIT_BRD_TCTRL0_T_EN(base) (BITBAND_ACCESS32(&LPIT_TCTRL0_REG(base), LPIT_TCTRL0_T_EN_SHIFT))

/*! @brief Set the T_EN field to a new value. */
#define LPIT_WR_TCTRL0_T_EN(base, value) (LPIT_RMW_TCTRL0(base, LPIT_TCTRL0_T_EN_MASK, LPIT_TCTRL0_T_EN(value)))
#define LPIT_BWR_TCTRL0_T_EN(base, value) (BITBAND_ACCESS32(&LPIT_TCTRL0_REG(base), LPIT_TCTRL0_T_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPIT_TCTRL0, field CHAIN[1] (RW)
 *
 * When enabled, timer channel will decrement when channel N-1 trigger asserts.
 * Channel 0 cannot be chained.
 *
 * Values:
 * - 0b0 - Channel Chaining is disabled. Channel Timer runs independently.
 * - 0b1 - Channel Chaining is enabled. Timer decrements on previous channel's
 *     timeout
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL0_CHAIN field. */
#define LPIT_RD_TCTRL0_CHAIN(base) ((LPIT_TCTRL0_REG(base) & LPIT_TCTRL0_CHAIN_MASK) >> LPIT_TCTRL0_CHAIN_SHIFT)
#define LPIT_BRD_TCTRL0_CHAIN(base) (BITBAND_ACCESS32(&LPIT_TCTRL0_REG(base), LPIT_TCTRL0_CHAIN_SHIFT))

/*! @brief Set the CHAIN field to a new value. */
#define LPIT_WR_TCTRL0_CHAIN(base, value) (LPIT_RMW_TCTRL0(base, LPIT_TCTRL0_CHAIN_MASK, LPIT_TCTRL0_CHAIN(value)))
#define LPIT_BWR_TCTRL0_CHAIN(base, value) (BITBAND_ACCESS32(&LPIT_TCTRL0_REG(base), LPIT_TCTRL0_CHAIN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPIT_TCTRL0, field MODE[3:2] (RW)
 *
 * Configures the Channel Timer Mode of Operation. The mode bits control how the
 * timer decrements. See Functional Description for more details.
 *
 * Values:
 * - 0b00 - 32-bit Periodic Counter
 * - 0b01 - Dual 16-bit Periodic Counter
 * - 0b10 - 32-bit Trigger Accumulator
 * - 0b11 - 32-bit Trigger Input Capture
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL0_MODE field. */
#define LPIT_RD_TCTRL0_MODE(base) ((LPIT_TCTRL0_REG(base) & LPIT_TCTRL0_MODE_MASK) >> LPIT_TCTRL0_MODE_SHIFT)
#define LPIT_BRD_TCTRL0_MODE(base) (LPIT_RD_TCTRL0_MODE(base))

/*! @brief Set the MODE field to a new value. */
#define LPIT_WR_TCTRL0_MODE(base, value) (LPIT_RMW_TCTRL0(base, LPIT_TCTRL0_MODE_MASK, LPIT_TCTRL0_MODE(value)))
#define LPIT_BWR_TCTRL0_MODE(base, value) (LPIT_WR_TCTRL0_MODE(base, value))
/*@}*/

/*!
 * @name Register LPIT_TCTRL0, field TSOT[16] (RW)
 *
 * This bit controls when the timer starts decrementing.
 *
 * Values:
 * - 0b0 - Timer starts to decrement immediately based on restart condition
 *     (controlled by TSOI bit)
 * - 0b1 - Timer starts to decrement when rising edge on selected trigger is
 *     detected
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL0_TSOT field. */
#define LPIT_RD_TCTRL0_TSOT(base) ((LPIT_TCTRL0_REG(base) & LPIT_TCTRL0_TSOT_MASK) >> LPIT_TCTRL0_TSOT_SHIFT)
#define LPIT_BRD_TCTRL0_TSOT(base) (BITBAND_ACCESS32(&LPIT_TCTRL0_REG(base), LPIT_TCTRL0_TSOT_SHIFT))

/*! @brief Set the TSOT field to a new value. */
#define LPIT_WR_TCTRL0_TSOT(base, value) (LPIT_RMW_TCTRL0(base, LPIT_TCTRL0_TSOT_MASK, LPIT_TCTRL0_TSOT(value)))
#define LPIT_BWR_TCTRL0_TSOT(base, value) (BITBAND_ACCESS32(&LPIT_TCTRL0_REG(base), LPIT_TCTRL0_TSOT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPIT_TCTRL0, field TSOI[17] (RW)
 *
 * This bit controls whether the channel timer will stop after it times out and
 * when it can restart (when TSOT = 0). If TSOT = 1, then the timer will stop on
 * timeout and will restart after a rising edge on the selected trigger is
 * detected. If TSOT = 0, then this bit controls when the timer restarts.
 *
 * Values:
 * - 0b0 - Timer does not stop after timeout
 * - 0b1 - Timer will stop after timeout and will restart after rising edge on
 *     the T_EN bit is detected (i.e. timer channel is disabled and then enabled)
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL0_TSOI field. */
#define LPIT_RD_TCTRL0_TSOI(base) ((LPIT_TCTRL0_REG(base) & LPIT_TCTRL0_TSOI_MASK) >> LPIT_TCTRL0_TSOI_SHIFT)
#define LPIT_BRD_TCTRL0_TSOI(base) (BITBAND_ACCESS32(&LPIT_TCTRL0_REG(base), LPIT_TCTRL0_TSOI_SHIFT))

/*! @brief Set the TSOI field to a new value. */
#define LPIT_WR_TCTRL0_TSOI(base, value) (LPIT_RMW_TCTRL0(base, LPIT_TCTRL0_TSOI_MASK, LPIT_TCTRL0_TSOI(value)))
#define LPIT_BWR_TCTRL0_TSOI(base, value) (BITBAND_ACCESS32(&LPIT_TCTRL0_REG(base), LPIT_TCTRL0_TSOI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPIT_TCTRL0, field TROT[18] (RW)
 *
 * When set, the LPIT timer will reload when a rising edge is detected on the
 * selected trigger input. The trigger input is ignored if the LPIT is disabled
 * during debug mode or DOZE mode (DOZE_EN or DBGEN = 0)
 *
 * Values:
 * - 0b0 - Timer will not reload on selected trigger
 * - 0b1 - Timer will reload on selected trigger
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL0_TROT field. */
#define LPIT_RD_TCTRL0_TROT(base) ((LPIT_TCTRL0_REG(base) & LPIT_TCTRL0_TROT_MASK) >> LPIT_TCTRL0_TROT_SHIFT)
#define LPIT_BRD_TCTRL0_TROT(base) (BITBAND_ACCESS32(&LPIT_TCTRL0_REG(base), LPIT_TCTRL0_TROT_SHIFT))

/*! @brief Set the TROT field to a new value. */
#define LPIT_WR_TCTRL0_TROT(base, value) (LPIT_RMW_TCTRL0(base, LPIT_TCTRL0_TROT_MASK, LPIT_TCTRL0_TROT(value)))
#define LPIT_BWR_TCTRL0_TROT(base, value) (BITBAND_ACCESS32(&LPIT_TCTRL0_REG(base), LPIT_TCTRL0_TROT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPIT_TCTRL0, field TRG_SRC[23] (RW)
 *
 * Selects between internal or external trigger sources. The final trigger is
 * selected by TRG_SEL depending on which trigger source out of internal triggers
 * or external triggers are selected by TRG_SRC. Refer to the chip configuration
 * section for available external trigger options. If a channel does not have an
 * associated external trigger then this bit for that channel should be set to 1.
 *
 * Values:
 * - 0b0 - Trigger source selected in external
 * - 0b1 - Trigger source selected is the internal trigger
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL0_TRG_SRC field. */
#define LPIT_RD_TCTRL0_TRG_SRC(base) ((LPIT_TCTRL0_REG(base) & LPIT_TCTRL0_TRG_SRC_MASK) >> LPIT_TCTRL0_TRG_SRC_SHIFT)
#define LPIT_BRD_TCTRL0_TRG_SRC(base) (BITBAND_ACCESS32(&LPIT_TCTRL0_REG(base), LPIT_TCTRL0_TRG_SRC_SHIFT))

/*! @brief Set the TRG_SRC field to a new value. */
#define LPIT_WR_TCTRL0_TRG_SRC(base, value) (LPIT_RMW_TCTRL0(base, LPIT_TCTRL0_TRG_SRC_MASK, LPIT_TCTRL0_TRG_SRC(value)))
#define LPIT_BWR_TCTRL0_TRG_SRC(base, value) (BITBAND_ACCESS32(&LPIT_TCTRL0_REG(base), LPIT_TCTRL0_TRG_SRC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPIT_TCTRL0, field TRG_SEL[27:24] (RW)
 *
 * Selects the trigger to use for starting and/or reloading the LPIT timer. This
 * field should only be changed when the LPIT timer channel is disabled. The
 * TRG_SRC bit selects between internal and external trigger signals for each
 * channel. The TRG_SEL bits select one trigger from the set of internal or external
 * triggers selected by TRG_SRC.
 *
 * Values:
 * - 0b0000 - Timer channel 0 trigger source is selected
 * - 0b0001 - Timer channel 1 trigger source is selected
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL0_TRG_SEL field. */
#define LPIT_RD_TCTRL0_TRG_SEL(base) ((LPIT_TCTRL0_REG(base) & LPIT_TCTRL0_TRG_SEL_MASK) >> LPIT_TCTRL0_TRG_SEL_SHIFT)
#define LPIT_BRD_TCTRL0_TRG_SEL(base) (LPIT_RD_TCTRL0_TRG_SEL(base))

