nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the TRG_SEL field to a new value. */
#define LPIT_WR_TCTRL3_TRG_SEL(base, value) (LPIT_RMW_TCTRL3(base, LPIT_TCTRL3_TRG_SEL_MASK, LPIT_TCTRL3_TRG_SEL(value)))
#define LPIT_BWR_TCTRL3_TRG_SEL(base, value) (LPIT_WR_TCTRL3_TRG_SEL(base, value))
/*@}*/

/*******************************************************************************
 * LPIT_RFU3 - Reserved for Future Use
 ******************************************************************************/

/*!
 * @brief LPIT_RFU3 - Reserved for Future Use (ROZ)
 *
 * Reset value: 0x00000000U
 *
 * This register location is reserved for future use.
 */
/*!
 * @name Constants and macros for entire LPIT_RFU3 register
 */
/*@{*/
#define LPIT_RD_RFU3(base)       (LPIT_RFU3_REG(base))
/*@}*/

/*
 * S32K144 LPSPI
 *
 * The LPSPI Memory Map/Register Definition can be found here.
 *
 * Registers defined in this header file:
 * - LPSPI_VERID - Version ID Register
 * - LPSPI_PARAM - Parameter Register
 * - LPSPI_CR - Control Register
 * - LPSPI_SR - Status Register
 * - LPSPI_IER - Interrupt Enable Register
 * - LPSPI_DER - DMA Enable Register
 * - LPSPI_CFGR0 - Configuration Register 0
 * - LPSPI_CFGR1 - Configuration Register 1
 * - LPSPI_DMR0 - Data Match Register 0
 * - LPSPI_DMR1 - Data Match Register 1
 * - LPSPI_CCR - Clock Configuration Register
 * - LPSPI_FCR - FIFO Control Register
 * - LPSPI_FSR - FIFO Status Register
 * - LPSPI_TCR - Transmit Command Register
 * - LPSPI_TDR - Transmit Data Register
 * - LPSPI_RSR - Receive Status Register
 * - LPSPI_RDR - Receive Data Register
 */

#define LPSPI_INSTANCE_COUNT (3U) /*!< Number of instances of the LPSPI module. */
#define LPSPI0_IDX (0U) /*!< Instance number for LPSPI0. */
#define LPSPI1_IDX (1U) /*!< Instance number for LPSPI1. */
#define LPSPI2_IDX (2U) /*!< Instance number for LPSPI2. */

/*******************************************************************************
 * LPSPI_VERID - Version ID Register
 ******************************************************************************/

/*!
 * @brief LPSPI_VERID - Version ID Register (RO)
 *
 * Reset value: 0x01000004U
 *
 * .
 */
/*!
 * @name Constants and macros for entire LPSPI_VERID register
 */
/*@{*/
#define LPSPI_RD_VERID(base)     (LPSPI_VERID_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPSPI_VERID bitfields
 */

/*!
 * @name Register LPSPI_VERID, field FEATURE[15:0] (RO)
 *
 * This read only field returns the feature set number.
 *
 * Values:
 * - 0b0000000000000100 - Standard feature set supporting 32-bit shift register.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_VERID_FEATURE field. */
#define LPSPI_RD_VERID_FEATURE(base) ((LPSPI_VERID_REG(base) & LPSPI_VERID_FEATURE_MASK) >> LPSPI_VERID_FEATURE_SHIFT)
#define LPSPI_BRD_VERID_FEATURE(base) (LPSPI_RD_VERID_FEATURE(base))
/*@}*/

/*!
 * @name Register LPSPI_VERID, field MINOR[23:16] (RO)
 *
 * This read only field returns the minor version number for the module
 * specification.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_VERID_MINOR field. */
#define LPSPI_RD_VERID_MINOR(base) ((LPSPI_VERID_REG(base) & LPSPI_VERID_MINOR_MASK) >> LPSPI_VERID_MINOR_SHIFT)
#define LPSPI_BRD_VERID_MINOR(base) (LPSPI_RD_VERID_MINOR(base))
/*@}*/

/*!
 * @name Register LPSPI_VERID, field MAJOR[31:24] (RO)
 *
 * This read only field returns the major version number for the module
 * specification.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_VERID_MAJOR field. */
#define LPSPI_RD_VERID_MAJOR(base) ((LPSPI_VERID_REG(base) & LPSPI_VERID_MAJOR_MASK) >> LPSPI_VERID_MAJOR_SHIFT)
#define LPSPI_BRD_VERID_MAJOR(base) (LPSPI_RD_VERID_MAJOR(base))
/*@}*/

/*******************************************************************************
 * LPSPI_PARAM - Parameter Register
 ******************************************************************************/

/*!
 * @brief LPSPI_PARAM - Parameter Register (RO)
 *
 * Reset value: 0x00000202U
 *
 * .
 */
/*!
 * @name Constants and macros for entire LPSPI_PARAM register
 */
/*@{*/
#define LPSPI_RD_PARAM(base)     (LPSPI_PARAM_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPSPI_PARAM bitfields
 */

/*!
 * @name Register LPSPI_PARAM, field TXFIFO[7:0] (RO)
 *
 * The number of words in the transmit FIFO is 2**TXFIFO.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_PARAM_TXFIFO field. */
#define LPSPI_RD_PARAM_TXFIFO(base) ((LPSPI_PARAM_REG(base) & LPSPI_PARAM_TXFIFO_MASK) >> LPSPI_PARAM_TXFIFO_SHIFT)
#define LPSPI_BRD_PARAM_TXFIFO(base) (LPSPI_RD_PARAM_TXFIFO(base))
/*@}*/

/*!
 * @name Register LPSPI_PARAM, field RXFIFO[15:8] (RO)
 *
 * The number of words in the receive FIFO is 2**RXFIFO.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_PARAM_RXFIFO field. */
#define LPSPI_RD_PARAM_RXFIFO(base) ((LPSPI_PARAM_REG(base) & LPSPI_PARAM_RXFIFO_MASK) >> LPSPI_PARAM_RXFIFO_SHIFT)
#define LPSPI_BRD_PARAM_RXFIFO(base) (LPSPI_RD_PARAM_RXFIFO(base))
/*@}*/

/*******************************************************************************
 * LPSPI_CR - Control Register
 ******************************************************************************/

/*!
 * @brief LPSPI_CR - Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPSPI_CR register
 */
/*@{*/
#define LPSPI_RD_CR(base)        (LPSPI_CR_REG(base))
#define LPSPI_WR_CR(base, value) (LPSPI_CR_REG(base) = (value))
#define LPSPI_RMW_CR(base, mask, value) (LPSPI_WR_CR(base, (LPSPI_RD_CR(base) & ~(mask)) | (value)))
#define LPSPI_SET_CR(base, value) (LPSPI_WR_CR(base, LPSPI_RD_CR(base) |  (value)))
#define LPSPI_CLR_CR(base, value) (LPSPI_WR_CR(base, LPSPI_RD_CR(base) & ~(value)))
#define LPSPI_TOG_CR(base, value) (LPSPI_WR_CR(base, LPSPI_RD_CR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPSPI_CR bitfields
 */

/*!
 * @name Register LPSPI_CR, field MEN[0] (RW)
 *
 * Values:
 * - 0b0 - Module is disabled.
 * - 0b1 - Module is enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CR_MEN field. */
#define LPSPI_RD_CR_MEN(base) ((LPSPI_CR_REG(base) & LPSPI_CR_MEN_MASK) >> LPSPI_CR_MEN_SHIFT)
#define LPSPI_BRD_CR_MEN(base) (BITBAND_ACCESS32(&LPSPI_CR_REG(base), LPSPI_CR_MEN_SHIFT))

/*! @brief Set the MEN field to a new value. */
#define LPSPI_WR_CR_MEN(base, value) (LPSPI_RMW_CR(base, LPSPI_CR_MEN_MASK, LPSPI_CR_MEN(value)))
#define LPSPI_BWR_CR_MEN(base, value) (BITBAND_ACCESS32(&LPSPI_CR_REG(base), LPSPI_CR_MEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_CR, field RST[1] (RW)
 *
 * Reset all internal logic and registers, except the Control Register. Remains
 * set until cleared by software.
 *
 * Values:
 * - 0b0 - Master logic is not reset.
 * - 0b1 - Master logic is reset.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CR_RST field. */
#define LPSPI_RD_CR_RST(base) ((LPSPI_CR_REG(base) & LPSPI_CR_RST_MASK) >> LPSPI_CR_RST_SHIFT)
#define LPSPI_BRD_CR_RST(base) (BITBAND_ACCESS32(&LPSPI_CR_REG(base), LPSPI_CR_RST_SHIFT))

/*! @brief Set the RST field to a new value. */
#define LPSPI_WR_CR_RST(base, value) (LPSPI_RMW_CR(base, LPSPI_CR_RST_MASK, LPSPI_CR_RST(value)))
#define LPSPI_BWR_CR_RST(base, value) (BITBAND_ACCESS32(&LPSPI_CR_REG(base), LPSPI_CR_RST_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_CR, field DOZEN[2] (RW)
 *
 * Enables or disables Doze mode
 *
 * Values:
 * - 0b0 - Module is enabled in Doze mode.
 * - 0b1 - Module is disabled in Doze mode.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CR_DOZEN field. */
#define LPSPI_RD_CR_DOZEN(base) ((LPSPI_CR_REG(base) & LPSPI_CR_DOZEN_MASK) >> LPSPI_CR_DOZEN_SHIFT)
#define LPSPI_BRD_CR_DOZEN(base) (BITBAND_ACCESS32(&LPSPI_CR_REG(base), LPSPI_CR_DOZEN_SHIFT))

/*! @brief Set the DOZEN field to a new value. */
#define LPSPI_WR_CR_DOZEN(base, value) (LPSPI_RMW_CR(base, LPSPI_CR_DOZEN_MASK, LPSPI_CR_DOZEN(value)))
#define LPSPI_BWR_CR_DOZEN(base, value) (BITBAND_ACCESS32(&LPSPI_CR_REG(base), LPSPI_CR_DOZEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_CR, field DBGEN[3] (RW)
 *
 * Values:
 * - 0b0 - Module is disabled in debug mode.
 * - 0b1 - Module is enabled in debug mode.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CR_DBGEN field. */
#define LPSPI_RD_CR_DBGEN(base) ((LPSPI_CR_REG(base) & LPSPI_CR_DBGEN_MASK) >> LPSPI_CR_DBGEN_SHIFT)
#define LPSPI_BRD_CR_DBGEN(base) (BITBAND_ACCESS32(&LPSPI_CR_REG(base), LPSPI_CR_DBGEN_SHIFT))

/*! @brief Set the DBGEN field to a new value. */
#define LPSPI_WR_CR_DBGEN(base, value) (LPSPI_RMW_CR(base, LPSPI_CR_DBGEN_MASK, LPSPI_CR_DBGEN(value)))
#define LPSPI_BWR_CR_DBGEN(base, value) (BITBAND_ACCESS32(&LPSPI_CR_REG(base), LPSPI_CR_DBGEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_CR, field RTF[8] (WO)
 *
 * Values:
 * - 0b0 - No effect.
 * - 0b1 - Transmit FIFO is reset.
 */
/*@{*/
/*! @brief Set the RTF field to a new value. */
#define LPSPI_WR_CR_RTF(base, value) (LPSPI_RMW_CR(base, LPSPI_CR_RTF_MASK, LPSPI_CR_RTF(value)))
#define LPSPI_BWR_CR_RTF(base, value) (LPSPI_WR_CR_RTF(base, value))
/*@}*/

/*!
 * @name Register LPSPI_CR, field RRF[9] (WO)
 *
 * Values:
 * - 0b0 - No effect.
 * - 0b1 - Receive FIFO is reset.
 */
/*@{*/
/*! @brief Set the RRF field to a new value. */
#define LPSPI_WR_CR_RRF(base, value) (LPSPI_RMW_CR(base, LPSPI_CR_RRF_MASK, LPSPI_CR_RRF(value)))
#define LPSPI_BWR_CR_RRF(base, value) (LPSPI_WR_CR_RRF(base, value))
/*@}*/

