nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * LPSPI_SR - Status Register
 ******************************************************************************/

/*!
 * @brief LPSPI_SR - Status Register (RW)
 *
 * Reset value: 0x00000001U
 */
/*!
 * @name Constants and macros for entire LPSPI_SR register
 */
/*@{*/
#define LPSPI_RD_SR(base)        (LPSPI_SR_REG(base))
#define LPSPI_WR_SR(base, value) (LPSPI_SR_REG(base) = (value))
#define LPSPI_RMW_SR(base, mask, value) (LPSPI_WR_SR(base, (LPSPI_RD_SR(base) & ~(mask)) | (value)))
#define LPSPI_SET_SR(base, value) (LPSPI_WR_SR(base, LPSPI_RD_SR(base) |  (value)))
#define LPSPI_CLR_SR(base, value) (LPSPI_WR_SR(base, LPSPI_RD_SR(base) & ~(value)))
#define LPSPI_TOG_SR(base, value) (LPSPI_WR_SR(base, LPSPI_RD_SR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPSPI_SR bitfields
 */

/*!
 * @name Register LPSPI_SR, field TDF[0] (RO)
 *
 * The Transmit Data Flag is set whenever the number of words in the transmit
 * FIFO is equal or less than TXWATER.
 *
 * Values:
 * - 0b0 - Transmit data not requested.
 * - 0b1 - Transmit data is requested.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_SR_TDF field. */
#define LPSPI_RD_SR_TDF(base) ((LPSPI_SR_REG(base) & LPSPI_SR_TDF_MASK) >> LPSPI_SR_TDF_SHIFT)
#define LPSPI_BRD_SR_TDF(base) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_TDF_SHIFT))
/*@}*/

/*!
 * @name Register LPSPI_SR, field RDF[1] (RO)
 *
 * The Receive Data Flag is set whenever the number of words in the receive FIFO
 * is greater than RXWATER.
 *
 * Values:
 * - 0b0 - Receive Data is not ready.
 * - 0b1 - Receive data is ready.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_SR_RDF field. */
#define LPSPI_RD_SR_RDF(base) ((LPSPI_SR_REG(base) & LPSPI_SR_RDF_MASK) >> LPSPI_SR_RDF_SHIFT)
#define LPSPI_BRD_SR_RDF(base) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_RDF_SHIFT))
/*@}*/

/*!
 * @name Register LPSPI_SR, field WCF[8] (W1C)
 *
 * This flag will set when the last bit of a received word is sampled.
 *
 * Values:
 * - 0b0 - Transfer word not completed.
 * - 0b1 - Transfer word completed.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_SR_WCF field. */
#define LPSPI_RD_SR_WCF(base) ((LPSPI_SR_REG(base) & LPSPI_SR_WCF_MASK) >> LPSPI_SR_WCF_SHIFT)
#define LPSPI_BRD_SR_WCF(base) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_WCF_SHIFT))

/*! @brief Set the WCF field to a new value. */
#define LPSPI_WR_SR_WCF(base, value) (LPSPI_RMW_SR(base, (LPSPI_SR_WCF_MASK | LPSPI_SR_FCF_MASK | LPSPI_SR_TCF_MASK | LPSPI_SR_TEF_MASK | LPSPI_SR_REF_MASK | LPSPI_SR_DMF_MASK), LPSPI_SR_WCF(value)))
#define LPSPI_BWR_SR_WCF(base, value) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_WCF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_SR, field FCF[9] (W1C)
 *
 * This flag will set at the end of each frame transfer, when the PCS negates.
 *
 * Values:
 * - 0b0 - Frame transfer has not completed.
 * - 0b1 - Frame transfer has completed.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_SR_FCF field. */
#define LPSPI_RD_SR_FCF(base) ((LPSPI_SR_REG(base) & LPSPI_SR_FCF_MASK) >> LPSPI_SR_FCF_SHIFT)
#define LPSPI_BRD_SR_FCF(base) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_FCF_SHIFT))

/*! @brief Set the FCF field to a new value. */
#define LPSPI_WR_SR_FCF(base, value) (LPSPI_RMW_SR(base, (LPSPI_SR_FCF_MASK | LPSPI_SR_WCF_MASK | LPSPI_SR_TCF_MASK | LPSPI_SR_TEF_MASK | LPSPI_SR_REF_MASK | LPSPI_SR_DMF_MASK), LPSPI_SR_FCF(value)))
#define LPSPI_BWR_SR_FCF(base, value) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_FCF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_SR, field TCF[10] (W1C)
 *
 * This flag will set in master mode when the LPSPI returns to idle state with
 * the transmit FIFO empty.
 *
 * Values:
 * - 0b0 - All transfers have not completed.
 * - 0b1 - All transfers have completed.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_SR_TCF field. */
#define LPSPI_RD_SR_TCF(base) ((LPSPI_SR_REG(base) & LPSPI_SR_TCF_MASK) >> LPSPI_SR_TCF_SHIFT)
#define LPSPI_BRD_SR_TCF(base) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_TCF_SHIFT))

/*! @brief Set the TCF field to a new value. */
#define LPSPI_WR_SR_TCF(base, value) (LPSPI_RMW_SR(base, (LPSPI_SR_TCF_MASK | LPSPI_SR_WCF_MASK | LPSPI_SR_FCF_MASK | LPSPI_SR_TEF_MASK | LPSPI_SR_REF_MASK | LPSPI_SR_DMF_MASK), LPSPI_SR_TCF(value)))
#define LPSPI_BWR_SR_TCF(base, value) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_TCF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_SR, field TEF[11] (W1C)
 *
 * This flag will set when the Transmit FIFO underruns.
 *
 * Values:
 * - 0b0 - Transmit FIFO underrun has not occurred.
 * - 0b1 - Transmit FIFO underrun has occurred
 */
/*@{*/
/*! @brief Read current value of the LPSPI_SR_TEF field. */
#define LPSPI_RD_SR_TEF(base) ((LPSPI_SR_REG(base) & LPSPI_SR_TEF_MASK) >> LPSPI_SR_TEF_SHIFT)
#define LPSPI_BRD_SR_TEF(base) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_TEF_SHIFT))

/*! @brief Set the TEF field to a new value. */
#define LPSPI_WR_SR_TEF(base, value) (LPSPI_RMW_SR(base, (LPSPI_SR_TEF_MASK | LPSPI_SR_WCF_MASK | LPSPI_SR_FCF_MASK | LPSPI_SR_TCF_MASK | LPSPI_SR_REF_MASK | LPSPI_SR_DMF_MASK), LPSPI_SR_TEF(value)))
#define LPSPI_BWR_SR_TEF(base, value) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_TEF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_SR, field REF[12] (W1C)
 *
 * This flag will set when the Receiver FIFO overflows.
 *
 * Values:
 * - 0b0 - Receive FIFO has not overflowed.
 * - 0b1 - Receive FIFO has overflowed.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_SR_REF field. */
#define LPSPI_RD_SR_REF(base) ((LPSPI_SR_REG(base) & LPSPI_SR_REF_MASK) >> LPSPI_SR_REF_SHIFT)
#define LPSPI_BRD_SR_REF(base) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_REF_SHIFT))

/*! @brief Set the REF field to a new value. */
#define LPSPI_WR_SR_REF(base, value) (LPSPI_RMW_SR(base, (LPSPI_SR_REF_MASK | LPSPI_SR_WCF_MASK | LPSPI_SR_FCF_MASK | LPSPI_SR_TCF_MASK | LPSPI_SR_TEF_MASK | LPSPI_SR_DMF_MASK), LPSPI_SR_REF(value)))
#define LPSPI_BWR_SR_REF(base, value) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_REF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_SR, field DMF[13] (W1C)
 *
 * Indicates that the received data has matched the MATCH0 and/or MATCH1 fields
 * as configured by MATCFG.
 *
 * Values:
 * - 0b0 - Have not received matching data.
 * - 0b1 - Have received matching data.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_SR_DMF field. */
#define LPSPI_RD_SR_DMF(base) ((LPSPI_SR_REG(base) & LPSPI_SR_DMF_MASK) >> LPSPI_SR_DMF_SHIFT)
#define LPSPI_BRD_SR_DMF(base) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_DMF_SHIFT))

/*! @brief Set the DMF field to a new value. */
#define LPSPI_WR_SR_DMF(base, value) (LPSPI_RMW_SR(base, (LPSPI_SR_DMF_MASK | LPSPI_SR_WCF_MASK | LPSPI_SR_FCF_MASK | LPSPI_SR_TCF_MASK | LPSPI_SR_TEF_MASK | LPSPI_SR_REF_MASK), LPSPI_SR_DMF(value)))
#define LPSPI_BWR_SR_DMF(base, value) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_DMF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_SR, field MBF[24] (RO)
 *
 * Values:
 * - 0b0 - LPSPI is idle.
 * - 0b1 - LPSPI is busy.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_SR_MBF field. */
#define LPSPI_RD_SR_MBF(base) ((LPSPI_SR_REG(base) & LPSPI_SR_MBF_MASK) >> LPSPI_SR_MBF_SHIFT)
#define LPSPI_BRD_SR_MBF(base) (BITBAND_ACCESS32(&LPSPI_SR_REG(base), LPSPI_SR_MBF_SHIFT))
/*@}*/

