nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * LPSPI_IER - Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief LPSPI_IER - Interrupt Enable Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPSPI_IER register
 */
/*@{*/
#define LPSPI_RD_IER(base)       (LPSPI_IER_REG(base))
#define LPSPI_WR_IER(base, value) (LPSPI_IER_REG(base) = (value))
#define LPSPI_RMW_IER(base, mask, value) (LPSPI_WR_IER(base, (LPSPI_RD_IER(base) & ~(mask)) | (value)))
#define LPSPI_SET_IER(base, value) (LPSPI_WR_IER(base, LPSPI_RD_IER(base) |  (value)))
#define LPSPI_CLR_IER(base, value) (LPSPI_WR_IER(base, LPSPI_RD_IER(base) & ~(value)))
#define LPSPI_TOG_IER(base, value) (LPSPI_WR_IER(base, LPSPI_RD_IER(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPSPI_IER bitfields
 */

/*!
 * @name Register LPSPI_IER, field TDIE[0] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the LPSPI_IER_TDIE field. */
#define LPSPI_RD_IER_TDIE(base) ((LPSPI_IER_REG(base) & LPSPI_IER_TDIE_MASK) >> LPSPI_IER_TDIE_SHIFT)
#define LPSPI_BRD_IER_TDIE(base) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_TDIE_SHIFT))

/*! @brief Set the TDIE field to a new value. */
#define LPSPI_WR_IER_TDIE(base, value) (LPSPI_RMW_IER(base, LPSPI_IER_TDIE_MASK, LPSPI_IER_TDIE(value)))
#define LPSPI_BWR_IER_TDIE(base, value) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_TDIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_IER, field RDIE[1] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_IER_RDIE field. */
#define LPSPI_RD_IER_RDIE(base) ((LPSPI_IER_REG(base) & LPSPI_IER_RDIE_MASK) >> LPSPI_IER_RDIE_SHIFT)
#define LPSPI_BRD_IER_RDIE(base) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_RDIE_SHIFT))

/*! @brief Set the RDIE field to a new value. */
#define LPSPI_WR_IER_RDIE(base, value) (LPSPI_RMW_IER(base, LPSPI_IER_RDIE_MASK, LPSPI_IER_RDIE(value)))
#define LPSPI_BWR_IER_RDIE(base, value) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_RDIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_IER, field WCIE[8] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_IER_WCIE field. */
#define LPSPI_RD_IER_WCIE(base) ((LPSPI_IER_REG(base) & LPSPI_IER_WCIE_MASK) >> LPSPI_IER_WCIE_SHIFT)
#define LPSPI_BRD_IER_WCIE(base) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_WCIE_SHIFT))

/*! @brief Set the WCIE field to a new value. */
#define LPSPI_WR_IER_WCIE(base, value) (LPSPI_RMW_IER(base, LPSPI_IER_WCIE_MASK, LPSPI_IER_WCIE(value)))
#define LPSPI_BWR_IER_WCIE(base, value) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_WCIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_IER, field FCIE[9] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_IER_FCIE field. */
#define LPSPI_RD_IER_FCIE(base) ((LPSPI_IER_REG(base) & LPSPI_IER_FCIE_MASK) >> LPSPI_IER_FCIE_SHIFT)
#define LPSPI_BRD_IER_FCIE(base) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_FCIE_SHIFT))

/*! @brief Set the FCIE field to a new value. */
#define LPSPI_WR_IER_FCIE(base, value) (LPSPI_RMW_IER(base, LPSPI_IER_FCIE_MASK, LPSPI_IER_FCIE(value)))
#define LPSPI_BWR_IER_FCIE(base, value) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_FCIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_IER, field TCIE[10] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_IER_TCIE field. */
#define LPSPI_RD_IER_TCIE(base) ((LPSPI_IER_REG(base) & LPSPI_IER_TCIE_MASK) >> LPSPI_IER_TCIE_SHIFT)
#define LPSPI_BRD_IER_TCIE(base) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_TCIE_SHIFT))

/*! @brief Set the TCIE field to a new value. */
#define LPSPI_WR_IER_TCIE(base, value) (LPSPI_RMW_IER(base, LPSPI_IER_TCIE_MASK, LPSPI_IER_TCIE(value)))
#define LPSPI_BWR_IER_TCIE(base, value) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_TCIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_IER, field TEIE[11] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_IER_TEIE field. */
#define LPSPI_RD_IER_TEIE(base) ((LPSPI_IER_REG(base) & LPSPI_IER_TEIE_MASK) >> LPSPI_IER_TEIE_SHIFT)
#define LPSPI_BRD_IER_TEIE(base) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_TEIE_SHIFT))

/*! @brief Set the TEIE field to a new value. */
#define LPSPI_WR_IER_TEIE(base, value) (LPSPI_RMW_IER(base, LPSPI_IER_TEIE_MASK, LPSPI_IER_TEIE(value)))
#define LPSPI_BWR_IER_TEIE(base, value) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_TEIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_IER, field REIE[12] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_IER_REIE field. */
#define LPSPI_RD_IER_REIE(base) ((LPSPI_IER_REG(base) & LPSPI_IER_REIE_MASK) >> LPSPI_IER_REIE_SHIFT)
#define LPSPI_BRD_IER_REIE(base) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_REIE_SHIFT))

/*! @brief Set the REIE field to a new value. */
#define LPSPI_WR_IER_REIE(base, value) (LPSPI_RMW_IER(base, LPSPI_IER_REIE_MASK, LPSPI_IER_REIE(value)))
#define LPSPI_BWR_IER_REIE(base, value) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_REIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_IER, field DMIE[13] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_IER_DMIE field. */
#define LPSPI_RD_IER_DMIE(base) ((LPSPI_IER_REG(base) & LPSPI_IER_DMIE_MASK) >> LPSPI_IER_DMIE_SHIFT)
#define LPSPI_BRD_IER_DMIE(base) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_DMIE_SHIFT))

/*! @brief Set the DMIE field to a new value. */
#define LPSPI_WR_IER_DMIE(base, value) (LPSPI_RMW_IER(base, LPSPI_IER_DMIE_MASK, LPSPI_IER_DMIE(value)))
#define LPSPI_BWR_IER_DMIE(base, value) (BITBAND_ACCESS32(&LPSPI_IER_REG(base), LPSPI_IER_DMIE_SHIFT) = (value))
/*@}*/

