nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * LPSPI_CFGR1 - Configuration Register 1
 ******************************************************************************/

/*!
 * @brief LPSPI_CFGR1 - Configuration Register 1 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CFGR1 should only be written when the LPSPI is disabled.
 */
/*!
 * @name Constants and macros for entire LPSPI_CFGR1 register
 */
/*@{*/
#define LPSPI_RD_CFGR1(base)     (LPSPI_CFGR1_REG(base))
#define LPSPI_WR_CFGR1(base, value) (LPSPI_CFGR1_REG(base) = (value))
#define LPSPI_RMW_CFGR1(base, mask, value) (LPSPI_WR_CFGR1(base, (LPSPI_RD_CFGR1(base) & ~(mask)) | (value)))
#define LPSPI_SET_CFGR1(base, value) (LPSPI_WR_CFGR1(base, LPSPI_RD_CFGR1(base) |  (value)))
#define LPSPI_CLR_CFGR1(base, value) (LPSPI_WR_CFGR1(base, LPSPI_RD_CFGR1(base) & ~(value)))
#define LPSPI_TOG_CFGR1(base, value) (LPSPI_WR_CFGR1(base, LPSPI_RD_CFGR1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPSPI_CFGR1 bitfields
 */

/*!
 * @name Register LPSPI_CFGR1, field MASTER[0] (RW)
 *
 * Configures the LPSPI in master or slave mode. This bit directly controls the
 * direction of the LPSPI_SCK and LPCPI_PCS pins.
 *
 * Values:
 * - 0b0 - Slave mode.
 * - 0b1 - Master mode.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR1_MASTER field. */
#define LPSPI_RD_CFGR1_MASTER(base) ((LPSPI_CFGR1_REG(base) & LPSPI_CFGR1_MASTER_MASK) >> LPSPI_CFGR1_MASTER_SHIFT)
#define LPSPI_BRD_CFGR1_MASTER(base) (BITBAND_ACCESS32(&LPSPI_CFGR1_REG(base), LPSPI_CFGR1_MASTER_SHIFT))

/*! @brief Set the MASTER field to a new value. */
#define LPSPI_WR_CFGR1_MASTER(base, value) (LPSPI_RMW_CFGR1(base, LPSPI_CFGR1_MASTER_MASK, LPSPI_CFGR1_MASTER(value)))
#define LPSPI_BWR_CFGR1_MASTER(base, value) (BITBAND_ACCESS32(&LPSPI_CFGR1_REG(base), LPSPI_CFGR1_MASTER_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_CFGR1, field SAMPLE[1] (RW)
 *
 * When set, the LPSPI master will sample the input data on a delayed LPSPI_SCK
 * edge. This improves the setup time when sampling data. The input data setup
 * time in master mode with delayed LPSPI_SCK edge is equal to the input data setup
 * time in slave mode. This bit is ignored in slave mode.
 *
 * Values:
 * - 0b0 - Input data sampled on SCK edge.
 * - 0b1 - Input data sampled on delayed SCK edge.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR1_SAMPLE field. */
#define LPSPI_RD_CFGR1_SAMPLE(base) ((LPSPI_CFGR1_REG(base) & LPSPI_CFGR1_SAMPLE_MASK) >> LPSPI_CFGR1_SAMPLE_SHIFT)
#define LPSPI_BRD_CFGR1_SAMPLE(base) (BITBAND_ACCESS32(&LPSPI_CFGR1_REG(base), LPSPI_CFGR1_SAMPLE_SHIFT))

/*! @brief Set the SAMPLE field to a new value. */
#define LPSPI_WR_CFGR1_SAMPLE(base, value) (LPSPI_RMW_CFGR1(base, LPSPI_CFGR1_SAMPLE_MASK, LPSPI_CFGR1_SAMPLE(value)))
#define LPSPI_BWR_CFGR1_SAMPLE(base, value) (BITBAND_ACCESS32(&LPSPI_CFGR1_REG(base), LPSPI_CFGR1_SAMPLE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_CFGR1, field AUTOPCS[2] (RW)
 *
 * The LPSPI slave normally requires the PCS to negate between frames for
 * correct operation. Setting this bit will cause the LPSPI to generate an internal PCS
 * signal at the end of each transfer word when CPHA=1. When this bit is set,
 * the SCK must remain idle for at least 4 LPSPI functional clock cycles (divided
 * by PRESCALE configuration) between each word to ensure correct operation. This
 * bit is ignored in master mode.
 *
 * Values:
 * - 0b0 - Automatic PCS generation disabled.
 * - 0b1 - Automatic PCS generation enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR1_AUTOPCS field. */
#define LPSPI_RD_CFGR1_AUTOPCS(base) ((LPSPI_CFGR1_REG(base) & LPSPI_CFGR1_AUTOPCS_MASK) >> LPSPI_CFGR1_AUTOPCS_SHIFT)
#define LPSPI_BRD_CFGR1_AUTOPCS(base) (BITBAND_ACCESS32(&LPSPI_CFGR1_REG(base), LPSPI_CFGR1_AUTOPCS_SHIFT))

/*! @brief Set the AUTOPCS field to a new value. */
#define LPSPI_WR_CFGR1_AUTOPCS(base, value) (LPSPI_RMW_CFGR1(base, LPSPI_CFGR1_AUTOPCS_MASK, LPSPI_CFGR1_AUTOPCS(value)))
#define LPSPI_BWR_CFGR1_AUTOPCS(base, value) (BITBAND_ACCESS32(&LPSPI_CFGR1_REG(base), LPSPI_CFGR1_AUTOPCS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_CFGR1, field NOSTALL[3] (RW)
 *
 * In master mode, the LPSPI will stall transfers when the transmit FIFO is
 * empty or receive FIFO is full ensuring that no transmit FIFO underrun or receive
 * FIFO overrun can occur. Setting this bit will disable this functionality.
 *
 * Values:
 * - 0b0 - Transfers will stall when transmit FIFO is empty or receive FIFO is
 *     full.
 * - 0b1 - Transfers will not stall, allowing transmit FIFO underrun or receive
 *     FIFO overrun to occur.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR1_NOSTALL field. */
#define LPSPI_RD_CFGR1_NOSTALL(base) ((LPSPI_CFGR1_REG(base) & LPSPI_CFGR1_NOSTALL_MASK) >> LPSPI_CFGR1_NOSTALL_SHIFT)
#define LPSPI_BRD_CFGR1_NOSTALL(base) (BITBAND_ACCESS32(&LPSPI_CFGR1_REG(base), LPSPI_CFGR1_NOSTALL_SHIFT))

/*! @brief Set the NOSTALL field to a new value. */
#define LPSPI_WR_CFGR1_NOSTALL(base, value) (LPSPI_RMW_CFGR1(base, LPSPI_CFGR1_NOSTALL_MASK, LPSPI_CFGR1_NOSTALL(value)))
#define LPSPI_BWR_CFGR1_NOSTALL(base, value) (BITBAND_ACCESS32(&LPSPI_CFGR1_REG(base), LPSPI_CFGR1_NOSTALL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_CFGR1, field PCSPOL[11:8] (RW)
 *
 * Configures the polarity of each Peripheral Chip Select pin.
 *
 * Values:
 * - 0b0000 - The PCSx is active low.
 * - 0b0001 - The PCSx is active high.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR1_PCSPOL field. */
#define LPSPI_RD_CFGR1_PCSPOL(base) ((LPSPI_CFGR1_REG(base) & LPSPI_CFGR1_PCSPOL_MASK) >> LPSPI_CFGR1_PCSPOL_SHIFT)
#define LPSPI_BRD_CFGR1_PCSPOL(base) (LPSPI_RD_CFGR1_PCSPOL(base))

/*! @brief Set the PCSPOL field to a new value. */
#define LPSPI_WR_CFGR1_PCSPOL(base, value) (LPSPI_RMW_CFGR1(base, LPSPI_CFGR1_PCSPOL_MASK, LPSPI_CFGR1_PCSPOL(value)))
#define LPSPI_BWR_CFGR1_PCSPOL(base, value) (LPSPI_WR_CFGR1_PCSPOL(base, value))
/*@}*/

/*!
 * @name Register LPSPI_CFGR1, field MATCFG[18:16] (RW)
 *
 * Configures the condition that will cause the DMF to set.
 *
 * Values:
 * - 0b000 - Match disabled.
 * - 0b001 - Reserved
 * - 0b010 - Match enabled (1st data word equals MATCH0 OR MATCH1).
 * - 0b011 - Match enabled (any data word equals MATCH0 OR MATCH1).
 * - 0b100 - Match enabled (1st data word equals MATCH0 AND 2nd data word equals
 *     MATCH1).
 * - 0b101 - Match enabled (any data word equals MATCH0 AND next data word
 *     equals MATCH1)
 * - 0b110 - Match enabled (1st data word AND MATCH1 equals MATCH0 AND MATCH1)
 * - 0b111 - Match enabled (any data word AND MATCH1 equals MATCH0 AND MATCH1).
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR1_MATCFG field. */
#define LPSPI_RD_CFGR1_MATCFG(base) ((LPSPI_CFGR1_REG(base) & LPSPI_CFGR1_MATCFG_MASK) >> LPSPI_CFGR1_MATCFG_SHIFT)
#define LPSPI_BRD_CFGR1_MATCFG(base) (LPSPI_RD_CFGR1_MATCFG(base))

/*! @brief Set the MATCFG field to a new value. */
#define LPSPI_WR_CFGR1_MATCFG(base, value) (LPSPI_RMW_CFGR1(base, LPSPI_CFGR1_MATCFG_MASK, LPSPI_CFGR1_MATCFG(value)))
#define LPSPI_BWR_CFGR1_MATCFG(base, value) (LPSPI_WR_CFGR1_MATCFG(base, value))
/*@}*/

/*!
 * @name Register LPSPI_CFGR1, field PINCFG[25:24] (RW)
 *
 * Configures which pins are used for input and output data during single bit
 * transfers.
 *
 * Values:
 * - 0b00 - SIN is used for input data and SOUT for output data.
 * - 0b01 - SOUT is used for both input and output data.
 * - 0b10 - SDI is used for both input and output data.
 * - 0b11 - SOUT is used for input data and SIN for output data.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR1_PINCFG field. */
#define LPSPI_RD_CFGR1_PINCFG(base) ((LPSPI_CFGR1_REG(base) & LPSPI_CFGR1_PINCFG_MASK) >> LPSPI_CFGR1_PINCFG_SHIFT)
#define LPSPI_BRD_CFGR1_PINCFG(base) (LPSPI_RD_CFGR1_PINCFG(base))

