nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * LPSPI_FCR - FIFO Control Register
 ******************************************************************************/

/*!
 * @brief LPSPI_FCR - FIFO Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPSPI_FCR register
 */
/*@{*/
#define LPSPI_RD_FCR(base)       (LPSPI_FCR_REG(base))
#define LPSPI_WR_FCR(base, value) (LPSPI_FCR_REG(base) = (value))
#define LPSPI_RMW_FCR(base, mask, value) (LPSPI_WR_FCR(base, (LPSPI_RD_FCR(base) & ~(mask)) | (value)))
#define LPSPI_SET_FCR(base, value) (LPSPI_WR_FCR(base, LPSPI_RD_FCR(base) |  (value)))
#define LPSPI_CLR_FCR(base, value) (LPSPI_WR_FCR(base, LPSPI_RD_FCR(base) & ~(value)))
#define LPSPI_TOG_FCR(base, value) (LPSPI_WR_FCR(base, LPSPI_RD_FCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPSPI_FCR bitfields
 */

/*!
 * @name Register LPSPI_FCR, field TXWATER[7:0] (RW)
 *
 * The Transmit Data Flag is set whenever the number of words in the transmit
 * FIFO is equal or less than TXWATER. Writing a value equal or greater than the
 * FIFO size will be truncated.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_FCR_TXWATER field. */
#define LPSPI_RD_FCR_TXWATER(base) ((LPSPI_FCR_REG(base) & LPSPI_FCR_TXWATER_MASK) >> LPSPI_FCR_TXWATER_SHIFT)
#define LPSPI_BRD_FCR_TXWATER(base) (LPSPI_RD_FCR_TXWATER(base))

/*! @brief Set the TXWATER field to a new value. */
#define LPSPI_WR_FCR_TXWATER(base, value) (LPSPI_RMW_FCR(base, LPSPI_FCR_TXWATER_MASK, LPSPI_FCR_TXWATER(value)))
#define LPSPI_BWR_FCR_TXWATER(base, value) (LPSPI_WR_FCR_TXWATER(base, value))
/*@}*/

/*!
 * @name Register LPSPI_FCR, field RXWATER[23:16] (RW)
 *
 * The Receive Data Flag is set whenever the number of words in the receive FIFO
 * is greater than RXWATER. Writing a value equal or greater than the FIFO size
 * will be truncated.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_FCR_RXWATER field. */
#define LPSPI_RD_FCR_RXWATER(base) ((LPSPI_FCR_REG(base) & LPSPI_FCR_RXWATER_MASK) >> LPSPI_FCR_RXWATER_SHIFT)
#define LPSPI_BRD_FCR_RXWATER(base) (LPSPI_RD_FCR_RXWATER(base))

/*! @brief Set the RXWATER field to a new value. */
#define LPSPI_WR_FCR_RXWATER(base, value) (LPSPI_RMW_FCR(base, LPSPI_FCR_RXWATER_MASK, LPSPI_FCR_RXWATER(value)))
#define LPSPI_BWR_FCR_RXWATER(base, value) (LPSPI_WR_FCR_RXWATER(base, value))
/*@}*/

/*******************************************************************************
 * LPSPI_FSR - FIFO Status Register
 ******************************************************************************/

/*!
 * @brief LPSPI_FSR - FIFO Status Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPSPI_FSR register
 */
/*@{*/
#define LPSPI_RD_FSR(base)       (LPSPI_FSR_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPSPI_FSR bitfields
 */

/*!
 * @name Register LPSPI_FSR, field TXCOUNT[7:0] (RO)
 *
 * Returns the number of words in the transmit FIFO.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_FSR_TXCOUNT field. */
#define LPSPI_RD_FSR_TXCOUNT(base) ((LPSPI_FSR_REG(base) & LPSPI_FSR_TXCOUNT_MASK) >> LPSPI_FSR_TXCOUNT_SHIFT)
#define LPSPI_BRD_FSR_TXCOUNT(base) (LPSPI_RD_FSR_TXCOUNT(base))
/*@}*/

/*!
 * @name Register LPSPI_FSR, field RXCOUNT[23:16] (RO)
 *
 * Returns the number of words in the receive FIFO.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_FSR_RXCOUNT field. */
#define LPSPI_RD_FSR_RXCOUNT(base) ((LPSPI_FSR_REG(base) & LPSPI_FSR_RXCOUNT_MASK) >> LPSPI_FSR_RXCOUNT_SHIFT)
#define LPSPI_BRD_FSR_RXCOUNT(base) (LPSPI_RD_FSR_RXCOUNT(base))
/*@}*/

/*******************************************************************************
 * LPSPI_TCR - Transmit Command Register
 ******************************************************************************/

/*!
 * @brief LPSPI_TCR - Transmit Command Register (RW)
 *
 * Reset value: 0x0000001FU
 *
 * Writes to either the Transmit Command Register or Transmit Data Register will
 * push the data into the transmit FIFO in the order they are written. Command
 * Register writes will be tagged and cause the command register to update once
 * that entry reaches the top of the FIFO. This allows changes to the command word
 * and the transmit data itself to be interleaved. Changing the command word will
 * cause all subsequent SPI bus transfer to be performed using the new command
 * word. In master mode, writing a new command word does not initiate a new
 * transfer, unless TXMSK is set. Transfers are initiated by transmit data in the
 * transmit FIFO, or a new command word with TXMSK set. Hardware will clear TXMSK when
 * the LPSPI_PCS negates. In master mode if the command word is changed before
 * an existing frame has completed, then the existing frame will terminate and the
 * command word will then update. The command word can be changed during a
 * continuous transfer, provided CONTC of the new command word is set and the command
 * word is written on a frame size boundary. In slave mode, the command word
 * should be changed only when the LPSPI is idle and there is no SPI bus transfer.
 * Reading the Transmit Command Register will return the current state of the
 * command register.
 */
/*!
 * @name Constants and macros for entire LPSPI_TCR register
 */
/*@{*/
#define LPSPI_RD_TCR(base)       (LPSPI_TCR_REG(base))
#define LPSPI_WR_TCR(base, value) (LPSPI_TCR_REG(base) = (value))
#define LPSPI_RMW_TCR(base, mask, value) (LPSPI_WR_TCR(base, (LPSPI_RD_TCR(base) & ~(mask)) | (value)))
#define LPSPI_SET_TCR(base, value) (LPSPI_WR_TCR(base, LPSPI_RD_TCR(base) |  (value)))
#define LPSPI_CLR_TCR(base, value) (LPSPI_WR_TCR(base, LPSPI_RD_TCR(base) & ~(value)))
#define LPSPI_TOG_TCR(base, value) (LPSPI_WR_TCR(base, LPSPI_RD_TCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPSPI_TCR bitfields
 */

/*!
 * @name Register LPSPI_TCR, field FRAMESZ[11:0] (RW)
 *
 * Configures the frame size in number of bits equal to (FRAMESZ + 1). The
 * minimum frame size is 8 bits. If the frame size is larger than 32 bits, data will
 * be loaded from the transmit FIFO and stored to the receive FIFO every 32 bits.
 * If the size of the transfer word is not divisible by 32, then the last load of
 * the transmit FIFO and store of the receive FIFO will contain the remainder
 * bits (e.g.: a 72-bit transfer will load/store 32-bits from the FIFO and then
 * another 32-bits from the FIFO and then the final 8-bits from the FIFO).
 */
/*@{*/
/*! @brief Read current value of the LPSPI_TCR_FRAMESZ field. */
#define LPSPI_RD_TCR_FRAMESZ(base) ((LPSPI_TCR_REG(base) & LPSPI_TCR_FRAMESZ_MASK) >> LPSPI_TCR_FRAMESZ_SHIFT)
#define LPSPI_BRD_TCR_FRAMESZ(base) (LPSPI_RD_TCR_FRAMESZ(base))

