nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the FRAMESZ field to a new value. */
#define LPSPI_WR_TCR_FRAMESZ(base, value) (LPSPI_RMW_TCR(base, LPSPI_TCR_FRAMESZ_MASK, LPSPI_TCR_FRAMESZ(value)))
#define LPSPI_BWR_TCR_FRAMESZ(base, value) (LPSPI_WR_TCR_FRAMESZ(base, value))
/*@}*/

/*!
 * @name Register LPSPI_TCR, field WIDTH[17:16] (RW)
 *
 * Either RXMSK or TXMSK must be set for 2-bit or 4-bit transfers.
 *
 * Values:
 * - 0b00 - Single bit transfer.
 * - 0b01 - Two bit transfer.
 * - 0b10 - Four bit transfer.
 * - 0b11 - Reserved.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_TCR_WIDTH field. */
#define LPSPI_RD_TCR_WIDTH(base) ((LPSPI_TCR_REG(base) & LPSPI_TCR_WIDTH_MASK) >> LPSPI_TCR_WIDTH_SHIFT)
#define LPSPI_BRD_TCR_WIDTH(base) (LPSPI_RD_TCR_WIDTH(base))

/*! @brief Set the WIDTH field to a new value. */
#define LPSPI_WR_TCR_WIDTH(base, value) (LPSPI_RMW_TCR(base, LPSPI_TCR_WIDTH_MASK, LPSPI_TCR_WIDTH(value)))
#define LPSPI_BWR_TCR_WIDTH(base, value) (LPSPI_WR_TCR_WIDTH(base, value))
/*@}*/

/*!
 * @name Register LPSPI_TCR, field TXMSK[18] (RW)
 *
 * When set, transmit data is masked (no data is loaded from transmit FIFO and
 * output pin is tristated). In master mode, this bit will initiate a new transfer
 * which cannot be aborted by another command word and the bit will be cleared
 * by hardware at the end of the transfer.
 *
 * Values:
 * - 0b0 - Normal transfer.
 * - 0b1 - Mask transmit data.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_TCR_TXMSK field. */
#define LPSPI_RD_TCR_TXMSK(base) ((LPSPI_TCR_REG(base) & LPSPI_TCR_TXMSK_MASK) >> LPSPI_TCR_TXMSK_SHIFT)
#define LPSPI_BRD_TCR_TXMSK(base) (BITBAND_ACCESS32(&LPSPI_TCR_REG(base), LPSPI_TCR_TXMSK_SHIFT))

/*! @brief Set the TXMSK field to a new value. */
#define LPSPI_WR_TCR_TXMSK(base, value) (LPSPI_RMW_TCR(base, LPSPI_TCR_TXMSK_MASK, LPSPI_TCR_TXMSK(value)))
#define LPSPI_BWR_TCR_TXMSK(base, value) (BITBAND_ACCESS32(&LPSPI_TCR_REG(base), LPSPI_TCR_TXMSK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_TCR, field RXMSK[19] (RW)
 *
 * When set, receive data is masked (receive data is not stored in receive FIFO).
 *
 * Values:
 * - 0b0 - Normal transfer.
 * - 0b1 - Receive data is masked.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_TCR_RXMSK field. */
#define LPSPI_RD_TCR_RXMSK(base) ((LPSPI_TCR_REG(base) & LPSPI_TCR_RXMSK_MASK) >> LPSPI_TCR_RXMSK_SHIFT)
#define LPSPI_BRD_TCR_RXMSK(base) (BITBAND_ACCESS32(&LPSPI_TCR_REG(base), LPSPI_TCR_RXMSK_SHIFT))

/*! @brief Set the RXMSK field to a new value. */
#define LPSPI_WR_TCR_RXMSK(base, value) (LPSPI_RMW_TCR(base, LPSPI_TCR_RXMSK_MASK, LPSPI_TCR_RXMSK(value)))
#define LPSPI_BWR_TCR_RXMSK(base, value) (BITBAND_ACCESS32(&LPSPI_TCR_REG(base), LPSPI_TCR_RXMSK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_TCR, field CONTC[20] (RW)
 *
 * In master mode, this bit allows the command word to be changed within a
 * continuous transfer. The initial command word must enable continuous transfer
 * (CONT=1), the continuing command must set this bit (CONTC=1) and the continuing
 * command word must be loaded on a frame size boundary. For example, if the
 * continuous transfer has a frame size of 64-bits, then a continuing command word must
 * be loaded on a 64-bit boundary.
 *
 * Values:
 * - 0b0 - Command word for start of new transfer.
 * - 0b1 - Command word for continuing transfer.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_TCR_CONTC field. */
#define LPSPI_RD_TCR_CONTC(base) ((LPSPI_TCR_REG(base) & LPSPI_TCR_CONTC_MASK) >> LPSPI_TCR_CONTC_SHIFT)
#define LPSPI_BRD_TCR_CONTC(base) (BITBAND_ACCESS32(&LPSPI_TCR_REG(base), LPSPI_TCR_CONTC_SHIFT))

/*! @brief Set the CONTC field to a new value. */
#define LPSPI_WR_TCR_CONTC(base, value) (LPSPI_RMW_TCR(base, LPSPI_TCR_CONTC_MASK, LPSPI_TCR_CONTC(value)))
#define LPSPI_BWR_TCR_CONTC(base, value) (BITBAND_ACCESS32(&LPSPI_TCR_REG(base), LPSPI_TCR_CONTC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_TCR, field CONT[21] (RW)
 *
 * In master mode, continuous transfer will keep the PCS asserted at the end of
 * the frame size, until a command word is received that starts a new frame. In
 * slave mode, when continuous transfer is enabled the LPSPI will only transmit
 * the first FRAMESZ bits, after which it will transmit received data assuming a
 * 32-bit shift register.
 *
 * Values:
 * - 0b0 - Continuous transfer disabled.
 * - 0b1 - Continuous transfer enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_TCR_CONT field. */
#define LPSPI_RD_TCR_CONT(base) ((LPSPI_TCR_REG(base) & LPSPI_TCR_CONT_MASK) >> LPSPI_TCR_CONT_SHIFT)
#define LPSPI_BRD_TCR_CONT(base) (BITBAND_ACCESS32(&LPSPI_TCR_REG(base), LPSPI_TCR_CONT_SHIFT))

/*! @brief Set the CONT field to a new value. */
#define LPSPI_WR_TCR_CONT(base, value) (LPSPI_RMW_TCR(base, LPSPI_TCR_CONT_MASK, LPSPI_TCR_CONT(value)))
#define LPSPI_BWR_TCR_CONT(base, value) (BITBAND_ACCESS32(&LPSPI_TCR_REG(base), LPSPI_TCR_CONT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_TCR, field BYSW[22] (RW)
 *
 * Byte swap will swap the contents of [31:24] with [7:0] and [23:16] with
 * [15:8] for each transmit data word read from the FIFO and each received data word
 * stored to the FIFO (or compared with match registers).
 *
 * Values:
 * - 0b0 - Byte swap disabled.
 * - 0b1 - Byte swap enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_TCR_BYSW field. */
#define LPSPI_RD_TCR_BYSW(base) ((LPSPI_TCR_REG(base) & LPSPI_TCR_BYSW_MASK) >> LPSPI_TCR_BYSW_SHIFT)
#define LPSPI_BRD_TCR_BYSW(base) (BITBAND_ACCESS32(&LPSPI_TCR_REG(base), LPSPI_TCR_BYSW_SHIFT))

/*! @brief Set the BYSW field to a new value. */
#define LPSPI_WR_TCR_BYSW(base, value) (LPSPI_RMW_TCR(base, LPSPI_TCR_BYSW_MASK, LPSPI_TCR_BYSW(value)))
#define LPSPI_BWR_TCR_BYSW(base, value) (BITBAND_ACCESS32(&LPSPI_TCR_REG(base), LPSPI_TCR_BYSW_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPSPI_TCR, field LSBF[23] (RW)
 *
 * Values:
 * - 0b0 - Data is transferred MSB first.
 * - 0b1 - Data is transferred LSB first.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_TCR_LSBF field. */
#define LPSPI_RD_TCR_LSBF(base) ((LPSPI_TCR_REG(base) & LPSPI_TCR_LSBF_MASK) >> LPSPI_TCR_LSBF_SHIFT)
#define LPSPI_BRD_TCR_LSBF(base) (BITBAND_ACCESS32(&LPSPI_TCR_REG(base), LPSPI_TCR_LSBF_SHIFT))

