nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * LPTMR_CMR - Low Power Timer Compare Register
 ******************************************************************************/

/*!
 * @brief LPTMR_CMR - Low Power Timer Compare Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPTMR_CMR register
 */
/*@{*/
#define LPTMR_RD_CMR(base)       (LPTMR_CMR_REG(base))
#define LPTMR_WR_CMR(base, value) (LPTMR_CMR_REG(base) = (value))
#define LPTMR_RMW_CMR(base, mask, value) (LPTMR_WR_CMR(base, (LPTMR_RD_CMR(base) & ~(mask)) | (value)))
#define LPTMR_SET_CMR(base, value) (LPTMR_WR_CMR(base, LPTMR_RD_CMR(base) |  (value)))
#define LPTMR_CLR_CMR(base, value) (LPTMR_WR_CMR(base, LPTMR_RD_CMR(base) & ~(value)))
#define LPTMR_TOG_CMR(base, value) (LPTMR_WR_CMR(base, LPTMR_RD_CMR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPTMR_CMR bitfields
 */

/*!
 * @name Register LPTMR_CMR, field COMPARE[15:0] (RW)
 *
 * When the LPTMR is enabled and the CNR equals the value in the CMR and
 * increments, TCF is set and the hardware trigger asserts until the next time the CNR
 * increments. If the CMR is 0, the hardware trigger will remain asserted until
 * the LPTMR is disabled. If the LPTMR is enabled, the CMR must be altered only
 * when TCF is set.
 */
/*@{*/
/*! @brief Read current value of the LPTMR_CMR_COMPARE field. */
#define LPTMR_RD_CMR_COMPARE(base) ((LPTMR_CMR_REG(base) & LPTMR_CMR_COMPARE_MASK) >> LPTMR_CMR_COMPARE_SHIFT)
#define LPTMR_BRD_CMR_COMPARE(base) (LPTMR_RD_CMR_COMPARE(base))

/*! @brief Set the COMPARE field to a new value. */
#define LPTMR_WR_CMR_COMPARE(base, value) (LPTMR_RMW_CMR(base, LPTMR_CMR_COMPARE_MASK, LPTMR_CMR_COMPARE(value)))
#define LPTMR_BWR_CMR_COMPARE(base, value) (LPTMR_WR_CMR_COMPARE(base, value))
/*@}*/

/*******************************************************************************
 * LPTMR_CNR - Low Power Timer Counter Register
 ******************************************************************************/

/*!
 * @brief LPTMR_CNR - Low Power Timer Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPTMR_CNR register
 */
/*@{*/
#define LPTMR_RD_CNR(base)       (LPTMR_CNR_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPTMR_CNR bitfields
 */

/*!
 * @name Register LPTMR_CNR, field COUNTER[15:0] (RO)
 *
 * The CNR returns the current value of the LPTMR counter at the time this
 * register was last written.
 */
/*@{*/
/*! @brief Read current value of the LPTMR_CNR_COUNTER field. */
#define LPTMR_RD_CNR_COUNTER(base) ((LPTMR_CNR_REG(base) & LPTMR_CNR_COUNTER_MASK) >> LPTMR_CNR_COUNTER_SHIFT)
#define LPTMR_BRD_CNR_COUNTER(base) (LPTMR_RD_CNR_COUNTER(base))
/*@}*/

/*
 * S32K144 LPUART
 *
 * Universal Asynchronous Receiver/Transmitter
 *
 * Registers defined in this header file:
 * - LPUART_VERID - Version ID Register
 * - LPUART_PARAM - Parameter Register
 * - LPUART_GLOBAL - LPUART Global Register
 * - LPUART_PINCFG - LPUART Pin Configuration Register
 * - LPUART_BAUD - LPUART Baud Rate Register
 * - LPUART_STAT - LPUART Status Register
 * - LPUART_CTRL - LPUART Control Register
 * - LPUART_DATA - LPUART Data Register
 * - LPUART_MATCH - LPUART Match Address Register
 * - LPUART_MODIR - LPUART Modem IrDA Register
 */

#define LPUART_INSTANCE_COUNT (4U) /*!< Number of instances of the LPUART module. */
#define LPUART0_IDX (0U) /*!< Instance number for LPUART0. */
#define LPUART1_IDX (1U) /*!< Instance number for LPUART1. */
#define LPUART2_IDX (2U) /*!< Instance number for LPUART2. */
#define LPUART3_IDX (3U) /*!< Instance number for LPUART3. */

/*******************************************************************************
 * LPUART_VERID - Version ID Register
 ******************************************************************************/

/*!
 * @brief LPUART_VERID - Version ID Register (RO)
 *
 * Reset value: 0x04000003U
 */
/*!
 * @name Constants and macros for entire LPUART_VERID register
 */
/*@{*/
#define LPUART_RD_VERID(base)    (LPUART_VERID_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPUART_VERID bitfields
 */

/*!
 * @name Register LPUART_VERID, field FEATURE[15:0] (RO)
 *
 * This read only field returns the feature set number.
 *
 * Values:
 * - 0b0000000000000001 - Standard feature set.
 * - 0b0000000000000011 - Standard feature set with MODEM/IrDA support.
 */
/*@{*/
/*! @brief Read current value of the LPUART_VERID_FEATURE field. */
#define LPUART_RD_VERID_FEATURE(base) ((LPUART_VERID_REG(base) & LPUART_VERID_FEATURE_MASK) >> LPUART_VERID_FEATURE_SHIFT)
#define LPUART_BRD_VERID_FEATURE(base) (LPUART_RD_VERID_FEATURE(base))
/*@}*/

/*!
 * @name Register LPUART_VERID, field MINOR[23:16] (RO)
 *
 * This read only field returns the minor version number for the module
 * specification.
 */
/*@{*/
/*! @brief Read current value of the LPUART_VERID_MINOR field. */
#define LPUART_RD_VERID_MINOR(base) ((LPUART_VERID_REG(base) & LPUART_VERID_MINOR_MASK) >> LPUART_VERID_MINOR_SHIFT)
#define LPUART_BRD_VERID_MINOR(base) (LPUART_RD_VERID_MINOR(base))
/*@}*/

/*!
 * @name Register LPUART_VERID, field MAJOR[31:24] (RO)
 *
 * This read only field returns the major version number for the module
 * specification.
 */
/*@{*/
/*! @brief Read current value of the LPUART_VERID_MAJOR field. */
#define LPUART_RD_VERID_MAJOR(base) ((LPUART_VERID_REG(base) & LPUART_VERID_MAJOR_MASK) >> LPUART_VERID_MAJOR_SHIFT)
#define LPUART_BRD_VERID_MAJOR(base) (LPUART_RD_VERID_MAJOR(base))
/*@}*/

/*******************************************************************************
 * LPUART_PARAM - Parameter Register
 ******************************************************************************/

/*!
 * @brief LPUART_PARAM - Parameter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPUART_PARAM register
 */
/*@{*/
#define LPUART_RD_PARAM(base)    (LPUART_PARAM_REG(base))
/*@}*/

