nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual LPUART_PARAM bitfields
 */

/*!
 * @name Register LPUART_PARAM, field TXFIFO[7:0] (RO)
 *
 * The number of words in the transmit FIFO is 2^TXFIFO.
 */
/*@{*/
/*! @brief Read current value of the LPUART_PARAM_TXFIFO field. */
#define LPUART_RD_PARAM_TXFIFO(base) ((LPUART_PARAM_REG(base) & LPUART_PARAM_TXFIFO_MASK) >> LPUART_PARAM_TXFIFO_SHIFT)
#define LPUART_BRD_PARAM_TXFIFO(base) (LPUART_RD_PARAM_TXFIFO(base))
/*@}*/

/*!
 * @name Register LPUART_PARAM, field RXFIFO[15:8] (RO)
 *
 * The number of words in the receive FIFO is 2^RXFIFO.
 */
/*@{*/
/*! @brief Read current value of the LPUART_PARAM_RXFIFO field. */
#define LPUART_RD_PARAM_RXFIFO(base) ((LPUART_PARAM_REG(base) & LPUART_PARAM_RXFIFO_MASK) >> LPUART_PARAM_RXFIFO_SHIFT)
#define LPUART_BRD_PARAM_RXFIFO(base) (LPUART_RD_PARAM_RXFIFO(base))
/*@}*/

/*******************************************************************************
 * LPUART_GLOBAL - LPUART Global Register
 ******************************************************************************/

/*!
 * @brief LPUART_GLOBAL - LPUART Global Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPUART_GLOBAL register
 */
/*@{*/
#define LPUART_RD_GLOBAL(base)   (LPUART_GLOBAL_REG(base))
#define LPUART_WR_GLOBAL(base, value) (LPUART_GLOBAL_REG(base) = (value))
#define LPUART_RMW_GLOBAL(base, mask, value) (LPUART_WR_GLOBAL(base, (LPUART_RD_GLOBAL(base) & ~(mask)) | (value)))
#define LPUART_SET_GLOBAL(base, value) (LPUART_WR_GLOBAL(base, LPUART_RD_GLOBAL(base) |  (value)))
#define LPUART_CLR_GLOBAL(base, value) (LPUART_WR_GLOBAL(base, LPUART_RD_GLOBAL(base) & ~(value)))
#define LPUART_TOG_GLOBAL(base, value) (LPUART_WR_GLOBAL(base, LPUART_RD_GLOBAL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPUART_GLOBAL bitfields
 */

/*!
 * @name Register LPUART_GLOBAL, field RST[1] (RW)
 *
 * Reset all internal logic and registers, except the Global Register. Remains
 * set until cleared by software.
 *
 * Values:
 * - 0b0 - Module is not reset.
 * - 0b1 - Module is reset.
 */
/*@{*/
/*! @brief Read current value of the LPUART_GLOBAL_RST field. */
#define LPUART_RD_GLOBAL_RST(base) ((LPUART_GLOBAL_REG(base) & LPUART_GLOBAL_RST_MASK) >> LPUART_GLOBAL_RST_SHIFT)
#define LPUART_BRD_GLOBAL_RST(base) (BITBAND_ACCESS32(&LPUART_GLOBAL_REG(base), LPUART_GLOBAL_RST_SHIFT))

/*! @brief Set the RST field to a new value. */
#define LPUART_WR_GLOBAL_RST(base, value) (LPUART_RMW_GLOBAL(base, LPUART_GLOBAL_RST_MASK, LPUART_GLOBAL_RST(value)))
#define LPUART_BWR_GLOBAL_RST(base, value) (BITBAND_ACCESS32(&LPUART_GLOBAL_REG(base), LPUART_GLOBAL_RST_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LPUART_PINCFG - LPUART Pin Configuration Register
 ******************************************************************************/

/*!
 * @brief LPUART_PINCFG - LPUART Pin Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPUART_PINCFG register
 */
/*@{*/
#define LPUART_RD_PINCFG(base)   (LPUART_PINCFG_REG(base))
#define LPUART_WR_PINCFG(base, value) (LPUART_PINCFG_REG(base) = (value))
#define LPUART_RMW_PINCFG(base, mask, value) (LPUART_WR_PINCFG(base, (LPUART_RD_PINCFG(base) & ~(mask)) | (value)))
#define LPUART_SET_PINCFG(base, value) (LPUART_WR_PINCFG(base, LPUART_RD_PINCFG(base) |  (value)))
#define LPUART_CLR_PINCFG(base, value) (LPUART_WR_PINCFG(base, LPUART_RD_PINCFG(base) & ~(value)))
#define LPUART_TOG_PINCFG(base, value) (LPUART_WR_PINCFG(base, LPUART_RD_PINCFG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPUART_PINCFG bitfields
 */

/*!
 * @name Register LPUART_PINCFG, field TRGSEL[1:0] (RW)
 *
 * Configures the input trigger usage.
 *
 * Values:
 * - 0b00 - Input trigger is disabled.
 * - 0b01 - Input trigger is used instead of RXD pin input.
 * - 0b10 - Input trigger is used instead of CTS pin input.
 * - 0b11 - Input trigger is used to modulate the TXD pin output.
 */
/*@{*/
/*! @brief Read current value of the LPUART_PINCFG_TRGSEL field. */
#define LPUART_RD_PINCFG_TRGSEL(base) ((LPUART_PINCFG_REG(base) & LPUART_PINCFG_TRGSEL_MASK) >> LPUART_PINCFG_TRGSEL_SHIFT)
#define LPUART_BRD_PINCFG_TRGSEL(base) (LPUART_RD_PINCFG_TRGSEL(base))

/*! @brief Set the TRGSEL field to a new value. */
#define LPUART_WR_PINCFG_TRGSEL(base, value) (LPUART_RMW_PINCFG(base, LPUART_PINCFG_TRGSEL_MASK, LPUART_PINCFG_TRGSEL(value)))
#define LPUART_BWR_PINCFG_TRGSEL(base, value) (LPUART_WR_PINCFG_TRGSEL(base, value))
/*@}*/

/*******************************************************************************
 * LPUART_BAUD - LPUART Baud Rate Register
 ******************************************************************************/

/*!
 * @brief LPUART_BAUD - LPUART Baud Rate Register (RW)
 *
 * Reset value: 0x0F000004U
 */
/*!
 * @name Constants and macros for entire LPUART_BAUD register
 */
/*@{*/
#define LPUART_RD_BAUD(base)     (LPUART_BAUD_REG(base))
#define LPUART_WR_BAUD(base, value) (LPUART_BAUD_REG(base) = (value))
#define LPUART_RMW_BAUD(base, mask, value) (LPUART_WR_BAUD(base, (LPUART_RD_BAUD(base) & ~(mask)) | (value)))
#define LPUART_SET_BAUD(base, value) (LPUART_WR_BAUD(base, LPUART_RD_BAUD(base) |  (value)))
#define LPUART_CLR_BAUD(base, value) (LPUART_WR_BAUD(base, LPUART_RD_BAUD(base) & ~(value)))
#define LPUART_TOG_BAUD(base, value) (LPUART_WR_BAUD(base, LPUART_RD_BAUD(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LPUART_BAUD bitfields
 */

/*!
 * @name Register LPUART_BAUD, field SBR[12:0] (RW)
 *
 * The 13 bits in SBR[12:0] set the modulo divide rate for the baud rate
 * generator. When SBR is 1 - 8191, the baud rate equals "baud clock / ((OSR+1) * SBR)".
 * The 13-bit baud rate setting [SBR12:SBR0] must only be updated when the
 * transmitter and receiver are both disabled (LPUART_CTRL[RE] and LPUART_CTRL[TE] are
 * both 0).
 */
/*@{*/
/*! @brief Read current value of the LPUART_BAUD_SBR field. */
#define LPUART_RD_BAUD_SBR(base) ((LPUART_BAUD_REG(base) & LPUART_BAUD_SBR_MASK) >> LPUART_BAUD_SBR_SHIFT)
#define LPUART_BRD_BAUD_SBR(base) (LPUART_RD_BAUD_SBR(base))

/*! @brief Set the SBR field to a new value. */
#define LPUART_WR_BAUD_SBR(base, value) (LPUART_RMW_BAUD(base, LPUART_BAUD_SBR_MASK, LPUART_BAUD_SBR(value)))
#define LPUART_BWR_BAUD_SBR(base, value) (LPUART_WR_BAUD_SBR(base, value))
/*@}*/

/*!
 * @name Register LPUART_BAUD, field SBNS[13] (RW)
 *
 * SBNS determines whether data characters are one or two stop bits. This bit
 * should only be changed when the transmitter and receiver are both disabled.
 *
 * Values:
 * - 0b0 - One stop bit.
 * - 0b1 - Two stop bits.
 */
/*@{*/
/*! @brief Read current value of the LPUART_BAUD_SBNS field. */
#define LPUART_RD_BAUD_SBNS(base) ((LPUART_BAUD_REG(base) & LPUART_BAUD_SBNS_MASK) >> LPUART_BAUD_SBNS_SHIFT)
#define LPUART_BRD_BAUD_SBNS(base) (BITBAND_ACCESS32(&LPUART_BAUD_REG(base), LPUART_BAUD_SBNS_SHIFT))

/*! @brief Set the SBNS field to a new value. */
#define LPUART_WR_BAUD_SBNS(base, value) (LPUART_RMW_BAUD(base, LPUART_BAUD_SBNS_MASK, LPUART_BAUD_SBNS(value)))
#define LPUART_BWR_BAUD_SBNS(base, value) (BITBAND_ACCESS32(&LPUART_BAUD_REG(base), LPUART_BAUD_SBNS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPUART_BAUD, field RXEDGIE[14] (RW)
 *
 * Enables the receive input active edge, RXEDGIF, to generate interrupt
 * requests. Changing CTRL[LOOP] or CTRL[RSRC] when RXEDGIE is set can cause the RXEDGIF
 * to set.
 *
 * Values:
 * - 0b0 - Hardware interrupts from LPUART_STAT[RXEDGIF] disabled (use polling).
 * - 0b1 - Hardware interrupt requested when LPUART_STAT[RXEDGIF] flag is 1.
 */
/*@{*/
/*! @brief Read current value of the LPUART_BAUD_RXEDGIE field. */
#define LPUART_RD_BAUD_RXEDGIE(base) ((LPUART_BAUD_REG(base) & LPUART_BAUD_RXEDGIE_MASK) >> LPUART_BAUD_RXEDGIE_SHIFT)
#define LPUART_BRD_BAUD_RXEDGIE(base) (BITBAND_ACCESS32(&LPUART_BAUD_REG(base), LPUART_BAUD_RXEDGIE_SHIFT))

/*! @brief Set the RXEDGIE field to a new value. */
#define LPUART_WR_BAUD_RXEDGIE(base, value) (LPUART_RMW_BAUD(base, LPUART_BAUD_RXEDGIE_MASK, LPUART_BAUD_RXEDGIE(value)))
#define LPUART_BWR_BAUD_RXEDGIE(base, value) (BITBAND_ACCESS32(&LPUART_BAUD_REG(base), LPUART_BAUD_RXEDGIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LPUART_BAUD, field LBKDIE[15] (RW)
 *
 * LBKDIE enables the LIN break detect flag, LBKDIF, to generate interrupt
 * requests.
 *
 * Values:
 * - 0b0 - Hardware interrupts from LPUART_STAT[LBKDIF] disabled (use polling).
 * - 0b1 - Hardware interrupt requested when LPUART_STAT[LBKDIF] flag is 1.
 */
/*@{*/
/*! @brief Read current value of the LPUART_BAUD_LBKDIE field. */
#define LPUART_RD_BAUD_LBKDIE(base) ((LPUART_BAUD_REG(base) & LPUART_BAUD_LBKDIE_MASK) >> LPUART_BAUD_LBKDIE_SHIFT)
#define LPUART_BRD_BAUD_LBKDIE(base) (BITBAND_ACCESS32(&LPUART_BAUD_REG(base), LPUART_BAUD_LBKDIE_SHIFT))

