nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the TNP field to a new value. */
#define LPUART_WR_MODIR_TNP(base, value) (LPUART_RMW_MODIR(base, LPUART_MODIR_TNP_MASK, LPUART_MODIR_TNP(value)))
#define LPUART_BWR_MODIR_TNP(base, value) (LPUART_WR_MODIR_TNP(base, value))
/*@}*/

/*!
 * @name Register LPUART_MODIR, field IREN[18] (RW)
 *
 * Enables/disables the infrared modulation/demodulation.
 *
 * Values:
 * - 0b0 - IR disabled.
 * - 0b1 - IR enabled.
 */
/*@{*/
/*! @brief Read current value of the LPUART_MODIR_IREN field. */
#define LPUART_RD_MODIR_IREN(base) ((LPUART_MODIR_REG(base) & LPUART_MODIR_IREN_MASK) >> LPUART_MODIR_IREN_SHIFT)
#define LPUART_BRD_MODIR_IREN(base) (BITBAND_ACCESS32(&LPUART_MODIR_REG(base), LPUART_MODIR_IREN_SHIFT))

/*! @brief Set the IREN field to a new value. */
#define LPUART_WR_MODIR_IREN(base, value) (LPUART_RMW_MODIR(base, LPUART_MODIR_IREN_MASK, LPUART_MODIR_IREN(value)))
#define LPUART_BWR_MODIR_IREN(base, value) (BITBAND_ACCESS32(&LPUART_MODIR_REG(base), LPUART_MODIR_IREN_SHIFT) = (value))
/*@}*/

/*
 * S32K144 MCM
 *
 * Core Platform Miscellaneous Control Module
 *
 * Registers defined in this header file:
 * - MCM_PLASC - Crossbar Switch (AXBS) Slave Configuration
 * - MCM_PLAMC - Crossbar Switch (AXBS) Master Configuration
 * - MCM_CPCR - Core Platform Control Register
 * - MCM_ISCR - Interrupt Status and Control Register
 * - MCM_FADR - Store Buffer Fault address register
 * - MCM_FATR - Store Buffer Fault Attributes register
 * - MCM_FDR - Store Buffer Fault Data Register
 * - MCM_PID - Process ID register
 * - MCM_CPO - Compute Operation Control Register
 * - MCM_LMDR - Local Memory Descriptor Register
 * - MCM_LMPECR - LMEM Parity & ECC Control Register
 * - MCM_LMPEIR - LMEM Parity & ECC Interrupt Register
 * - MCM_LMFAR - LMEM Fault Address Register
 * - MCM_LMFATR - LMEM Fault Attribute Register
 * - MCM_LMFDHR - LMEM Fault Data High Register
 * - MCM_LMFDLR - LMEM Fault Data Low Register
 */

#define MCM_INSTANCE_COUNT (1U) /*!< Number of instances of the MCM module. */
#define MCM_IDX (0U) /*!< Instance number for MCM. */

/*******************************************************************************
 * MCM_PLASC - Crossbar Switch (AXBS) Slave Configuration
 ******************************************************************************/

/*!
 * @brief MCM_PLASC - Crossbar Switch (AXBS) Slave Configuration (RO)
 *
 * Reset value: 0x0007U
 *
 * PLASC is a 16-bit read-only register identifying the presence/absence of bus
 * slave connections to the device's crossbar switch.
 */
/*!
 * @name Constants and macros for entire MCM_PLASC register
 */
/*@{*/
#define MCM_RD_PLASC(base)       (MCM_PLASC_REG(base))
/*@}*/

/*
 * Constants & macros for individual MCM_PLASC bitfields
 */

/*!
 * @name Register MCM_PLASC, field ASC[7:0] (RO)
 *
 * Values:
 * - 0b00000000 - A bus slave connection to AXBS input port n is absent
 * - 0b00000001 - A bus slave connection to AXBS input port n is present
 */
/*@{*/
/*! @brief Read current value of the MCM_PLASC_ASC field. */
#define MCM_RD_PLASC_ASC(base) ((MCM_PLASC_REG(base) & MCM_PLASC_ASC_MASK) >> MCM_PLASC_ASC_SHIFT)
#define MCM_BRD_PLASC_ASC(base) (MCM_RD_PLASC_ASC(base))
/*@}*/

/*******************************************************************************
 * MCM_PLAMC - Crossbar Switch (AXBS) Master Configuration
 ******************************************************************************/

/*!
 * @brief MCM_PLAMC - Crossbar Switch (AXBS) Master Configuration (RO)
 *
 * Reset value: 0x0007U
 *
 * PLAMC is a 16-bit read-only register identifying the presence/absence of bus
 * master connections to the device's crossbar switch.
 */
/*!
 * @name Constants and macros for entire MCM_PLAMC register
 */
/*@{*/
#define MCM_RD_PLAMC(base)       (MCM_PLAMC_REG(base))
/*@}*/

/*
 * Constants & macros for individual MCM_PLAMC bitfields
 */

/*!
 * @name Register MCM_PLAMC, field AMC[7:0] (RO)
 *
 * Values:
 * - 0b00000000 - A bus master connection to AXBS input port n is absent
 * - 0b00000001 - A bus master connection to AXBS input port n is present
 */
/*@{*/
/*! @brief Read current value of the MCM_PLAMC_AMC field. */
#define MCM_RD_PLAMC_AMC(base) ((MCM_PLAMC_REG(base) & MCM_PLAMC_AMC_MASK) >> MCM_PLAMC_AMC_SHIFT)
#define MCM_BRD_PLAMC_AMC(base) (MCM_RD_PLAMC_AMC(base))
/*@}*/

/*******************************************************************************
 * MCM_CPCR - Core Platform Control Register
 ******************************************************************************/

/*!
 * @brief MCM_CPCR - Core Platform Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Control Register defines the arbitration and protection schemes for the two
 * system RAM arrays. Bits 23-0 are undefined after reset.
 */
/*!
 * @name Constants and macros for entire MCM_CPCR register
 */
/*@{*/
#define MCM_RD_CPCR(base)        (MCM_CPCR_REG(base))
#define MCM_WR_CPCR(base, value) (MCM_CPCR_REG(base) = (value))
#define MCM_RMW_CPCR(base, mask, value) (MCM_WR_CPCR(base, (MCM_RD_CPCR(base) & ~(mask)) | (value)))
#define MCM_SET_CPCR(base, value) (MCM_WR_CPCR(base, MCM_RD_CPCR(base) |  (value)))
#define MCM_CLR_CPCR(base, value) (MCM_WR_CPCR(base, MCM_RD_CPCR(base) & ~(value)))
#define MCM_TOG_CPCR(base, value) (MCM_WR_CPCR(base, MCM_RD_CPCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_CPCR bitfields
 */

/*!
 * @name Register MCM_CPCR, field CBRR[9] (RW)
 *
 * Configures the crossbar slave ports to fixed-priority or round-robin
 * arbitration.
 *
 * Values:
 * - 0b0 - Fixed-priority arbitration
 * - 0b1 - Round-robin arbitration
 */
/*@{*/
/*! @brief Read current value of the MCM_CPCR_CBRR field. */
#define MCM_RD_CPCR_CBRR(base) ((MCM_CPCR_REG(base) & MCM_CPCR_CBRR_MASK) >> MCM_CPCR_CBRR_SHIFT)
#define MCM_BRD_CPCR_CBRR(base) (MCM_RD_CPCR_CBRR(base))

/*! @brief Set the CBRR field to a new value. */
#define MCM_WR_CPCR_CBRR(base, value) (MCM_RMW_CPCR(base, MCM_CPCR_CBRR_MASK, MCM_CPCR_CBRR(value)))
#define MCM_BWR_CPCR_CBRR(base, value) (MCM_WR_CPCR_CBRR(base, value))
/*@}*/

/*!
 * @name Register MCM_CPCR, field SRAMUAP[25:24] (RW)
 *
 * Defines the arbitration scheme and priority for the processor and SRAM
 * backdoor accesses to the SRAM_U array.
 *
 * Values:
 * - 0b00 - Round robin
 * - 0b01 - Special round robin (favors SRAM backdoor accesses over the
 *     processor)
 * - 0b10 - Fixed priority. Processor has highest, backdoor has lowest
 * - 0b11 - Fixed priority. Backdoor has highest, processor has lowest
 */
/*@{*/
/*! @brief Read current value of the MCM_CPCR_SRAMUAP field. */
#define MCM_RD_CPCR_SRAMUAP(base) ((MCM_CPCR_REG(base) & MCM_CPCR_SRAMUAP_MASK) >> MCM_CPCR_SRAMUAP_SHIFT)
#define MCM_BRD_CPCR_SRAMUAP(base) (MCM_RD_CPCR_SRAMUAP(base))

/*! @brief Set the SRAMUAP field to a new value. */
#define MCM_WR_CPCR_SRAMUAP(base, value) (MCM_RMW_CPCR(base, MCM_CPCR_SRAMUAP_MASK, MCM_CPCR_SRAMUAP(value)))
#define MCM_BWR_CPCR_SRAMUAP(base, value) (MCM_WR_CPCR_SRAMUAP(base, value))
/*@}*/

/*!
 * @name Register MCM_CPCR, field SRAMUWP[26] (RW)
 *
 * When this bit is set, writes to SRAM_U array generates a bus error.
 */
/*@{*/
/*! @brief Read current value of the MCM_CPCR_SRAMUWP field. */
#define MCM_RD_CPCR_SRAMUWP(base) ((MCM_CPCR_REG(base) & MCM_CPCR_SRAMUWP_MASK) >> MCM_CPCR_SRAMUWP_SHIFT)
#define MCM_BRD_CPCR_SRAMUWP(base) (MCM_RD_CPCR_SRAMUWP(base))

/*! @brief Set the SRAMUWP field to a new value. */
#define MCM_WR_CPCR_SRAMUWP(base, value) (MCM_RMW_CPCR(base, MCM_CPCR_SRAMUWP_MASK, MCM_CPCR_SRAMUWP(value)))
#define MCM_BWR_CPCR_SRAMUWP(base, value) (MCM_WR_CPCR_SRAMUWP(base, value))
/*@}*/

/*!
 * @name Register MCM_CPCR, field SRAMLAP[29:28] (RW)
 *
 * Defines the arbitration scheme and priority for the processor and SRAM
 * backdoor accesses to the SRAM_L array.
 *
 * Values:
 * - 0b00 - Round robin
 * - 0b01 - Special round robin (favors SRAM backdoor accesses over the
 *     processor)
 * - 0b10 - Fixed priority. Processor has highest, backdoor has lowest
 * - 0b11 - Fixed priority. Backdoor has highest, processor has lowest
 */
/*@{*/
/*! @brief Read current value of the MCM_CPCR_SRAMLAP field. */
#define MCM_RD_CPCR_SRAMLAP(base) ((MCM_CPCR_REG(base) & MCM_CPCR_SRAMLAP_MASK) >> MCM_CPCR_SRAMLAP_SHIFT)
#define MCM_BRD_CPCR_SRAMLAP(base) (MCM_RD_CPCR_SRAMLAP(base))

