nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual MCM_LMDR bitfields
 */

/*!
 * @name Register MCM_LMDR, field CF0[3:0] (RW)
 *
 * CF0[3] - PFE = Parity Fault Enable CF0[2] - RESERVED CF0[1] - EERC = ECC
 * Enable Read Check CF0[0] - EEWG = ECC Enable Write Generation
 */
/*@{*/
/*! @brief Read current value of the MCM_LMDR_CF0 field. */
#define MCM_RD_LMDR_CF0(base, index) ((MCM_LMDR_REG(base, index) & MCM_LMDR_CF0_MASK) >> MCM_LMDR_CF0_SHIFT)
#define MCM_BRD_LMDR_CF0(base, index) (MCM_RD_LMDR_CF0(base, index))

/*! @brief Set the CF0 field to a new value. */
#define MCM_WR_LMDR_CF0(base, index, value) (MCM_RMW_LMDR(base, index, MCM_LMDR_CF0_MASK, MCM_LMDR_CF0(value)))
#define MCM_BWR_LMDR_CF0(base, index, value) (MCM_WR_LMDR_CF0(base, index, value))
/*@}*/

/*!
 * @name Register MCM_LMDR, field CF1[7:4] (RW)
 *
 * CF1[3] - PCPFE = PC Parity Fault Enable CF1[2] - PSPFE = PS Parity Fault
 * Enable CF1[1] - PCPME = PC Parity Miss Enable CF1[0] - PSPME = PS Parity Miss
 * Enable
 */
/*@{*/
/*! @brief Read current value of the MCM_LMDR_CF1 field. */
#define MCM_RD_LMDR_CF1(base, index) ((MCM_LMDR_REG(base, index) & MCM_LMDR_CF1_MASK) >> MCM_LMDR_CF1_SHIFT)
#define MCM_BRD_LMDR_CF1(base, index) (MCM_RD_LMDR_CF1(base, index))

/*! @brief Set the CF1 field to a new value. */
#define MCM_WR_LMDR_CF1(base, index, value) (MCM_RMW_LMDR(base, index, MCM_LMDR_CF1_MASK, MCM_LMDR_CF1(value)))
#define MCM_BWR_LMDR_CF1(base, index, value) (MCM_WR_LMDR_CF1(base, index, value))
/*@}*/

/*!
 * @name Register MCM_LMDR, field MT[15:13] (RO)
 *
 * This field defines the type of the local memory.
 *
 * Values:
 * - 0b000 - SRAM_L
 * - 0b001 - SRAM_U
 * - 0b010 - PC Cache
 * - 0b011 - PS Cache
 */
/*@{*/
/*! @brief Read current value of the MCM_LMDR_MT field. */
#define MCM_RD_LMDR_MT(base, index) ((MCM_LMDR_REG(base, index) & MCM_LMDR_MT_MASK) >> MCM_LMDR_MT_SHIFT)
#define MCM_BRD_LMDR_MT(base, index) (MCM_RD_LMDR_MT(base, index))
/*@}*/

/*!
 * @name Register MCM_LMDR, field RO[16] (RO)
 *
 * (??TBD?? current content from "MSCM OCMEM Configuration Register
 * Descriptions"). Read-Only. This register bit provides a mechanism to "lock" the
 * configuration state defined by LMDRn[7:0]. Once asserted, attempted writes to the
 * LMDRn[7:0] register are ignored until the next reset clears the flag.
 *
 * Values:
 * - 0b0 - (??TBD?? current content from "MSCM OCMEM Configuration Register
 *     Descriptions"). Writes to the LMDRn[7:0] are allowed.
 * - 0b1 - (??TBD?? current content from "MSCM OCMEM Configuration Register
 *     Descriptions"). Writes to the LMDRn[7:0] are ignored.
 */
/*@{*/
/*! @brief Read current value of the MCM_LMDR_RO field. */
#define MCM_RD_LMDR_RO(base, index) ((MCM_LMDR_REG(base, index) & MCM_LMDR_RO_MASK) >> MCM_LMDR_RO_SHIFT)
#define MCM_BRD_LMDR_RO(base, index) (MCM_RD_LMDR_RO(base, index))
/*@}*/

/*!
 * @name Register MCM_LMDR, field DPW[19:17] (RO)
 *
 * LMEM Data Path Width. This read-only field defines the width of the local
 * memory.
 *
 * Values:
 * - 0b010 - LMEMn 32-bits wide
 * - 0b011 - LMEMn 64-bits wide
 */
/*@{*/
/*! @brief Read current value of the MCM_LMDR_DPW field. */
#define MCM_RD_LMDR_DPW(base, index) ((MCM_LMDR_REG(base, index) & MCM_LMDR_DPW_MASK) >> MCM_LMDR_DPW_SHIFT)
#define MCM_BRD_LMDR_DPW(base, index) (MCM_RD_LMDR_DPW(base, index))
/*@}*/

/*!
 * @name Register MCM_LMDR, field WY[23:20] (RO)
 *
 * Values:
 * - 0b0000 - No Cache
 * - 0b0010 - 2-Way Set Associative
 * - 0b0100 - 4-Way Set Associative
 */
/*@{*/
/*! @brief Read current value of the MCM_LMDR_WY field. */
#define MCM_RD_LMDR_WY(base, index) ((MCM_LMDR_REG(base, index) & MCM_LMDR_WY_MASK) >> MCM_LMDR_WY_SHIFT)
#define MCM_BRD_LMDR_WY(base, index) (MCM_RD_LMDR_WY(base, index))
/*@}*/

/*!
 * @name Register MCM_LMDR, field LMSZ[27:24] (RO)
 *
 * (??TBD?? current content from "MSCM OCMEM Configuration Register
 * Descriptions"). LMEM Size. This read-only field provides an encoded value of the local
 * memory size. The capacity of the memory is expressed as Size [bytes] = 2(9+SZ)
 * where SZ is non-zero; a SZ = 0 indicates the memory is not present.
 *
 * Values:
 * - 0b0000 - no LMEMn (0 KB)
 * - 0b0001 - 1 KB LMEMn
 * - 0b0010 - 2 KB LMEMn
 * - 0b0011 - 4 KB LMEMn
 * - 0b0100 - 8 KB LMEMn
 * - 0b0101 - 16 KB LMEMn
 * - 0b0110 - 32 KB LMEMn
 * - 0b0111 - 64 KB LMEMn
 * - 0b1000 - 128 KB LMEMn
 * - 0b1001 - 256 KB LMEMn
 * - 0b1010 - 512 KB LMEMn
 * - 0b1011 - 1024 KB LMEMn
 * - 0b1100 - 2048 KB LMEMn
 * - 0b1101 - 4096 KB LMEMn
 * - 0b1110 - 8192 KB LMEMn
 * - 0b1111 - 16384 KB LMEMn
 */
/*@{*/
/*! @brief Read current value of the MCM_LMDR_LMSZ field. */
#define MCM_RD_LMDR_LMSZ(base, index) ((MCM_LMDR_REG(base, index) & MCM_LMDR_LMSZ_MASK) >> MCM_LMDR_LMSZ_SHIFT)
#define MCM_BRD_LMDR_LMSZ(base, index) (MCM_RD_LMDR_LMSZ(base, index))
/*@}*/

/*!
 * @name Register MCM_LMDR, field LMSZH[28] (RO)
 *
 * (??TBD?? current content from "MSCM OCMEM Configuration Register
 * Descriptions"). LMEM Size "Hole". For local memories that are not fully populated, that
 * is, include a memory "hole" in the upper 25% of the address range, this bit is
 * used.
 *
 * Values:
 * - 0b0 - LMEMn is a power-of-2 capacity.
 * - 0b1 - LMEMn is not a power-of-2, with a capacity is 0.75 * LMSZ.
 */
/*@{*/
/*! @brief Read current value of the MCM_LMDR_LMSZH field. */
#define MCM_RD_LMDR_LMSZH(base, index) ((MCM_LMDR_REG(base, index) & MCM_LMDR_LMSZH_MASK) >> MCM_LMDR_LMSZH_SHIFT)
#define MCM_BRD_LMDR_LMSZH(base, index) (MCM_RD_LMDR_LMSZH(base, index))
/*@}*/

/*!
 * @name Register MCM_LMDR, field V[31] (RO)
 *
 * Local memory Valid bit. This read-only field defines the validity (presence)
 * of the local memory.
 *
 * Values:
 * - 0b0 - (??TBD?? current content from "MSCM OCMEM Configuration Register
 *     Descriptions"). LMEMn is not present.
 * - 0b1 - (??TBD?? current content from "MSCM OCMEM Configuration Register
 *     Descriptions"). LMEMn is present.
 */
/*@{*/
/*! @brief Read current value of the MCM_LMDR_V field. */
#define MCM_RD_LMDR_V(base, index) ((MCM_LMDR_REG(base, index) & MCM_LMDR_V_MASK) >> MCM_LMDR_V_SHIFT)
#define MCM_BRD_LMDR_V(base, index) (MCM_RD_LMDR_V(base, index))
/*@}*/

