nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * MCM_LMPECR - LMEM Parity & ECC Control Register
 ******************************************************************************/

/*!
 * @brief MCM_LMPECR - LMEM Parity & ECC Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * description and reset value ??TBD??
 */
/*!
 * @name Constants and macros for entire MCM_LMPECR register
 */
/*@{*/
#define MCM_RD_LMPECR(base)      (MCM_LMPECR_REG(base))
#define MCM_WR_LMPECR(base, value) (MCM_LMPECR_REG(base) = (value))
#define MCM_RMW_LMPECR(base, mask, value) (MCM_WR_LMPECR(base, (MCM_RD_LMPECR(base) & ~(mask)) | (value)))
#define MCM_SET_LMPECR(base, value) (MCM_WR_LMPECR(base, MCM_RD_LMPECR(base) |  (value)))
#define MCM_CLR_LMPECR(base, value) (MCM_WR_LMPECR(base, MCM_RD_LMPECR(base) & ~(value)))
#define MCM_TOG_LMPECR(base, value) (MCM_WR_LMPECR(base, MCM_RD_LMPECR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_LMPECR bitfields
 */

/*!
 * @name Register MCM_LMPECR, field ERNCR[0] (RW)
 *
 * Values:
 * - 0b0 - reporting enabled
 * - 0b1 - reporting disabled
 */
/*@{*/
/*! @brief Read current value of the MCM_LMPECR_ERNCR field. */
#define MCM_RD_LMPECR_ERNCR(base) ((MCM_LMPECR_REG(base) & MCM_LMPECR_ERNCR_MASK) >> MCM_LMPECR_ERNCR_SHIFT)
#define MCM_BRD_LMPECR_ERNCR(base) (MCM_RD_LMPECR_ERNCR(base))

/*! @brief Set the ERNCR field to a new value. */
#define MCM_WR_LMPECR_ERNCR(base, value) (MCM_RMW_LMPECR(base, MCM_LMPECR_ERNCR_MASK, MCM_LMPECR_ERNCR(value)))
#define MCM_BWR_LMPECR_ERNCR(base, value) (MCM_WR_LMPECR_ERNCR(base, value))
/*@}*/

/*!
 * @name Register MCM_LMPECR, field ER1BR[8] (RW)
 *
 * Values:
 * - 0b0 - reporting enabled
 * - 0b1 - reporting disabled
 */
/*@{*/
/*! @brief Read current value of the MCM_LMPECR_ER1BR field. */
#define MCM_RD_LMPECR_ER1BR(base) ((MCM_LMPECR_REG(base) & MCM_LMPECR_ER1BR_MASK) >> MCM_LMPECR_ER1BR_SHIFT)
#define MCM_BRD_LMPECR_ER1BR(base) (MCM_RD_LMPECR_ER1BR(base))

/*! @brief Set the ER1BR field to a new value. */
#define MCM_WR_LMPECR_ER1BR(base, value) (MCM_RMW_LMPECR(base, MCM_LMPECR_ER1BR_MASK, MCM_LMPECR_ER1BR(value)))
#define MCM_BWR_LMPECR_ER1BR(base, value) (MCM_WR_LMPECR_ER1BR(base, value))
/*@}*/

/*!
 * @name Register MCM_LMPECR, field ERPR[16] (RW)
 *
 * Values:
 * - 0b0 - reporting enabled
 * - 0b1 - reporting disabled
 */
/*@{*/
/*! @brief Read current value of the MCM_LMPECR_ERPR field. */
#define MCM_RD_LMPECR_ERPR(base) ((MCM_LMPECR_REG(base) & MCM_LMPECR_ERPR_MASK) >> MCM_LMPECR_ERPR_SHIFT)
#define MCM_BRD_LMPECR_ERPR(base) (MCM_RD_LMPECR_ERPR(base))

/*! @brief Set the ERPR field to a new value. */
#define MCM_WR_LMPECR_ERPR(base, value) (MCM_RMW_LMPECR(base, MCM_LMPECR_ERPR_MASK, MCM_LMPECR_ERPR(value)))
#define MCM_BWR_LMPECR_ERPR(base, value) (MCM_WR_LMPECR_ERPR(base, value))
/*@}*/

/*!
 * @name Register MCM_LMPECR, field ECPR[20] (RW)
 *
 * Values:
 * - 0b0 - reporting enabled
 * - 0b1 - reporting disabled
 */
/*@{*/
/*! @brief Read current value of the MCM_LMPECR_ECPR field. */
#define MCM_RD_LMPECR_ECPR(base) ((MCM_LMPECR_REG(base) & MCM_LMPECR_ECPR_MASK) >> MCM_LMPECR_ECPR_SHIFT)
#define MCM_BRD_LMPECR_ECPR(base) (MCM_RD_LMPECR_ECPR(base))

/*! @brief Set the ECPR field to a new value. */
#define MCM_WR_LMPECR_ECPR(base, value) (MCM_RMW_LMPECR(base, MCM_LMPECR_ECPR_MASK, MCM_LMPECR_ECPR(value)))
#define MCM_BWR_LMPECR_ECPR(base, value) (MCM_WR_LMPECR_ECPR(base, value))
/*@}*/

/*******************************************************************************
 * MCM_LMPEIR - LMEM Parity & ECC Interrupt Register
 ******************************************************************************/

/*!
 * @brief MCM_LMPEIR - LMEM Parity & ECC Interrupt Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * description and reset value ??TBD?? Write 1 to the error bit in
 * MCM_LMPEIR[23:0] can clear the interrupt flag.
 */
/*!
 * @name Constants and macros for entire MCM_LMPEIR register
 */
/*@{*/
#define MCM_RD_LMPEIR(base)      (MCM_LMPEIR_REG(base))
#define MCM_WR_LMPEIR(base, value) (MCM_LMPEIR_REG(base) = (value))
#define MCM_RMW_LMPEIR(base, mask, value) (MCM_WR_LMPEIR(base, (MCM_RD_LMPEIR(base) & ~(mask)) | (value)))
#define MCM_SET_LMPEIR(base, value) (MCM_WR_LMPEIR(base, MCM_RD_LMPEIR(base) |  (value)))
#define MCM_CLR_LMPEIR(base, value) (MCM_WR_LMPEIR(base, MCM_RD_LMPEIR(base) & ~(value)))
#define MCM_TOG_LMPEIR(base, value) (MCM_WR_LMPEIR(base, MCM_RD_LMPEIR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_LMPEIR bitfields
 */

/*!
 * @name Register MCM_LMPEIR, field ENC[7:0] (RW)
 *
 * PEIR[7:2] - Reserved PEIR[1] - Noncorrectable Error detected on SRAM_U
 * PEIR[0] - Noncorrectable Error detected on SRAM_L
 */
/*@{*/
/*! @brief Read current value of the MCM_LMPEIR_ENC field. */
#define MCM_RD_LMPEIR_ENC(base) ((MCM_LMPEIR_REG(base) & MCM_LMPEIR_ENC_MASK) >> MCM_LMPEIR_ENC_SHIFT)
#define MCM_BRD_LMPEIR_ENC(base) (MCM_RD_LMPEIR_ENC(base))

/*! @brief Set the ENC field to a new value. */
#define MCM_WR_LMPEIR_ENC(base, value) (MCM_RMW_LMPEIR(base, MCM_LMPEIR_ENC_MASK, MCM_LMPEIR_ENC(value)))
#define MCM_BWR_LMPEIR_ENC(base, value) (MCM_WR_LMPEIR_ENC(base, value))
/*@}*/

/*!
 * @name Register MCM_LMPEIR, field E1B[15:8] (RW)
 *
 * PEIR[15:10] - Reserved PEIR[9] - 1-bit Error detected on SRAM_U PEIR[8] -
 * 1-bit Error detected on SRAM_L
 */
/*@{*/
/*! @brief Read current value of the MCM_LMPEIR_E1B field. */
#define MCM_RD_LMPEIR_E1B(base) ((MCM_LMPEIR_REG(base) & MCM_LMPEIR_E1B_MASK) >> MCM_LMPEIR_E1B_SHIFT)
#define MCM_BRD_LMPEIR_E1B(base) (MCM_RD_LMPEIR_E1B(base))

/*! @brief Set the E1B field to a new value. */
#define MCM_WR_LMPEIR_E1B(base, value) (MCM_RMW_LMPEIR(base, MCM_LMPEIR_E1B_MASK, MCM_LMPEIR_E1B(value)))
#define MCM_BWR_LMPEIR_E1B(base, value) (MCM_WR_LMPEIR_E1B(base, value))
/*@}*/

/*!
 * @name Register MCM_LMPEIR, field PE[23:16] (RW)
 *
 * [21] - PC Data Parity Error [20] - PC Tag Parity Error [19] - RESERVED [18] -
 * RESERVED
 */
/*@{*/
/*! @brief Read current value of the MCM_LMPEIR_PE field. */
#define MCM_RD_LMPEIR_PE(base) ((MCM_LMPEIR_REG(base) & MCM_LMPEIR_PE_MASK) >> MCM_LMPEIR_PE_SHIFT)
#define MCM_BRD_LMPEIR_PE(base) (MCM_RD_LMPEIR_PE(base))

/*! @brief Set the PE field to a new value. */
#define MCM_WR_LMPEIR_PE(base, value) (MCM_RMW_LMPEIR(base, MCM_LMPEIR_PE_MASK, MCM_LMPEIR_PE(value)))
#define MCM_BWR_LMPEIR_PE(base, value) (MCM_WR_LMPEIR_PE(base, value))
/*@}*/

/*!
 * @name Register MCM_LMPEIR, field PEELOC[28:24] (RW)
 *
 * 5'h00 - a non-correctable ECC event from SRAM_L 5'h01 - a non-correctable ECC
 * event from SRAM_U 5'h08 - a 1-bit correctable ECC event from SRAM_L 5'h09 - a
 * 1-bit correctable ECC event from SRAM_U 5'h14 - a PC Tag Parity Error 5'h15 -
 * a PC Data Parity Error
 */
/*@{*/
/*! @brief Read current value of the MCM_LMPEIR_PEELOC field. */
#define MCM_RD_LMPEIR_PEELOC(base) ((MCM_LMPEIR_REG(base) & MCM_LMPEIR_PEELOC_MASK) >> MCM_LMPEIR_PEELOC_SHIFT)
#define MCM_BRD_LMPEIR_PEELOC(base) (MCM_RD_LMPEIR_PEELOC(base))

/*! @brief Set the PEELOC field to a new value. */
#define MCM_WR_LMPEIR_PEELOC(base, value) (MCM_RMW_LMPEIR(base, MCM_LMPEIR_PEELOC_MASK, MCM_LMPEIR_PEELOC(value)))
#define MCM_BWR_LMPEIR_PEELOC(base, value) (MCM_WR_LMPEIR_PEELOC(base, value))
/*@}*/

/*!
 * @name Register MCM_LMPEIR, field V[31] (RO)
 */
/*@{*/
/*! @brief Read current value of the MCM_LMPEIR_V field. */
#define MCM_RD_LMPEIR_V(base) ((MCM_LMPEIR_REG(base) & MCM_LMPEIR_V_MASK) >> MCM_LMPEIR_V_SHIFT)
#define MCM_BRD_LMPEIR_V(base) (MCM_RD_LMPEIR_V(base))
/*@}*/

