nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * MCM_LMFAR - LMEM Fault Address Register
 ******************************************************************************/

/*!
 * @brief MCM_LMFAR - LMEM Fault Address Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * descciption and reset value ??TBD??
 */
/*!
 * @name Constants and macros for entire MCM_LMFAR register
 */
/*@{*/
#define MCM_RD_LMFAR(base)       (MCM_LMFAR_REG(base))
/*@}*/

/*******************************************************************************
 * MCM_LMFATR - LMEM Fault Attribute Register
 ******************************************************************************/

/*!
 * @brief MCM_LMFATR - LMEM Fault Attribute Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * description and reset value ??TBD??
 */
/*!
 * @name Constants and macros for entire MCM_LMFATR register
 */
/*@{*/
#define MCM_RD_LMFATR(base)      (MCM_LMFATR_REG(base))
#define MCM_WR_LMFATR(base, value) (MCM_LMFATR_REG(base) = (value))
#define MCM_RMW_LMFATR(base, mask, value) (MCM_WR_LMFATR(base, (MCM_RD_LMFATR(base) & ~(mask)) | (value)))
#define MCM_SET_LMFATR(base, value) (MCM_WR_LMFATR(base, MCM_RD_LMFATR(base) |  (value)))
#define MCM_CLR_LMFATR(base, value) (MCM_WR_LMFATR(base, MCM_RD_LMFATR(base) & ~(value)))
#define MCM_TOG_LMFATR(base, value) (MCM_WR_LMFATR(base, MCM_RD_LMFATR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_LMFATR bitfields
 */

/*!
 * @name Register MCM_LMFATR, field PEFPRT[3:0] (RW)
 *
 * FATR[3] is Cacheable: 0=Non-cacheable, 1=Cacheable FATR[2] is Bufferable:
 * 0=Non-bufferable, 1=Bufferable FATR[1] is Mode: 0=User mode, 1=Supervisor mode
 * FATR[0] is Type: 0=I-Fetch, 1=Data
 */
/*@{*/
/*! @brief Read current value of the MCM_LMFATR_PEFPRT field. */
#define MCM_RD_LMFATR_PEFPRT(base) ((MCM_LMFATR_REG(base) & MCM_LMFATR_PEFPRT_MASK) >> MCM_LMFATR_PEFPRT_SHIFT)
#define MCM_BRD_LMFATR_PEFPRT(base) (MCM_RD_LMFATR_PEFPRT(base))

/*! @brief Set the PEFPRT field to a new value. */
#define MCM_WR_LMFATR_PEFPRT(base, value) (MCM_RMW_LMFATR(base, MCM_LMFATR_PEFPRT_MASK, MCM_LMFATR_PEFPRT(value)))
#define MCM_BWR_LMFATR_PEFPRT(base, value) (MCM_WR_LMFATR_PEFPRT(base, value))
/*@}*/

/*!
 * @name Register MCM_LMFATR, field PEFSIZE[6:4] (RW)
 *
 * 3'b000 = 8-bit access 3'b001 = 16-bit access 3'b010 = 32-bit access 3'b011 =
 * 64-bit access 3'b1xx = Reserved
 */
/*@{*/
/*! @brief Read current value of the MCM_LMFATR_PEFSIZE field. */
#define MCM_RD_LMFATR_PEFSIZE(base) ((MCM_LMFATR_REG(base) & MCM_LMFATR_PEFSIZE_MASK) >> MCM_LMFATR_PEFSIZE_SHIFT)
#define MCM_BRD_LMFATR_PEFSIZE(base) (MCM_RD_LMFATR_PEFSIZE(base))

/*! @brief Set the PEFSIZE field to a new value. */
#define MCM_WR_LMFATR_PEFSIZE(base, value) (MCM_RMW_LMFATR(base, MCM_LMFATR_PEFSIZE_MASK, MCM_LMFATR_PEFSIZE(value)))
#define MCM_BWR_LMFATR_PEFSIZE(base, value) (MCM_WR_LMFATR_PEFSIZE(base, value))
/*@}*/

/*!
 * @name Register MCM_LMFATR, field PEFW[7] (RO)
 */
/*@{*/
/*! @brief Read current value of the MCM_LMFATR_PEFW field. */
#define MCM_RD_LMFATR_PEFW(base) ((MCM_LMFATR_REG(base) & MCM_LMFATR_PEFW_MASK) >> MCM_LMFATR_PEFW_SHIFT)
#define MCM_BRD_LMFATR_PEFW(base) (MCM_RD_LMFATR_PEFW(base))
/*@}*/

/*!
 * @name Register MCM_LMFATR, field PEFMST[15:8] (RO)
 */
/*@{*/
/*! @brief Read current value of the MCM_LMFATR_PEFMST field. */
#define MCM_RD_LMFATR_PEFMST(base) ((MCM_LMFATR_REG(base) & MCM_LMFATR_PEFMST_MASK) >> MCM_LMFATR_PEFMST_SHIFT)
#define MCM_BRD_LMFATR_PEFMST(base) (MCM_RD_LMFATR_PEFMST(base))
/*@}*/

/*!
 * @name Register MCM_LMFATR, field OVR[31] (RO)
 */
/*@{*/
/*! @brief Read current value of the MCM_LMFATR_OVR field. */
#define MCM_RD_LMFATR_OVR(base) ((MCM_LMFATR_REG(base) & MCM_LMFATR_OVR_MASK) >> MCM_LMFATR_OVR_SHIFT)
#define MCM_BRD_LMFATR_OVR(base) (MCM_RD_LMFATR_OVR(base))
/*@}*/

/*******************************************************************************
 * MCM_LMFDHR - LMEM Fault Data High Register
 ******************************************************************************/

/*!
 * @brief MCM_LMFDHR - LMEM Fault Data High Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * description and reset value ??TBD??
 */
/*!
 * @name Constants and macros for entire MCM_LMFDHR register
 */
/*@{*/
#define MCM_RD_LMFDHR(base)      (MCM_LMFDHR_REG(base))
/*@}*/

/*******************************************************************************
 * MCM_LMFDLR - LMEM Fault Data Low Register
 ******************************************************************************/

/*!
 * @brief MCM_LMFDLR - LMEM Fault Data Low Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * description and reset value ??TBD??
 */
/*!
 * @name Constants and macros for entire MCM_LMFDLR register
 */
/*@{*/
#define MCM_RD_LMFDLR(base)      (MCM_LMFDLR_REG(base))
/*@}*/

/*
 * S32K144 MPU
 *
 * Memory protection unit
 *
 * Registers defined in this header file:
 * - MPU_CESR - Control/Error Status Register
 * - MPU_EAR0 - Error Address Register, slave port n
 * - MPU_EDR0 - Error Detail Register, slave port n
 * - MPU_EAR1 - Error Address Register, slave port n
 * - MPU_EDR1 - Error Detail Register, slave port n
 * - MPU_EAR2 - Error Address Register, slave port n
 * - MPU_EDR2 - Error Detail Register, slave port n
 * - MPU_EAR3 - Error Address Register, slave port n
 * - MPU_EDR3 - Error Detail Register, slave port n
 * - MPU_EAR4 - Error Address Register, slave port n
 * - MPU_EDR4 - Error Detail Register, slave port n
 * - MPU_EAR5 - Error Address Register, slave port n
 * - MPU_EDR5 - Error Detail Register, slave port n
 * - MPU_EAR6 - Error Address Register, slave port n
 * - MPU_EDR6 - Error Detail Register, slave port n
 * - MPU_EAR7 - Error Address Register, slave port n
 * - MPU_EDR7 - Error Detail Register, slave port n
 * - MPU_RGD0_WORD0 - Region Descriptor n, Word 0
 * - MPU_RGD0_WORD1 - Region Descriptor n, Word 1
 * - MPU_RGD0_WORD2 - Region Descriptor n, Word 2
 * - MPU_RGD0_WORD3 - Region Descriptor n, Word 3
 * - MPU_RGD1_WORD0 - Region Descriptor n, Word 0
 * - MPU_RGD1_WORD1 - Region Descriptor n, Word 1
 * - MPU_RGD1_WORD2 - Region Descriptor n, Word 2
 * - MPU_RGD1_WORD3 - Region Descriptor n, Word 3
 * - MPU_RGD2_WORD0 - Region Descriptor n, Word 0
 * - MPU_RGD2_WORD1 - Region Descriptor n, Word 1
 * - MPU_RGD2_WORD2 - Region Descriptor n, Word 2
 * - MPU_RGD2_WORD3 - Region Descriptor n, Word 3
 * - MPU_RGD3_WORD0 - Region Descriptor n, Word 0
 * - MPU_RGD3_WORD1 - Region Descriptor n, Word 1
 * - MPU_RGD3_WORD2 - Region Descriptor n, Word 2
 * - MPU_RGD3_WORD3 - Region Descriptor n, Word 3
 * - MPU_RGD4_WORD0 - Region Descriptor n, Word 0
 * - MPU_RGD4_WORD1 - Region Descriptor n, Word 1
 * - MPU_RGD4_WORD2 - Region Descriptor n, Word 2
 * - MPU_RGD4_WORD3 - Region Descriptor n, Word 3
 * - MPU_RGD5_WORD0 - Region Descriptor n, Word 0
 * - MPU_RGD5_WORD1 - Region Descriptor n, Word 1
 * - MPU_RGD5_WORD2 - Region Descriptor n, Word 2
 * - MPU_RGD5_WORD3 - Region Descriptor n, Word 3
 * - MPU_RGD6_WORD0 - Region Descriptor n, Word 0
 * - MPU_RGD6_WORD1 - Region Descriptor n, Word 1
 * - MPU_RGD6_WORD2 - Region Descriptor n, Word 2
 * - MPU_RGD6_WORD3 - Region Descriptor n, Word 3
 * - MPU_RGD7_WORD0 - Region Descriptor n, Word 0
 * - MPU_RGD7_WORD1 - Region Descriptor n, Word 1
 * - MPU_RGD7_WORD2 - Region Descriptor n, Word 2
 * - MPU_RGD7_WORD3 - Region Descriptor n, Word 3
 * - MPU_RGDAAC0 - Region Descriptor Alternate Access Control n
 * - MPU_RGDAAC1 - Region Descriptor Alternate Access Control n
 * - MPU_RGDAAC2 - Region Descriptor Alternate Access Control n
 * - MPU_RGDAAC3 - Region Descriptor Alternate Access Control n
 * - MPU_RGDAAC4 - Region Descriptor Alternate Access Control n
 * - MPU_RGDAAC5 - Region Descriptor Alternate Access Control n
 * - MPU_RGDAAC6 - Region Descriptor Alternate Access Control n
 * - MPU_RGDAAC7 - Region Descriptor Alternate Access Control n
 */

#define MPU_INSTANCE_COUNT (1U) /*!< Number of instances of the MPU module. */
#define MPU_IDX (0U) /*!< Instance number for MPU. */

