nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * MPU_EAR5 - Error Address Register, slave port n
 ******************************************************************************/

/*!
 * @brief MPU_EAR5 - Error Address Register, slave port n (RO)
 *
 * Reset value: 0x00000000U
 *
 * When the MPU detects an access error on slave port n, the 32-bit reference
 * address is captured in this read-only register and the corresponding bit in
 * CESR[SPERR] set. Additional information about the faulting access is captured in
 * the corresponding EDRn at the same time. This register and the corresponding
 * EDRn contain the most recent access error; there are no hardware interlocks with
 * CESR[SPERR], as the error registers are always loaded upon the occurrence of
 * each protection violation.
 */
/*!
 * @name Constants and macros for entire MPU_EAR5 register
 */
/*@{*/
#define MPU_RD_EAR5(base)        (MPU_EAR5_REG(base))
/*@}*/

/*******************************************************************************
 * MPU_EDR5 - Error Detail Register, slave port n
 ******************************************************************************/

/*!
 * @brief MPU_EDR5 - Error Detail Register, slave port n (RO)
 *
 * Reset value: 0x00000000U
 *
 * When the MPU detects an access error on slave port n, 32 bits of error detail
 * are captured in this read-only register and the corresponding bit in
 * CESR[SPERR] is set. Information on the faulting address is captured in the
 * corresponding EARn register at the same time. This register and the corresponding EARn
 * register contain the most recent access error; there are no hardware interlocks
 * with CESR[SPERR] as the error registers are always loaded upon the occurrence
 * of each protection violation.
 */
/*!
 * @name Constants and macros for entire MPU_EDR5 register
 */
/*@{*/
#define MPU_RD_EDR5(base)        (MPU_EDR5_REG(base))
/*@}*/

/*
 * Constants & macros for individual MPU_EDR5 bitfields
 */

/*!
 * @name Register MPU_EDR5, field ERW[0] (RO)
 *
 * Indicates the access type of the faulting reference.
 *
 * Values:
 * - 0b0 - Read
 * - 0b1 - Write
 */
/*@{*/
/*! @brief Read current value of the MPU_EDR5_ERW field. */
#define MPU_RD_EDR5_ERW(base) ((MPU_EDR5_REG(base) & MPU_EDR5_ERW_MASK) >> MPU_EDR5_ERW_SHIFT)
#define MPU_BRD_EDR5_ERW(base) (BITBAND_ACCESS32(&MPU_EDR5_REG(base), MPU_EDR5_ERW_SHIFT))
/*@}*/

/*!
 * @name Register MPU_EDR5, field EATTR[3:1] (RO)
 *
 * Indicates attribute information about the faulting reference. All other
 * encodings are reserved.
 *
 * Values:
 * - 0b000 - User mode, instruction access
 * - 0b001 - User mode, data access
 * - 0b010 - Supervisor mode, instruction access
 * - 0b011 - Supervisor mode, data access
 */
/*@{*/
/*! @brief Read current value of the MPU_EDR5_EATTR field. */
#define MPU_RD_EDR5_EATTR(base) ((MPU_EDR5_REG(base) & MPU_EDR5_EATTR_MASK) >> MPU_EDR5_EATTR_SHIFT)
#define MPU_BRD_EDR5_EATTR(base) (MPU_RD_EDR5_EATTR(base))
/*@}*/

/*!
 * @name Register MPU_EDR5, field EMN[7:4] (RO)
 *
 * Indicates the bus master that generated the access error.
 */
/*@{*/
/*! @brief Read current value of the MPU_EDR5_EMN field. */
#define MPU_RD_EDR5_EMN(base) ((MPU_EDR5_REG(base) & MPU_EDR5_EMN_MASK) >> MPU_EDR5_EMN_SHIFT)
#define MPU_BRD_EDR5_EMN(base) (MPU_RD_EDR5_EMN(base))
/*@}*/

/*!
 * @name Register MPU_EDR5, field EPID[15:8] (RO)
 *
 * Records the process identifier of the faulting reference. The process
 * identifier is typically driven only by processor cores; for other bus masters, this
 * field is cleared.
 */
/*@{*/
/*! @brief Read current value of the MPU_EDR5_EPID field. */
#define MPU_RD_EDR5_EPID(base) ((MPU_EDR5_REG(base) & MPU_EDR5_EPID_MASK) >> MPU_EDR5_EPID_SHIFT)
#define MPU_BRD_EDR5_EPID(base) (MPU_RD_EDR5_EPID(base))
/*@}*/

/*!
 * @name Register MPU_EDR5, field EACD[31:16] (RO)
 *
 * Indicates the region descriptor with the access error. If EDRn contains a
 * captured error and EACD is cleared, an access did not hit in any region
 * descriptor. If only a single EACD bit is set, the protection error was caused by a
 * single non-overlapping region descriptor. If two or more EACD bits are set, the
 * protection error was caused by an overlapping set of region descriptors.
 */
/*@{*/
/*! @brief Read current value of the MPU_EDR5_EACD field. */
#define MPU_RD_EDR5_EACD(base) ((MPU_EDR5_REG(base) & MPU_EDR5_EACD_MASK) >> MPU_EDR5_EACD_SHIFT)
#define MPU_BRD_EDR5_EACD(base) (MPU_RD_EDR5_EACD(base))
/*@}*/

/*******************************************************************************
 * MPU_EAR6 - Error Address Register, slave port n
 ******************************************************************************/

/*!
 * @brief MPU_EAR6 - Error Address Register, slave port n (RO)
 *
 * Reset value: 0x00000000U
 *
 * When the MPU detects an access error on slave port n, the 32-bit reference
 * address is captured in this read-only register and the corresponding bit in
 * CESR[SPERR] set. Additional information about the faulting access is captured in
 * the corresponding EDRn at the same time. This register and the corresponding
 * EDRn contain the most recent access error; there are no hardware interlocks with
 * CESR[SPERR], as the error registers are always loaded upon the occurrence of
 * each protection violation.
 */
/*!
 * @name Constants and macros for entire MPU_EAR6 register
 */
/*@{*/
#define MPU_RD_EAR6(base)        (MPU_EAR6_REG(base))
/*@}*/

/*******************************************************************************
 * MPU_EDR6 - Error Detail Register, slave port n
 ******************************************************************************/

/*!
 * @brief MPU_EDR6 - Error Detail Register, slave port n (RO)
 *
 * Reset value: 0x00000000U
 *
 * When the MPU detects an access error on slave port n, 32 bits of error detail
 * are captured in this read-only register and the corresponding bit in
 * CESR[SPERR] is set. Information on the faulting address is captured in the
 * corresponding EARn register at the same time. This register and the corresponding EARn
 * register contain the most recent access error; there are no hardware interlocks
 * with CESR[SPERR] as the error registers are always loaded upon the occurrence
 * of each protection violation.
 */
/*!
 * @name Constants and macros for entire MPU_EDR6 register
 */
/*@{*/
#define MPU_RD_EDR6(base)        (MPU_EDR6_REG(base))
/*@}*/

