nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * MPU_RGD0_WORD0 - Region Descriptor n, Word 0
 ******************************************************************************/

/*!
 * @brief MPU_RGD0_WORD0 - Region Descriptor n, Word 0 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The first word of the region descriptor defines the 0-modulo-32 byte start
 * address of the memory region. Writes to this register clear the region
 * descriptor's valid bit (RGDn_WORD3[VLD]).
 */
/*!
 * @name Constants and macros for entire MPU_RGD0_WORD0 register
 */
/*@{*/
#define MPU_RD_RGD0_WORD0(base)  (MPU_RGD0_WORD0_REG(base))
#define MPU_WR_RGD0_WORD0(base, value) (MPU_RGD0_WORD0_REG(base) = (value))
#define MPU_RMW_RGD0_WORD0(base, mask, value) (MPU_WR_RGD0_WORD0(base, (MPU_RD_RGD0_WORD0(base) & ~(mask)) | (value)))
#define MPU_SET_RGD0_WORD0(base, value) (MPU_WR_RGD0_WORD0(base, MPU_RD_RGD0_WORD0(base) |  (value)))
#define MPU_CLR_RGD0_WORD0(base, value) (MPU_WR_RGD0_WORD0(base, MPU_RD_RGD0_WORD0(base) & ~(value)))
#define MPU_TOG_RGD0_WORD0(base, value) (MPU_WR_RGD0_WORD0(base, MPU_RD_RGD0_WORD0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MPU_RGD0_WORD0 bitfields
 */

/*!
 * @name Register MPU_RGD0_WORD0, field SRTADDR[31:5] (RW)
 *
 * Defines the most significant bits of the 0-modulo-32 byte start address of
 * the memory region.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD0_SRTADDR field. */
#define MPU_RD_RGD0_WORD0_SRTADDR(base) ((MPU_RGD0_WORD0_REG(base) & MPU_RGD0_WORD0_SRTADDR_MASK) >> MPU_RGD0_WORD0_SRTADDR_SHIFT)
#define MPU_BRD_RGD0_WORD0_SRTADDR(base) (MPU_RD_RGD0_WORD0_SRTADDR(base))

/*! @brief Set the SRTADDR field to a new value. */
#define MPU_WR_RGD0_WORD0_SRTADDR(base, value) (MPU_RMW_RGD0_WORD0(base, MPU_RGD0_WORD0_SRTADDR_MASK, MPU_RGD0_WORD0_SRTADDR(value)))
#define MPU_BWR_RGD0_WORD0_SRTADDR(base, value) (MPU_WR_RGD0_WORD0_SRTADDR(base, value))
/*@}*/

/*******************************************************************************
 * MPU_RGD0_WORD1 - Region Descriptor n, Word 1
 ******************************************************************************/

/*!
 * @brief MPU_RGD0_WORD1 - Region Descriptor n, Word 1 (RW)
 *
 * Reset value: 0x0000001FU
 *
 * The second word of the region descriptor defines the 31-modulo-32 byte end
 * address of the memory region. Writes to this register clear the region
 * descriptor's valid bit (RGDn_WORD3[VLD]).
 */
/*!
 * @name Constants and macros for entire MPU_RGD0_WORD1 register
 */
/*@{*/
#define MPU_RD_RGD0_WORD1(base)  (MPU_RGD0_WORD1_REG(base))
#define MPU_WR_RGD0_WORD1(base, value) (MPU_RGD0_WORD1_REG(base) = (value))
#define MPU_RMW_RGD0_WORD1(base, mask, value) (MPU_WR_RGD0_WORD1(base, (MPU_RD_RGD0_WORD1(base) & ~(mask)) | (value)))
#define MPU_SET_RGD0_WORD1(base, value) (MPU_WR_RGD0_WORD1(base, MPU_RD_RGD0_WORD1(base) |  (value)))
#define MPU_CLR_RGD0_WORD1(base, value) (MPU_WR_RGD0_WORD1(base, MPU_RD_RGD0_WORD1(base) & ~(value)))
#define MPU_TOG_RGD0_WORD1(base, value) (MPU_WR_RGD0_WORD1(base, MPU_RD_RGD0_WORD1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MPU_RGD0_WORD1 bitfields
 */

/*!
 * @name Register MPU_RGD0_WORD1, field ENDADDR[31:5] (RW)
 *
 * Defines the most significant bits of the 31-modulo-32 byte end address of the
 * memory region. The MPU does not verify that ENDADDR >= SRTADDR.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD1_ENDADDR field. */
#define MPU_RD_RGD0_WORD1_ENDADDR(base) ((MPU_RGD0_WORD1_REG(base) & MPU_RGD0_WORD1_ENDADDR_MASK) >> MPU_RGD0_WORD1_ENDADDR_SHIFT)
#define MPU_BRD_RGD0_WORD1_ENDADDR(base) (MPU_RD_RGD0_WORD1_ENDADDR(base))

/*! @brief Set the ENDADDR field to a new value. */
#define MPU_WR_RGD0_WORD1_ENDADDR(base, value) (MPU_RMW_RGD0_WORD1(base, MPU_RGD0_WORD1_ENDADDR_MASK, MPU_RGD0_WORD1_ENDADDR(value)))
#define MPU_BWR_RGD0_WORD1_ENDADDR(base, value) (MPU_WR_RGD0_WORD1_ENDADDR(base, value))
/*@}*/

/*******************************************************************************
 * MPU_RGD0_WORD2 - Region Descriptor n, Word 2
 ******************************************************************************/

/*!
 * @brief MPU_RGD0_WORD2 - Region Descriptor n, Word 2 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The third word of the region descriptor defines the access control rights of
 * the memory region. The access control privileges depend on two broad
 * classifications of bus masters: Bus masters 0-3 have a 5-bit field defining separate
 * privilege rights for user and supervisor mode accesses, as well as the optional
 * inclusion of a process identification field within the definition. Bus masters
 * 4-7 are limited to separate read and write permissions. For the privilege
 * rights of bus masters 0-3, there are three flags associated with this function:
 * Read (r) refers to accessing the referenced memory address using an operand
 * (data) fetch Write (w) refers to updating the referenced memory address using a
 * store (data) instruction Execute (x) refers to reading the referenced memory
 * address using an instruction fetch Writes to RGDn_WORD2 clear the region
 * descriptor's valid bit (RGDn_WORD3[VLD]). If only updating the access controls, write
 * to RGDAACn instead because stores to these locations do not affect the
 * descriptor's valid bit.
 */
/*!
 * @name Constants and macros for entire MPU_RGD0_WORD2 register
 */
/*@{*/
#define MPU_RD_RGD0_WORD2(base)  (MPU_RGD0_WORD2_REG(base))
#define MPU_WR_RGD0_WORD2(base, value) (MPU_RGD0_WORD2_REG(base) = (value))
#define MPU_RMW_RGD0_WORD2(base, mask, value) (MPU_WR_RGD0_WORD2(base, (MPU_RD_RGD0_WORD2(base) & ~(mask)) | (value)))
#define MPU_SET_RGD0_WORD2(base, value) (MPU_WR_RGD0_WORD2(base, MPU_RD_RGD0_WORD2(base) |  (value)))
#define MPU_CLR_RGD0_WORD2(base, value) (MPU_WR_RGD0_WORD2(base, MPU_RD_RGD0_WORD2(base) & ~(value)))
#define MPU_TOG_RGD0_WORD2(base, value) (MPU_WR_RGD0_WORD2(base, MPU_RD_RGD0_WORD2(base) ^  (value)))
/*@}*/

