nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual MPU_RGD0_WORD2 bitfields
 */

/*!
 * @name Register MPU_RGD0_WORD2, field M0UM[2:0] (RW)
 *
 * See M3UM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD2_M0UM field. */
#define MPU_RD_RGD0_WORD2_M0UM(base) ((MPU_RGD0_WORD2_REG(base) & MPU_RGD0_WORD2_M0UM_MASK) >> MPU_RGD0_WORD2_M0UM_SHIFT)
#define MPU_BRD_RGD0_WORD2_M0UM(base) (MPU_RD_RGD0_WORD2_M0UM(base))

/*! @brief Set the M0UM field to a new value. */
#define MPU_WR_RGD0_WORD2_M0UM(base, value) (MPU_RMW_RGD0_WORD2(base, MPU_RGD0_WORD2_M0UM_MASK, MPU_RGD0_WORD2_M0UM(value)))
#define MPU_BWR_RGD0_WORD2_M0UM(base, value) (MPU_WR_RGD0_WORD2_M0UM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGD0_WORD2, field M0SM[4:3] (RW)
 *
 * See M3SM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD2_M0SM field. */
#define MPU_RD_RGD0_WORD2_M0SM(base) ((MPU_RGD0_WORD2_REG(base) & MPU_RGD0_WORD2_M0SM_MASK) >> MPU_RGD0_WORD2_M0SM_SHIFT)
#define MPU_BRD_RGD0_WORD2_M0SM(base) (MPU_RD_RGD0_WORD2_M0SM(base))

/*! @brief Set the M0SM field to a new value. */
#define MPU_WR_RGD0_WORD2_M0SM(base, value) (MPU_RMW_RGD0_WORD2(base, MPU_RGD0_WORD2_M0SM_MASK, MPU_RGD0_WORD2_M0SM(value)))
#define MPU_BWR_RGD0_WORD2_M0SM(base, value) (MPU_WR_RGD0_WORD2_M0SM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGD0_WORD2, field M0PE[5] (RW)
 *
 * See M0PE description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD2_M0PE field. */
#define MPU_RD_RGD0_WORD2_M0PE(base) ((MPU_RGD0_WORD2_REG(base) & MPU_RGD0_WORD2_M0PE_MASK) >> MPU_RGD0_WORD2_M0PE_SHIFT)
#define MPU_BRD_RGD0_WORD2_M0PE(base) (BITBAND_ACCESS32(&MPU_RGD0_WORD2_REG(base), MPU_RGD0_WORD2_M0PE_SHIFT))

/*! @brief Set the M0PE field to a new value. */
#define MPU_WR_RGD0_WORD2_M0PE(base, value) (MPU_RMW_RGD0_WORD2(base, MPU_RGD0_WORD2_M0PE_MASK, MPU_RGD0_WORD2_M0PE(value)))
#define MPU_BWR_RGD0_WORD2_M0PE(base, value) (BITBAND_ACCESS32(&MPU_RGD0_WORD2_REG(base), MPU_RGD0_WORD2_M0PE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGD0_WORD2, field M1UM[8:6] (RW)
 *
 * See M3UM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD2_M1UM field. */
#define MPU_RD_RGD0_WORD2_M1UM(base) ((MPU_RGD0_WORD2_REG(base) & MPU_RGD0_WORD2_M1UM_MASK) >> MPU_RGD0_WORD2_M1UM_SHIFT)
#define MPU_BRD_RGD0_WORD2_M1UM(base) (MPU_RD_RGD0_WORD2_M1UM(base))

/*! @brief Set the M1UM field to a new value. */
#define MPU_WR_RGD0_WORD2_M1UM(base, value) (MPU_RMW_RGD0_WORD2(base, MPU_RGD0_WORD2_M1UM_MASK, MPU_RGD0_WORD2_M1UM(value)))
#define MPU_BWR_RGD0_WORD2_M1UM(base, value) (MPU_WR_RGD0_WORD2_M1UM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGD0_WORD2, field M1SM[10:9] (RW)
 *
 * See M3SM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD2_M1SM field. */
#define MPU_RD_RGD0_WORD2_M1SM(base) ((MPU_RGD0_WORD2_REG(base) & MPU_RGD0_WORD2_M1SM_MASK) >> MPU_RGD0_WORD2_M1SM_SHIFT)
#define MPU_BRD_RGD0_WORD2_M1SM(base) (MPU_RD_RGD0_WORD2_M1SM(base))

/*! @brief Set the M1SM field to a new value. */
#define MPU_WR_RGD0_WORD2_M1SM(base, value) (MPU_RMW_RGD0_WORD2(base, MPU_RGD0_WORD2_M1SM_MASK, MPU_RGD0_WORD2_M1SM(value)))
#define MPU_BWR_RGD0_WORD2_M1SM(base, value) (MPU_WR_RGD0_WORD2_M1SM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGD0_WORD2, field M1PE[11] (RW)
 *
 * See M3PE description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD2_M1PE field. */
#define MPU_RD_RGD0_WORD2_M1PE(base) ((MPU_RGD0_WORD2_REG(base) & MPU_RGD0_WORD2_M1PE_MASK) >> MPU_RGD0_WORD2_M1PE_SHIFT)
#define MPU_BRD_RGD0_WORD2_M1PE(base) (BITBAND_ACCESS32(&MPU_RGD0_WORD2_REG(base), MPU_RGD0_WORD2_M1PE_SHIFT))

/*! @brief Set the M1PE field to a new value. */
#define MPU_WR_RGD0_WORD2_M1PE(base, value) (MPU_RMW_RGD0_WORD2(base, MPU_RGD0_WORD2_M1PE_MASK, MPU_RGD0_WORD2_M1PE(value)))
#define MPU_BWR_RGD0_WORD2_M1PE(base, value) (BITBAND_ACCESS32(&MPU_RGD0_WORD2_REG(base), MPU_RGD0_WORD2_M1PE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGD0_WORD2, field M2UM[14:12] (RW)
 *
 * See M3UM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD2_M2UM field. */
#define MPU_RD_RGD0_WORD2_M2UM(base) ((MPU_RGD0_WORD2_REG(base) & MPU_RGD0_WORD2_M2UM_MASK) >> MPU_RGD0_WORD2_M2UM_SHIFT)
#define MPU_BRD_RGD0_WORD2_M2UM(base) (MPU_RD_RGD0_WORD2_M2UM(base))

/*! @brief Set the M2UM field to a new value. */
#define MPU_WR_RGD0_WORD2_M2UM(base, value) (MPU_RMW_RGD0_WORD2(base, MPU_RGD0_WORD2_M2UM_MASK, MPU_RGD0_WORD2_M2UM(value)))
#define MPU_BWR_RGD0_WORD2_M2UM(base, value) (MPU_WR_RGD0_WORD2_M2UM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGD0_WORD2, field M2SM[16:15] (RW)
 *
 * See M3SM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD2_M2SM field. */
#define MPU_RD_RGD0_WORD2_M2SM(base) ((MPU_RGD0_WORD2_REG(base) & MPU_RGD0_WORD2_M2SM_MASK) >> MPU_RGD0_WORD2_M2SM_SHIFT)
#define MPU_BRD_RGD0_WORD2_M2SM(base) (MPU_RD_RGD0_WORD2_M2SM(base))

/*! @brief Set the M2SM field to a new value. */
#define MPU_WR_RGD0_WORD2_M2SM(base, value) (MPU_RMW_RGD0_WORD2(base, MPU_RGD0_WORD2_M2SM_MASK, MPU_RGD0_WORD2_M2SM(value)))
#define MPU_BWR_RGD0_WORD2_M2SM(base, value) (MPU_WR_RGD0_WORD2_M2SM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGD0_WORD2, field M2PE[17] (RW)
 *
 * See M3PE description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD2_M2PE field. */
#define MPU_RD_RGD0_WORD2_M2PE(base) ((MPU_RGD0_WORD2_REG(base) & MPU_RGD0_WORD2_M2PE_MASK) >> MPU_RGD0_WORD2_M2PE_SHIFT)
#define MPU_BRD_RGD0_WORD2_M2PE(base) (BITBAND_ACCESS32(&MPU_RGD0_WORD2_REG(base), MPU_RGD0_WORD2_M2PE_SHIFT))

/*! @brief Set the M2PE field to a new value. */
#define MPU_WR_RGD0_WORD2_M2PE(base, value) (MPU_RMW_RGD0_WORD2(base, MPU_RGD0_WORD2_M2PE_MASK, MPU_RGD0_WORD2_M2PE(value)))
#define MPU_BWR_RGD0_WORD2_M2PE(base, value) (BITBAND_ACCESS32(&MPU_RGD0_WORD2_REG(base), MPU_RGD0_WORD2_M2PE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGD0_WORD2, field M3UM[20:18] (RW)
 *
 * Defines the access controls for bus master 3 in User mode. M3UM consists of
 * three independent bits, enabling read (r), write (w), and execute (x)
 * permissions.
 *
 * Values:
 * - 0b000 - An attempted access of that mode may be terminated with an access
 *     error (if not allowed by another descriptor) and the access not performed.
 * - 0b001 - Allows the given access type to occur
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD2_M3UM field. */
#define MPU_RD_RGD0_WORD2_M3UM(base) ((MPU_RGD0_WORD2_REG(base) & MPU_RGD0_WORD2_M3UM_MASK) >> MPU_RGD0_WORD2_M3UM_SHIFT)
#define MPU_BRD_RGD0_WORD2_M3UM(base) (MPU_RD_RGD0_WORD2_M3UM(base))

/*! @brief Set the M3UM field to a new value. */
#define MPU_WR_RGD0_WORD2_M3UM(base, value) (MPU_RMW_RGD0_WORD2(base, MPU_RGD0_WORD2_M3UM_MASK, MPU_RGD0_WORD2_M3UM(value)))
#define MPU_BWR_RGD0_WORD2_M3UM(base, value) (MPU_WR_RGD0_WORD2_M3UM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGD0_WORD2, field M3SM[22:21] (RW)
 *
 * Defines the access controls for bus master 3 in Supervisor mode.
 *
 * Values:
 * - 0b00 - r/w/x; read, write and execute allowed
 * - 0b01 - r/x; read and execute allowed, but no write
 * - 0b10 - r/w; read and write allowed, but no execute
 * - 0b11 - Same as User mode defined in M3UM
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD0_WORD2_M3SM field. */
#define MPU_RD_RGD0_WORD2_M3SM(base) ((MPU_RGD0_WORD2_REG(base) & MPU_RGD0_WORD2_M3SM_MASK) >> MPU_RGD0_WORD2_M3SM_SHIFT)
#define MPU_BRD_RGD0_WORD2_M3SM(base) (MPU_RD_RGD0_WORD2_M3SM(base))

