nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * MPU_RGD3_WORD3 - Region Descriptor n, Word 3
 ******************************************************************************/

/*!
 * @brief MPU_RGD3_WORD3 - Region Descriptor n, Word 3 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The fourth word of the region descriptor contains the optional process
 * identifier and mask, plus the region descriptor's valid bit.
 */
/*!
 * @name Constants and macros for entire MPU_RGD3_WORD3 register
 */
/*@{*/
#define MPU_RD_RGD3_WORD3(base)  (MPU_RGD3_WORD3_REG(base))
#define MPU_WR_RGD3_WORD3(base, value) (MPU_RGD3_WORD3_REG(base) = (value))
#define MPU_RMW_RGD3_WORD3(base, mask, value) (MPU_WR_RGD3_WORD3(base, (MPU_RD_RGD3_WORD3(base) & ~(mask)) | (value)))
#define MPU_SET_RGD3_WORD3(base, value) (MPU_WR_RGD3_WORD3(base, MPU_RD_RGD3_WORD3(base) |  (value)))
#define MPU_CLR_RGD3_WORD3(base, value) (MPU_WR_RGD3_WORD3(base, MPU_RD_RGD3_WORD3(base) & ~(value)))
#define MPU_TOG_RGD3_WORD3(base, value) (MPU_WR_RGD3_WORD3(base, MPU_RD_RGD3_WORD3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MPU_RGD3_WORD3 bitfields
 */

/*!
 * @name Register MPU_RGD3_WORD3, field VLD[0] (RW)
 *
 * Signals the region descriptor is valid. Any write to RGDn_WORD0-2 clears this
 * bit.
 *
 * Values:
 * - 0b0 - Region descriptor is invalid
 * - 0b1 - Region descriptor is valid
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD3_WORD3_VLD field. */
#define MPU_RD_RGD3_WORD3_VLD(base) ((MPU_RGD3_WORD3_REG(base) & MPU_RGD3_WORD3_VLD_MASK) >> MPU_RGD3_WORD3_VLD_SHIFT)
#define MPU_BRD_RGD3_WORD3_VLD(base) (BITBAND_ACCESS32(&MPU_RGD3_WORD3_REG(base), MPU_RGD3_WORD3_VLD_SHIFT))

/*! @brief Set the VLD field to a new value. */
#define MPU_WR_RGD3_WORD3_VLD(base, value) (MPU_RMW_RGD3_WORD3(base, MPU_RGD3_WORD3_VLD_MASK, MPU_RGD3_WORD3_VLD(value)))
#define MPU_BWR_RGD3_WORD3_VLD(base, value) (BITBAND_ACCESS32(&MPU_RGD3_WORD3_REG(base), MPU_RGD3_WORD3_VLD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGD3_WORD3, field PIDMASK[23:16] (RW)
 *
 * Provides a masking capability so that multiple process identifiers can be
 * included as part of the region hit determination. If a bit in PIDMASK is set,
 * then the corresponding PID bit is ignored in the comparison. This field and PID
 * are included in the region hit determination if RGDn_WORD2[MxPE] is set. For
 * more information on the handling of the PID and PIDMASK, see "Access Evaluation
 * - Hit Determination."
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD3_WORD3_PIDMASK field. */
#define MPU_RD_RGD3_WORD3_PIDMASK(base) ((MPU_RGD3_WORD3_REG(base) & MPU_RGD3_WORD3_PIDMASK_MASK) >> MPU_RGD3_WORD3_PIDMASK_SHIFT)
#define MPU_BRD_RGD3_WORD3_PIDMASK(base) (MPU_RD_RGD3_WORD3_PIDMASK(base))

/*! @brief Set the PIDMASK field to a new value. */
#define MPU_WR_RGD3_WORD3_PIDMASK(base, value) (MPU_RMW_RGD3_WORD3(base, MPU_RGD3_WORD3_PIDMASK_MASK, MPU_RGD3_WORD3_PIDMASK(value)))
#define MPU_BWR_RGD3_WORD3_PIDMASK(base, value) (MPU_WR_RGD3_WORD3_PIDMASK(base, value))
/*@}*/

/*!
 * @name Register MPU_RGD3_WORD3, field PID[31:24] (RW)
 *
 * Specifies the process identifier that is included in the region hit
 * determination if RGDn_WORD2[MxPE] is set. PIDMASK can mask individual bits in this
 * field.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD3_WORD3_PID field. */
#define MPU_RD_RGD3_WORD3_PID(base) ((MPU_RGD3_WORD3_REG(base) & MPU_RGD3_WORD3_PID_MASK) >> MPU_RGD3_WORD3_PID_SHIFT)
#define MPU_BRD_RGD3_WORD3_PID(base) (MPU_RD_RGD3_WORD3_PID(base))

/*! @brief Set the PID field to a new value. */
#define MPU_WR_RGD3_WORD3_PID(base, value) (MPU_RMW_RGD3_WORD3(base, MPU_RGD3_WORD3_PID_MASK, MPU_RGD3_WORD3_PID(value)))
#define MPU_BWR_RGD3_WORD3_PID(base, value) (MPU_WR_RGD3_WORD3_PID(base, value))
/*@}*/

/*******************************************************************************
 * MPU_RGD4_WORD0 - Region Descriptor n, Word 0
 ******************************************************************************/

/*!
 * @brief MPU_RGD4_WORD0 - Region Descriptor n, Word 0 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The first word of the region descriptor defines the 0-modulo-32 byte start
 * address of the memory region. Writes to this register clear the region
 * descriptor's valid bit (RGDn_WORD3[VLD]).
 */
/*!
 * @name Constants and macros for entire MPU_RGD4_WORD0 register
 */
/*@{*/
#define MPU_RD_RGD4_WORD0(base)  (MPU_RGD4_WORD0_REG(base))
#define MPU_WR_RGD4_WORD0(base, value) (MPU_RGD4_WORD0_REG(base) = (value))
#define MPU_RMW_RGD4_WORD0(base, mask, value) (MPU_WR_RGD4_WORD0(base, (MPU_RD_RGD4_WORD0(base) & ~(mask)) | (value)))
#define MPU_SET_RGD4_WORD0(base, value) (MPU_WR_RGD4_WORD0(base, MPU_RD_RGD4_WORD0(base) |  (value)))
#define MPU_CLR_RGD4_WORD0(base, value) (MPU_WR_RGD4_WORD0(base, MPU_RD_RGD4_WORD0(base) & ~(value)))
#define MPU_TOG_RGD4_WORD0(base, value) (MPU_WR_RGD4_WORD0(base, MPU_RD_RGD4_WORD0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MPU_RGD4_WORD0 bitfields
 */

/*!
 * @name Register MPU_RGD4_WORD0, field SRTADDR[31:5] (RW)
 *
 * Defines the most significant bits of the 0-modulo-32 byte start address of
 * the memory region.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD4_WORD0_SRTADDR field. */
#define MPU_RD_RGD4_WORD0_SRTADDR(base) ((MPU_RGD4_WORD0_REG(base) & MPU_RGD4_WORD0_SRTADDR_MASK) >> MPU_RGD4_WORD0_SRTADDR_SHIFT)
#define MPU_BRD_RGD4_WORD0_SRTADDR(base) (MPU_RD_RGD4_WORD0_SRTADDR(base))

/*! @brief Set the SRTADDR field to a new value. */
#define MPU_WR_RGD4_WORD0_SRTADDR(base, value) (MPU_RMW_RGD4_WORD0(base, MPU_RGD4_WORD0_SRTADDR_MASK, MPU_RGD4_WORD0_SRTADDR(value)))
#define MPU_BWR_RGD4_WORD0_SRTADDR(base, value) (MPU_WR_RGD4_WORD0_SRTADDR(base, value))
/*@}*/

/*******************************************************************************
 * MPU_RGD4_WORD1 - Region Descriptor n, Word 1
 ******************************************************************************/

/*!
 * @brief MPU_RGD4_WORD1 - Region Descriptor n, Word 1 (RW)
 *
 * Reset value: 0x0000001FU
 *
 * The second word of the region descriptor defines the 31-modulo-32 byte end
 * address of the memory region. Writes to this register clear the region
 * descriptor's valid bit (RGDn_WORD3[VLD]).
 */
/*!
 * @name Constants and macros for entire MPU_RGD4_WORD1 register
 */
/*@{*/
#define MPU_RD_RGD4_WORD1(base)  (MPU_RGD4_WORD1_REG(base))
#define MPU_WR_RGD4_WORD1(base, value) (MPU_RGD4_WORD1_REG(base) = (value))
#define MPU_RMW_RGD4_WORD1(base, mask, value) (MPU_WR_RGD4_WORD1(base, (MPU_RD_RGD4_WORD1(base) & ~(mask)) | (value)))
#define MPU_SET_RGD4_WORD1(base, value) (MPU_WR_RGD4_WORD1(base, MPU_RD_RGD4_WORD1(base) |  (value)))
#define MPU_CLR_RGD4_WORD1(base, value) (MPU_WR_RGD4_WORD1(base, MPU_RD_RGD4_WORD1(base) & ~(value)))
#define MPU_TOG_RGD4_WORD1(base, value) (MPU_WR_RGD4_WORD1(base, MPU_RD_RGD4_WORD1(base) ^  (value)))
/*@}*/

