nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * MPU_RGD7_WORD3 - Region Descriptor n, Word 3
 ******************************************************************************/

/*!
 * @brief MPU_RGD7_WORD3 - Region Descriptor n, Word 3 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The fourth word of the region descriptor contains the optional process
 * identifier and mask, plus the region descriptor's valid bit.
 */
/*!
 * @name Constants and macros for entire MPU_RGD7_WORD3 register
 */
/*@{*/
#define MPU_RD_RGD7_WORD3(base)  (MPU_RGD7_WORD3_REG(base))
#define MPU_WR_RGD7_WORD3(base, value) (MPU_RGD7_WORD3_REG(base) = (value))
#define MPU_RMW_RGD7_WORD3(base, mask, value) (MPU_WR_RGD7_WORD3(base, (MPU_RD_RGD7_WORD3(base) & ~(mask)) | (value)))
#define MPU_SET_RGD7_WORD3(base, value) (MPU_WR_RGD7_WORD3(base, MPU_RD_RGD7_WORD3(base) |  (value)))
#define MPU_CLR_RGD7_WORD3(base, value) (MPU_WR_RGD7_WORD3(base, MPU_RD_RGD7_WORD3(base) & ~(value)))
#define MPU_TOG_RGD7_WORD3(base, value) (MPU_WR_RGD7_WORD3(base, MPU_RD_RGD7_WORD3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MPU_RGD7_WORD3 bitfields
 */

/*!
 * @name Register MPU_RGD7_WORD3, field VLD[0] (RW)
 *
 * Signals the region descriptor is valid. Any write to RGDn_WORD0-2 clears this
 * bit.
 *
 * Values:
 * - 0b0 - Region descriptor is invalid
 * - 0b1 - Region descriptor is valid
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD7_WORD3_VLD field. */
#define MPU_RD_RGD7_WORD3_VLD(base) ((MPU_RGD7_WORD3_REG(base) & MPU_RGD7_WORD3_VLD_MASK) >> MPU_RGD7_WORD3_VLD_SHIFT)
#define MPU_BRD_RGD7_WORD3_VLD(base) (BITBAND_ACCESS32(&MPU_RGD7_WORD3_REG(base), MPU_RGD7_WORD3_VLD_SHIFT))

/*! @brief Set the VLD field to a new value. */
#define MPU_WR_RGD7_WORD3_VLD(base, value) (MPU_RMW_RGD7_WORD3(base, MPU_RGD7_WORD3_VLD_MASK, MPU_RGD7_WORD3_VLD(value)))
#define MPU_BWR_RGD7_WORD3_VLD(base, value) (BITBAND_ACCESS32(&MPU_RGD7_WORD3_REG(base), MPU_RGD7_WORD3_VLD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGD7_WORD3, field PIDMASK[23:16] (RW)
 *
 * Provides a masking capability so that multiple process identifiers can be
 * included as part of the region hit determination. If a bit in PIDMASK is set,
 * then the corresponding PID bit is ignored in the comparison. This field and PID
 * are included in the region hit determination if RGDn_WORD2[MxPE] is set. For
 * more information on the handling of the PID and PIDMASK, see "Access Evaluation
 * - Hit Determination."
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD7_WORD3_PIDMASK field. */
#define MPU_RD_RGD7_WORD3_PIDMASK(base) ((MPU_RGD7_WORD3_REG(base) & MPU_RGD7_WORD3_PIDMASK_MASK) >> MPU_RGD7_WORD3_PIDMASK_SHIFT)
#define MPU_BRD_RGD7_WORD3_PIDMASK(base) (MPU_RD_RGD7_WORD3_PIDMASK(base))

/*! @brief Set the PIDMASK field to a new value. */
#define MPU_WR_RGD7_WORD3_PIDMASK(base, value) (MPU_RMW_RGD7_WORD3(base, MPU_RGD7_WORD3_PIDMASK_MASK, MPU_RGD7_WORD3_PIDMASK(value)))
#define MPU_BWR_RGD7_WORD3_PIDMASK(base, value) (MPU_WR_RGD7_WORD3_PIDMASK(base, value))
/*@}*/

/*!
 * @name Register MPU_RGD7_WORD3, field PID[31:24] (RW)
 *
 * Specifies the process identifier that is included in the region hit
 * determination if RGDn_WORD2[MxPE] is set. PIDMASK can mask individual bits in this
 * field.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGD7_WORD3_PID field. */
#define MPU_RD_RGD7_WORD3_PID(base) ((MPU_RGD7_WORD3_REG(base) & MPU_RGD7_WORD3_PID_MASK) >> MPU_RGD7_WORD3_PID_SHIFT)
#define MPU_BRD_RGD7_WORD3_PID(base) (MPU_RD_RGD7_WORD3_PID(base))

/*! @brief Set the PID field to a new value. */
#define MPU_WR_RGD7_WORD3_PID(base, value) (MPU_RMW_RGD7_WORD3(base, MPU_RGD7_WORD3_PID_MASK, MPU_RGD7_WORD3_PID(value)))
#define MPU_BWR_RGD7_WORD3_PID(base, value) (MPU_WR_RGD7_WORD3_PID(base, value))
/*@}*/

/*******************************************************************************
 * MPU_RGDAAC0 - Region Descriptor Alternate Access Control n
 ******************************************************************************/

/*!
 * @brief MPU_RGDAAC0 - Region Descriptor Alternate Access Control n (RW)
 *
 * Reset value: 0x00000000U
 *
 * Because software may adjust only the access controls within a region
 * descriptor (RGDn_WORD2) as different tasks execute, an alternate programming view of
 * this 32-bit entity is available. Writing to this register does not affect the
 * descriptor's valid bit.
 */
/*!
 * @name Constants and macros for entire MPU_RGDAAC0 register
 */
/*@{*/
#define MPU_RD_RGDAAC0(base)     (MPU_RGDAAC0_REG(base))
#define MPU_WR_RGDAAC0(base, value) (MPU_RGDAAC0_REG(base) = (value))
#define MPU_RMW_RGDAAC0(base, mask, value) (MPU_WR_RGDAAC0(base, (MPU_RD_RGDAAC0(base) & ~(mask)) | (value)))
#define MPU_SET_RGDAAC0(base, value) (MPU_WR_RGDAAC0(base, MPU_RD_RGDAAC0(base) |  (value)))
#define MPU_CLR_RGDAAC0(base, value) (MPU_WR_RGDAAC0(base, MPU_RD_RGDAAC0(base) & ~(value)))
#define MPU_TOG_RGDAAC0(base, value) (MPU_WR_RGDAAC0(base, MPU_RD_RGDAAC0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MPU_RGDAAC0 bitfields
 */

/*!
 * @name Register MPU_RGDAAC0, field M0UM[2:0] (RW)
 *
 * See M3UM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M0UM field. */
#define MPU_RD_RGDAAC0_M0UM(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M0UM_MASK) >> MPU_RGDAAC0_M0UM_SHIFT)
#define MPU_BRD_RGDAAC0_M0UM(base) (MPU_RD_RGDAAC0_M0UM(base))

/*! @brief Set the M0UM field to a new value. */
#define MPU_WR_RGDAAC0_M0UM(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M0UM_MASK, MPU_RGDAAC0_M0UM(value)))
#define MPU_BWR_RGDAAC0_M0UM(base, value) (MPU_WR_RGDAAC0_M0UM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M0SM[4:3] (RW)
 *
 * See M3SM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M0SM field. */
#define MPU_RD_RGDAAC0_M0SM(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M0SM_MASK) >> MPU_RGDAAC0_M0SM_SHIFT)
#define MPU_BRD_RGDAAC0_M0SM(base) (MPU_RD_RGDAAC0_M0SM(base))

/*! @brief Set the M0SM field to a new value. */
#define MPU_WR_RGDAAC0_M0SM(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M0SM_MASK, MPU_RGDAAC0_M0SM(value)))
#define MPU_BWR_RGDAAC0_M0SM(base, value) (MPU_WR_RGDAAC0_M0SM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M0PE[5] (RW)
 *
 * See M3PE description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M0PE field. */
#define MPU_RD_RGDAAC0_M0PE(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M0PE_MASK) >> MPU_RGDAAC0_M0PE_SHIFT)
#define MPU_BRD_RGDAAC0_M0PE(base) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M0PE_SHIFT))

