nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the M0PE field to a new value. */
#define MPU_WR_RGDAAC0_M0PE(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M0PE_MASK, MPU_RGDAAC0_M0PE(value)))
#define MPU_BWR_RGDAAC0_M0PE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M0PE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M1UM[8:6] (RW)
 *
 * See M3UM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M1UM field. */
#define MPU_RD_RGDAAC0_M1UM(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M1UM_MASK) >> MPU_RGDAAC0_M1UM_SHIFT)
#define MPU_BRD_RGDAAC0_M1UM(base) (MPU_RD_RGDAAC0_M1UM(base))

/*! @brief Set the M1UM field to a new value. */
#define MPU_WR_RGDAAC0_M1UM(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M1UM_MASK, MPU_RGDAAC0_M1UM(value)))
#define MPU_BWR_RGDAAC0_M1UM(base, value) (MPU_WR_RGDAAC0_M1UM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M1SM[10:9] (RW)
 *
 * See M3SM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M1SM field. */
#define MPU_RD_RGDAAC0_M1SM(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M1SM_MASK) >> MPU_RGDAAC0_M1SM_SHIFT)
#define MPU_BRD_RGDAAC0_M1SM(base) (MPU_RD_RGDAAC0_M1SM(base))

/*! @brief Set the M1SM field to a new value. */
#define MPU_WR_RGDAAC0_M1SM(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M1SM_MASK, MPU_RGDAAC0_M1SM(value)))
#define MPU_BWR_RGDAAC0_M1SM(base, value) (MPU_WR_RGDAAC0_M1SM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M1PE[11] (RW)
 *
 * See M3PE description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M1PE field. */
#define MPU_RD_RGDAAC0_M1PE(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M1PE_MASK) >> MPU_RGDAAC0_M1PE_SHIFT)
#define MPU_BRD_RGDAAC0_M1PE(base) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M1PE_SHIFT))

/*! @brief Set the M1PE field to a new value. */
#define MPU_WR_RGDAAC0_M1PE(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M1PE_MASK, MPU_RGDAAC0_M1PE(value)))
#define MPU_BWR_RGDAAC0_M1PE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M1PE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M2UM[14:12] (RW)
 *
 * See M3UM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M2UM field. */
#define MPU_RD_RGDAAC0_M2UM(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M2UM_MASK) >> MPU_RGDAAC0_M2UM_SHIFT)
#define MPU_BRD_RGDAAC0_M2UM(base) (MPU_RD_RGDAAC0_M2UM(base))

/*! @brief Set the M2UM field to a new value. */
#define MPU_WR_RGDAAC0_M2UM(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M2UM_MASK, MPU_RGDAAC0_M2UM(value)))
#define MPU_BWR_RGDAAC0_M2UM(base, value) (MPU_WR_RGDAAC0_M2UM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M2SM[16:15] (RW)
 *
 * See M3SM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M2SM field. */
#define MPU_RD_RGDAAC0_M2SM(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M2SM_MASK) >> MPU_RGDAAC0_M2SM_SHIFT)
#define MPU_BRD_RGDAAC0_M2SM(base) (MPU_RD_RGDAAC0_M2SM(base))

/*! @brief Set the M2SM field to a new value. */
#define MPU_WR_RGDAAC0_M2SM(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M2SM_MASK, MPU_RGDAAC0_M2SM(value)))
#define MPU_BWR_RGDAAC0_M2SM(base, value) (MPU_WR_RGDAAC0_M2SM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M2PE[17] (RW)
 *
 * See M3PE description.
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M2PE field. */
#define MPU_RD_RGDAAC0_M2PE(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M2PE_MASK) >> MPU_RGDAAC0_M2PE_SHIFT)
#define MPU_BRD_RGDAAC0_M2PE(base) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M2PE_SHIFT))

/*! @brief Set the M2PE field to a new value. */
#define MPU_WR_RGDAAC0_M2PE(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M2PE_MASK, MPU_RGDAAC0_M2PE(value)))
#define MPU_BWR_RGDAAC0_M2PE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M2PE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M3UM[20:18] (RW)
 *
 * Defines the access controls for bus master 3 in user mode. M3UM consists of
 * three independent bits, enabling read (r), write (w), and execute (x)
 * permissions. The bit assignment sequence is as M3UM[2:0] -> rwx.
 *
 * Values:
 * - 0b000 - An attempted access of that mode may be terminated with an access
 *     error (if not allowed by another descriptor) and the access not performed.
 * - 0b001 - Allows the given access type to occur
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M3UM field. */
#define MPU_RD_RGDAAC0_M3UM(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M3UM_MASK) >> MPU_RGDAAC0_M3UM_SHIFT)
#define MPU_BRD_RGDAAC0_M3UM(base) (MPU_RD_RGDAAC0_M3UM(base))

/*! @brief Set the M3UM field to a new value. */
#define MPU_WR_RGDAAC0_M3UM(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M3UM_MASK, MPU_RGDAAC0_M3UM(value)))
#define MPU_BWR_RGDAAC0_M3UM(base, value) (MPU_WR_RGDAAC0_M3UM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M3SM[22:21] (RW)
 *
 * Defines the access controls for bus master 3 in Supervisor mode.
 *
 * Values:
 * - 0b00 - r/w/x; read, write and execute allowed
 * - 0b01 - r/x; read and execute allowed, but no write
 * - 0b10 - r/w; read and write allowed, but no execute
 * - 0b11 - Same as User mode defined in M3UM
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M3SM field. */
#define MPU_RD_RGDAAC0_M3SM(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M3SM_MASK) >> MPU_RGDAAC0_M3SM_SHIFT)
#define MPU_BRD_RGDAAC0_M3SM(base) (MPU_RD_RGDAAC0_M3SM(base))

/*! @brief Set the M3SM field to a new value. */
#define MPU_WR_RGDAAC0_M3SM(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M3SM_MASK, MPU_RGDAAC0_M3SM(value)))
#define MPU_BWR_RGDAAC0_M3SM(base, value) (MPU_WR_RGDAAC0_M3SM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M3PE[23] (RW)
 *
 * Values:
 * - 0b0 - Do not include the process identifier in the evaluation
 * - 0b1 - Include the process identifier and mask (RGDn.RGDAAC) in the region
 *     hit evaluation
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M3PE field. */
#define MPU_RD_RGDAAC0_M3PE(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M3PE_MASK) >> MPU_RGDAAC0_M3PE_SHIFT)
#define MPU_BRD_RGDAAC0_M3PE(base) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M3PE_SHIFT))

/*! @brief Set the M3PE field to a new value. */
#define MPU_WR_RGDAAC0_M3PE(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M3PE_MASK, MPU_RGDAAC0_M3PE(value)))
#define MPU_BWR_RGDAAC0_M3PE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M3PE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M4WE[24] (RW)
 *
 * Values:
 * - 0b0 - Bus master 4 writes terminate with an access error and the write is
 *     not performed
 * - 0b1 - Bus master 4 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M4WE field. */
#define MPU_RD_RGDAAC0_M4WE(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M4WE_MASK) >> MPU_RGDAAC0_M4WE_SHIFT)
#define MPU_BRD_RGDAAC0_M4WE(base) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M4WE_SHIFT))

/*! @brief Set the M4WE field to a new value. */
#define MPU_WR_RGDAAC0_M4WE(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M4WE_MASK, MPU_RGDAAC0_M4WE(value)))
#define MPU_BWR_RGDAAC0_M4WE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M4WE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M4RE[25] (RW)
 *
 * Values:
 * - 0b0 - Bus master 4 reads terminate with an access error and the read is not
 *     performed
 * - 0b1 - Bus master 4 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M4RE field. */
#define MPU_RD_RGDAAC0_M4RE(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M4RE_MASK) >> MPU_RGDAAC0_M4RE_SHIFT)
#define MPU_BRD_RGDAAC0_M4RE(base) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M4RE_SHIFT))

/*! @brief Set the M4RE field to a new value. */
#define MPU_WR_RGDAAC0_M4RE(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M4RE_MASK, MPU_RGDAAC0_M4RE(value)))
#define MPU_BWR_RGDAAC0_M4RE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M4RE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M5WE[26] (RW)
 *
 * Values:
 * - 0b0 - Bus master 5 writes terminate with an access error and the write is
 *     not performed
 * - 0b1 - Bus master 5 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M5WE field. */
#define MPU_RD_RGDAAC0_M5WE(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M5WE_MASK) >> MPU_RGDAAC0_M5WE_SHIFT)
#define MPU_BRD_RGDAAC0_M5WE(base) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M5WE_SHIFT))

/*! @brief Set the M5WE field to a new value. */
#define MPU_WR_RGDAAC0_M5WE(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M5WE_MASK, MPU_RGDAAC0_M5WE(value)))
#define MPU_BWR_RGDAAC0_M5WE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M5WE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M5RE[27] (RW)
 *
 * Values:
 * - 0b0 - Bus master 5 reads terminate with an access error and the read is not
 *     performed
 * - 0b1 - Bus master 5 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M5RE field. */
#define MPU_RD_RGDAAC0_M5RE(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M5RE_MASK) >> MPU_RGDAAC0_M5RE_SHIFT)
#define MPU_BRD_RGDAAC0_M5RE(base) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M5RE_SHIFT))

/*! @brief Set the M5RE field to a new value. */
#define MPU_WR_RGDAAC0_M5RE(base, value) (MPU_RMW_RGDAAC0(base, MPU_RGDAAC0_M5RE_MASK, MPU_RGDAAC0_M5RE(value)))
#define MPU_BWR_RGDAAC0_M5RE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M5RE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC0, field M6WE[28] (RW)
 *
 * Values:
 * - 0b0 - Bus master 6 writes terminate with an access error and the write is
 *     not performed
 * - 0b1 - Bus master 6 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC0_M6WE field. */
#define MPU_RD_RGDAAC0_M6WE(base) ((MPU_RGDAAC0_REG(base) & MPU_RGDAAC0_M6WE_MASK) >> MPU_RGDAAC0_M6WE_SHIFT)
#define MPU_BRD_RGDAAC0_M6WE(base) (BITBAND_ACCESS32(&MPU_RGDAAC0_REG(base), MPU_RGDAAC0_M6WE_SHIFT))

