nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the M3SM field to a new value. */
#define MPU_WR_RGDAAC2_M3SM(base, value) (MPU_RMW_RGDAAC2(base, MPU_RGDAAC2_M3SM_MASK, MPU_RGDAAC2_M3SM(value)))
#define MPU_BWR_RGDAAC2_M3SM(base, value) (MPU_WR_RGDAAC2_M3SM(base, value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC2, field M3PE[23] (RW)
 *
 * Values:
 * - 0b0 - Do not include the process identifier in the evaluation
 * - 0b1 - Include the process identifier and mask (RGDn.RGDAAC) in the region
 *     hit evaluation
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC2_M3PE field. */
#define MPU_RD_RGDAAC2_M3PE(base) ((MPU_RGDAAC2_REG(base) & MPU_RGDAAC2_M3PE_MASK) >> MPU_RGDAAC2_M3PE_SHIFT)
#define MPU_BRD_RGDAAC2_M3PE(base) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M3PE_SHIFT))

/*! @brief Set the M3PE field to a new value. */
#define MPU_WR_RGDAAC2_M3PE(base, value) (MPU_RMW_RGDAAC2(base, MPU_RGDAAC2_M3PE_MASK, MPU_RGDAAC2_M3PE(value)))
#define MPU_BWR_RGDAAC2_M3PE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M3PE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC2, field M4WE[24] (RW)
 *
 * Values:
 * - 0b0 - Bus master 4 writes terminate with an access error and the write is
 *     not performed
 * - 0b1 - Bus master 4 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC2_M4WE field. */
#define MPU_RD_RGDAAC2_M4WE(base) ((MPU_RGDAAC2_REG(base) & MPU_RGDAAC2_M4WE_MASK) >> MPU_RGDAAC2_M4WE_SHIFT)
#define MPU_BRD_RGDAAC2_M4WE(base) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M4WE_SHIFT))

/*! @brief Set the M4WE field to a new value. */
#define MPU_WR_RGDAAC2_M4WE(base, value) (MPU_RMW_RGDAAC2(base, MPU_RGDAAC2_M4WE_MASK, MPU_RGDAAC2_M4WE(value)))
#define MPU_BWR_RGDAAC2_M4WE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M4WE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC2, field M4RE[25] (RW)
 *
 * Values:
 * - 0b0 - Bus master 4 reads terminate with an access error and the read is not
 *     performed
 * - 0b1 - Bus master 4 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC2_M4RE field. */
#define MPU_RD_RGDAAC2_M4RE(base) ((MPU_RGDAAC2_REG(base) & MPU_RGDAAC2_M4RE_MASK) >> MPU_RGDAAC2_M4RE_SHIFT)
#define MPU_BRD_RGDAAC2_M4RE(base) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M4RE_SHIFT))

/*! @brief Set the M4RE field to a new value. */
#define MPU_WR_RGDAAC2_M4RE(base, value) (MPU_RMW_RGDAAC2(base, MPU_RGDAAC2_M4RE_MASK, MPU_RGDAAC2_M4RE(value)))
#define MPU_BWR_RGDAAC2_M4RE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M4RE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC2, field M5WE[26] (RW)
 *
 * Values:
 * - 0b0 - Bus master 5 writes terminate with an access error and the write is
 *     not performed
 * - 0b1 - Bus master 5 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC2_M5WE field. */
#define MPU_RD_RGDAAC2_M5WE(base) ((MPU_RGDAAC2_REG(base) & MPU_RGDAAC2_M5WE_MASK) >> MPU_RGDAAC2_M5WE_SHIFT)
#define MPU_BRD_RGDAAC2_M5WE(base) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M5WE_SHIFT))

/*! @brief Set the M5WE field to a new value. */
#define MPU_WR_RGDAAC2_M5WE(base, value) (MPU_RMW_RGDAAC2(base, MPU_RGDAAC2_M5WE_MASK, MPU_RGDAAC2_M5WE(value)))
#define MPU_BWR_RGDAAC2_M5WE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M5WE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC2, field M5RE[27] (RW)
 *
 * Values:
 * - 0b0 - Bus master 5 reads terminate with an access error and the read is not
 *     performed
 * - 0b1 - Bus master 5 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC2_M5RE field. */
#define MPU_RD_RGDAAC2_M5RE(base) ((MPU_RGDAAC2_REG(base) & MPU_RGDAAC2_M5RE_MASK) >> MPU_RGDAAC2_M5RE_SHIFT)
#define MPU_BRD_RGDAAC2_M5RE(base) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M5RE_SHIFT))

/*! @brief Set the M5RE field to a new value. */
#define MPU_WR_RGDAAC2_M5RE(base, value) (MPU_RMW_RGDAAC2(base, MPU_RGDAAC2_M5RE_MASK, MPU_RGDAAC2_M5RE(value)))
#define MPU_BWR_RGDAAC2_M5RE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M5RE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC2, field M6WE[28] (RW)
 *
 * Values:
 * - 0b0 - Bus master 6 writes terminate with an access error and the write is
 *     not performed
 * - 0b1 - Bus master 6 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC2_M6WE field. */
#define MPU_RD_RGDAAC2_M6WE(base) ((MPU_RGDAAC2_REG(base) & MPU_RGDAAC2_M6WE_MASK) >> MPU_RGDAAC2_M6WE_SHIFT)
#define MPU_BRD_RGDAAC2_M6WE(base) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M6WE_SHIFT))

/*! @brief Set the M6WE field to a new value. */
#define MPU_WR_RGDAAC2_M6WE(base, value) (MPU_RMW_RGDAAC2(base, MPU_RGDAAC2_M6WE_MASK, MPU_RGDAAC2_M6WE(value)))
#define MPU_BWR_RGDAAC2_M6WE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M6WE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC2, field M6RE[29] (RW)
 *
 * Values:
 * - 0b0 - Bus master 6 reads terminate with an access error and the read is not
 *     performed
 * - 0b1 - Bus master 6 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC2_M6RE field. */
#define MPU_RD_RGDAAC2_M6RE(base) ((MPU_RGDAAC2_REG(base) & MPU_RGDAAC2_M6RE_MASK) >> MPU_RGDAAC2_M6RE_SHIFT)
#define MPU_BRD_RGDAAC2_M6RE(base) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M6RE_SHIFT))

/*! @brief Set the M6RE field to a new value. */
#define MPU_WR_RGDAAC2_M6RE(base, value) (MPU_RMW_RGDAAC2(base, MPU_RGDAAC2_M6RE_MASK, MPU_RGDAAC2_M6RE(value)))
#define MPU_BWR_RGDAAC2_M6RE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M6RE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC2, field M7WE[30] (RW)
 *
 * Values:
 * - 0b0 - Bus master 7 writes terminate with an access error and the write is
 *     not performed
 * - 0b1 - Bus master 7 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC2_M7WE field. */
#define MPU_RD_RGDAAC2_M7WE(base) ((MPU_RGDAAC2_REG(base) & MPU_RGDAAC2_M7WE_MASK) >> MPU_RGDAAC2_M7WE_SHIFT)
#define MPU_BRD_RGDAAC2_M7WE(base) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M7WE_SHIFT))

/*! @brief Set the M7WE field to a new value. */
#define MPU_WR_RGDAAC2_M7WE(base, value) (MPU_RMW_RGDAAC2(base, MPU_RGDAAC2_M7WE_MASK, MPU_RGDAAC2_M7WE(value)))
#define MPU_BWR_RGDAAC2_M7WE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M7WE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MPU_RGDAAC2, field M7RE[31] (RW)
 *
 * Values:
 * - 0b0 - Bus master 7 reads terminate with an access error and the read is not
 *     performed
 * - 0b1 - Bus master 7 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC2_M7RE field. */
#define MPU_RD_RGDAAC2_M7RE(base) ((MPU_RGDAAC2_REG(base) & MPU_RGDAAC2_M7RE_MASK) >> MPU_RGDAAC2_M7RE_SHIFT)
#define MPU_BRD_RGDAAC2_M7RE(base) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M7RE_SHIFT))

/*! @brief Set the M7RE field to a new value. */
#define MPU_WR_RGDAAC2_M7RE(base, value) (MPU_RMW_RGDAAC2(base, MPU_RGDAAC2_M7RE_MASK, MPU_RGDAAC2_M7RE(value)))
#define MPU_BWR_RGDAAC2_M7RE(base, value) (BITBAND_ACCESS32(&MPU_RGDAAC2_REG(base), MPU_RGDAAC2_M7RE_SHIFT) = (value))
/*@}*/

