nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * S32K144 MSCM
 *
 * MSCM
 *
 * Registers defined in this header file:
 * - MSCM_CPxTYPE - Processor X Type Register
 * - MSCM_CPxNUM - Processor X Number Register
 * - MSCM_CPxMASTER - Processor X Master Register
 * - MSCM_CPxCOUNT - Processor X Count Register
 * - MSCM_CPxCFG - Processor X Configuration Register
 * - MSCM_CP0TYPE - Processor 0 Type Register
 * - MSCM_CP0NUM - Processor 0 Number Register
 * - MSCM_CP0MASTER - Processor 0 Master Register
 * - MSCM_CP0COUNT - Processor 0 Count Register
 * - MSCM_CP0CFG - Processor 0 Configuration Register
 * - MSCM_OCMDR - On-Chip Memory Descriptor Register
 */

#define MSCM_INSTANCE_COUNT (1U) /*!< Number of instances of the MSCM module. */
#define MSCM_IDX (0U) /*!< Instance number for MSCM. */

/*******************************************************************************
 * MSCM_CPxTYPE - Processor X Type Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxTYPE - Processor X Type Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the personality of
 * the core making the access. The 32 bit response includes 3 ASCII characters
 * defining the CPU type along with a byte defining the logical revision number. The
 * logical revision number follows ARM's rYpZ nomenclature.
 */
/*!
 * @name Constants and macros for entire MSCM_CPxTYPE register
 */
/*@{*/
#define MSCM_RD_CPxTYPE(base)    (MSCM_CPxTYPE_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxTYPE bitfields
 */

/*!
 * @name Register MSCM_CPxTYPE, field RYPZ[7:0] (RO)
 *
 * This read-only field defines the processor revision for CPx: 0x01 corresponds
 * to the r0p1 core release. ...
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxTYPE_RYPZ field. */
#define MSCM_RD_CPxTYPE_RYPZ(base) ((MSCM_CPxTYPE_REG(base) & MSCM_CPxTYPE_RYPZ_MASK) >> MSCM_CPxTYPE_RYPZ_SHIFT)
#define MSCM_BRD_CPxTYPE_RYPZ(base) (MSCM_RD_CPxTYPE_RYPZ(base))
/*@}*/

/*!
 * @name Register MSCM_CPxTYPE, field PERSONALITY[31:8] (RO)
 *
 * This read-only field defines the processor personality for CPx if CPx =
 * Cortex-M4, then PERSONALITY = 0x43_4D_34 ("CM4").
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxTYPE_PERSONALITY field. */
#define MSCM_RD_CPxTYPE_PERSONALITY(base) ((MSCM_CPxTYPE_REG(base) & MSCM_CPxTYPE_PERSONALITY_MASK) >> MSCM_CPxTYPE_PERSONALITY_SHIFT)
#define MSCM_BRD_CPxTYPE_PERSONALITY(base) (MSCM_RD_CPxTYPE_PERSONALITY(base))
/*@}*/

/*******************************************************************************
 * MSCM_CPxNUM - Processor X Number Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxNUM - Processor X Number Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the logical
 * processor number of the core making the access. In single processor configurations,
 * the logical processor number is always zero.
 */
/*!
 * @name Constants and macros for entire MSCM_CPxNUM register
 */
/*@{*/
#define MSCM_RD_CPxNUM(base)     (MSCM_CPxNUM_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxNUM bitfields
 */

/*!
 * @name Register MSCM_CPxNUM, field CPN[0] (RO)
 *
 * This zero-filled word defines the logical processor number for CPx If single
 * core configuration, then CPN = 0.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxNUM_CPN field. */
#define MSCM_RD_CPxNUM_CPN(base) ((MSCM_CPxNUM_REG(base) & MSCM_CPxNUM_CPN_MASK) >> MSCM_CPxNUM_CPN_SHIFT)
#define MSCM_BRD_CPxNUM_CPN(base) (BITBAND_ACCESS32(&MSCM_CPxNUM_REG(base), MSCM_CPxNUM_CPN_SHIFT))
/*@}*/

/*******************************************************************************
 * MSCM_CPxMASTER - Processor X Master Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxMASTER - Processor X Master Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the physical bus
 * master number the core making the access. The 32 bit response defines the
 * physical master number for processor x. A privileged read from the CM4 returns the
 * appropriate processor information. Reads from any other bus master return all
 * zeroes. Attempted user mode or write accesses are terminated with an error.
 */
/*!
 * @name Constants and macros for entire MSCM_CPxMASTER register
 */
/*@{*/
#define MSCM_RD_CPxMASTER(base)  (MSCM_CPxMASTER_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxMASTER bitfields
 */

/*!
 * @name Register MSCM_CPxMASTER, field PPN[5:0] (RO)
 *
 * This read-only field defines the physical port number for CPUx. For single
 * core (CPU0), PPN = 0x00.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxMASTER_PPN field. */
#define MSCM_RD_CPxMASTER_PPN(base) ((MSCM_CPxMASTER_REG(base) & MSCM_CPxMASTER_PPN_MASK) >> MSCM_CPxMASTER_PPN_SHIFT)
#define MSCM_BRD_CPxMASTER_PPN(base) (MSCM_RD_CPxMASTER_PPN(base))
/*@}*/

/*******************************************************************************
 * MSCM_CPxCOUNT - Processor X Count Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxCOUNT - Processor X Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the total number of
 * processor cores in the chip configuration.
 */
/*!
 * @name Constants and macros for entire MSCM_CPxCOUNT register
 */
/*@{*/
#define MSCM_RD_CPxCOUNT(base)   (MSCM_CPxCOUNT_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxCOUNT bitfields
 */

/*!
 * @name Register MSCM_CPxCOUNT, field PCNT[1:0] (RO)
 *
 * This read-only field defines the processor count for the chip configuration:
 * If single core configuration, then PCNT = 00.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxCOUNT_PCNT field. */
#define MSCM_RD_CPxCOUNT_PCNT(base) ((MSCM_CPxCOUNT_REG(base) & MSCM_CPxCOUNT_PCNT_MASK) >> MSCM_CPxCOUNT_PCNT_SHIFT)
#define MSCM_BRD_CPxCOUNT_PCNT(base) (MSCM_RD_CPxCOUNT_PCNT(base))
/*@}*/

