nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * MSCM_CPxCFG - Processor X Configuration Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxCFG - Processor X Configuration Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * will MA512 contain L1 caches??The register provides information on the Level
 * 1 caches (if present).
 */
/*!
 * @name Constants and macros for entire MSCM_CPxCFG register
 */
/*@{*/
#define MSCM_RD_CPxCFG(base, index) (MSCM_CPxCFG_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxCFG bitfields
 */

/*!
 * @name Register MSCM_CPxCFG, field ICSZ[31:24] (RO)
 *
 * This read-only field provides an encoded value of the Instruction Cache size.
 * The capacity of the memory is expressed as Size [bytes] = 2(9+SZ), where SZ
 * is non-zero; a SZ = 0 indicates the memory is not present. if no Instruction
 * Cache, then ICSZ = 0x00 if a 4 Kbyte Instruction Cache, then ICSZ = 0x03 if an 8
 * Kbyte Instruction Cache, then ICSZ = 0x04 if a 16 Kbyte Instruction Cache,
 * then ICSZ = 0x05 if a 32 Kbyte Instruction Cache, then ICSZ = 0x06 if a 64 Kbyte
 * Instruction Cache, then ICSZ = 0x07 if a 128 Kbyte Instruction Cache, then
 * ICSZ = 0x08 if a 256 Kbyte Instruction Cache, then ICSZ = 0x09 if a 512 Kbyte
 * Instruction Cache, then ICSZ = 0x0A
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxCFG_ICSZ field. */
#define MSCM_RD_CPxCFG_ICSZ(base, index) ((MSCM_CPxCFG_REG(base, index) & MSCM_CPxCFG_ICSZ_MASK) >> MSCM_CPxCFG_ICSZ_SHIFT)
#define MSCM_BRD_CPxCFG_ICSZ(base, index) (MSCM_RD_CPxCFG_ICSZ(base, index))
/*@}*/

/*******************************************************************************
 * MSCM_CP0TYPE - Processor 0 Type Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0TYPE - Processor 0 Type Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the personality of
 * the core making the access. The 32 bit response includes 3 ASCII characters
 * defining the CPU type along with a byte defining the logical revision number. The
 * logical revision number follows ARM's rYpZ nomenclature.
 */
/*!
 * @name Constants and macros for entire MSCM_CP0TYPE register
 */
/*@{*/
#define MSCM_RD_CP0TYPE(base)    (MSCM_CP0TYPE_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0TYPE bitfields
 */

/*!
 * @name Register MSCM_CP0TYPE, field RYPZ[7:0] (RO)
 *
 * This read-only field defines the processor revision for CPx: 0x01 corresponds
 * to the r0p1 core release. ...
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0TYPE_RYPZ field. */
#define MSCM_RD_CP0TYPE_RYPZ(base) ((MSCM_CP0TYPE_REG(base) & MSCM_CP0TYPE_RYPZ_MASK) >> MSCM_CP0TYPE_RYPZ_SHIFT)
#define MSCM_BRD_CP0TYPE_RYPZ(base) (MSCM_RD_CP0TYPE_RYPZ(base))
/*@}*/

/*!
 * @name Register MSCM_CP0TYPE, field PERSONALITY[31:8] (RO)
 *
 * This read-only field defines the processor personality for CPx if CPx =
 * Cortex-M4, then PERSONALITY = 0x43_4D_34 ("CM4").
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0TYPE_PERSONALITY field. */
#define MSCM_RD_CP0TYPE_PERSONALITY(base) ((MSCM_CP0TYPE_REG(base) & MSCM_CP0TYPE_PERSONALITY_MASK) >> MSCM_CP0TYPE_PERSONALITY_SHIFT)
#define MSCM_BRD_CP0TYPE_PERSONALITY(base) (MSCM_RD_CP0TYPE_PERSONALITY(base))
/*@}*/

/*******************************************************************************
 * MSCM_CP0NUM - Processor 0 Number Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0NUM - Processor 0 Number Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the logical
 * processor number of the core making the access. In single processor configurations,
 * the logical processor number is always zero.
 */
/*!
 * @name Constants and macros for entire MSCM_CP0NUM register
 */
/*@{*/
#define MSCM_RD_CP0NUM(base)     (MSCM_CP0NUM_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0NUM bitfields
 */

/*!
 * @name Register MSCM_CP0NUM, field CPN[0] (RO)
 *
 * This zero-filled word defines the logical processor number for CPx If single
 * core configuration, then CPN = 0
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0NUM_CPN field. */
#define MSCM_RD_CP0NUM_CPN(base) ((MSCM_CP0NUM_REG(base) & MSCM_CP0NUM_CPN_MASK) >> MSCM_CP0NUM_CPN_SHIFT)
#define MSCM_BRD_CP0NUM_CPN(base) (BITBAND_ACCESS32(&MSCM_CP0NUM_REG(base), MSCM_CP0NUM_CPN_SHIFT))
/*@}*/

/*******************************************************************************
 * MSCM_CP0MASTER - Processor 0 Master Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0MASTER - Processor 0 Master Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the physical bus
 * master number the core making the access. The 32 bit response defines the
 * physical master number for processor x. A privileged read from the CA5 or the CM4
 * returns the appropriate processor information. Reads from any other bus master
 * return all zeroes. Attempted user mode or write accesses are terminated with an
 * error.
 */
/*!
 * @name Constants and macros for entire MSCM_CP0MASTER register
 */
/*@{*/
#define MSCM_RD_CP0MASTER(base)  (MSCM_CP0MASTER_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0MASTER bitfields
 */

/*!
 * @name Register MSCM_CP0MASTER, field PPN[5:0] (RO)
 *
 * This read-only field defines the physical port number for CPUx. For CPU0, PPN
 * = 0x00
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0MASTER_PPN field. */
#define MSCM_RD_CP0MASTER_PPN(base) ((MSCM_CP0MASTER_REG(base) & MSCM_CP0MASTER_PPN_MASK) >> MSCM_CP0MASTER_PPN_SHIFT)
#define MSCM_BRD_CP0MASTER_PPN(base) (MSCM_RD_CP0MASTER_PPN(base))
/*@}*/

