nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * MSCM_CP0COUNT - Processor 0 Count Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0COUNT - Processor 0 Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the total number of
 * processor cores in the chip configuration.
 */
/*!
 * @name Constants and macros for entire MSCM_CP0COUNT register
 */
/*@{*/
#define MSCM_RD_CP0COUNT(base)   (MSCM_CP0COUNT_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0COUNT bitfields
 */

/*!
 * @name Register MSCM_CP0COUNT, field PCNT[1:0] (RO)
 *
 * This read-only field defines the processor count for the chip configuration:
 * If single core configuration, then PCNT = 00
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0COUNT_PCNT field. */
#define MSCM_RD_CP0COUNT_PCNT(base) ((MSCM_CP0COUNT_REG(base) & MSCM_CP0COUNT_PCNT_MASK) >> MSCM_CP0COUNT_PCNT_SHIFT)
#define MSCM_BRD_CP0COUNT_PCNT(base) (MSCM_RD_CP0COUNT_PCNT(base))
/*@}*/

/*******************************************************************************
 * MSCM_CP0CFG - Processor 0 Configuration Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0CFG - Processor 0 Configuration Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides information on the Level 1 caches (if present).
 */
/*!
 * @name Constants and macros for entire MSCM_CP0CFG register
 */
/*@{*/
#define MSCM_RD_CP0CFG(base, index) (MSCM_CP0CFG_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0CFG bitfields
 */

/*!
 * @name Register MSCM_CP0CFG, field ICSZ[31:24] (RO)
 *
 * This read-only field provides an encoded value of the Instruction Cache size.
 * The capacity of the memory is expressed as Size [bytes] = 2(9+SZ), where SZ
 * is non-zero; a SZ = 0 indicates the memory is not present. if no Instruction
 * Cache, then ICSZ = 0x00 if a 4 Kbyte Instruction Cache, then ICSZ = 0x03 if an 8
 * Kbyte Instruction Cache, then ICSZ = 0x04 if a 16 Kbyte Instruction Cache,
 * then ICSZ = 0x05 if a 32 Kbyte Instruction Cache, then ICSZ = 0x06 if a 64 Kbyte
 * Instruction Cache, then ICSZ = 0x07 if a 128 Kbyte Instruction Cache, then
 * ICSZ = 0x08 if a 256 Kbyte Instruction Cache, then ICSZ = 0x09 if a 512 Kbyte
 * Instruction Cache, then ICSZ = 0x0A
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0CFG_ICSZ field. */
#define MSCM_RD_CP0CFG_ICSZ(base, index) ((MSCM_CP0CFG_REG(base, index) & MSCM_CP0CFG_ICSZ_MASK) >> MSCM_CP0CFG_ICSZ_SHIFT)
#define MSCM_BRD_CP0CFG_ICSZ(base, index) (MSCM_RD_CP0CFG_ICSZ(base, index))
/*@}*/

/*******************************************************************************
 * MSCM_OCMDR - On-Chip Memory Descriptor Register
 ******************************************************************************/

/*!
 * @brief MSCM_OCMDR - On-Chip Memory Descriptor Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This section of the programming model is an array of 32-bit generic on-chip
 * memory descriptor registers that provide static information on the attached
 * memories as well as configurable controls (where appropriate). Privileged 32-bit
 * reads from a processor core or the debugger return the appropriate processor
 * information. Reads from any other bus master return all zeroes. Privileged
 * writes from a processor core or the debugger to writeable registers update the
 * appropriate fields. Privileged writes from other bus masters are ignored.
 * Attempted user mode accesses or any access with a size other than 32 bits are
 * terminated with an error.
 */
/*!
 * @name Constants and macros for entire MSCM_OCMDR register
 */
/*@{*/
#define MSCM_RD_OCMDR(base, index) (MSCM_OCMDR_REG(base, index))
#define MSCM_WR_OCMDR(base, index, value) (MSCM_OCMDR_REG(base, index) = (value))
#define MSCM_RMW_OCMDR(base, index, mask, value) (MSCM_WR_OCMDR(base, index, (MSCM_RD_OCMDR(base, index) & ~(mask)) | (value)))
#define MSCM_SET_OCMDR(base, index, value) (MSCM_WR_OCMDR(base, index, MSCM_RD_OCMDR(base, index) |  (value)))
#define MSCM_CLR_OCMDR(base, index, value) (MSCM_WR_OCMDR(base, index, MSCM_RD_OCMDR(base, index) & ~(value)))
#define MSCM_TOG_OCMDR(base, index, value) (MSCM_WR_OCMDR(base, index, MSCM_RD_OCMDR(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MSCM_OCMDR bitfields
 */

/*!
 * @name Register MSCM_OCMDR, field OCMC0[3:0] (RW)
 *
 * OCMEM Control Field 0. This 4-bit field (if used) defines the configuration
 * of the on-chip memory. The field's functionality is dependent on the OCMT value.
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMC0 field. */
#define MSCM_RD_OCMDR_OCMC0(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMC0_MASK) >> MSCM_OCMDR_OCMC0_SHIFT)
#define MSCM_BRD_OCMDR_OCMC0(base, index) (MSCM_RD_OCMDR_OCMC0(base, index))

/*! @brief Set the OCMC0 field to a new value. */
#define MSCM_WR_OCMDR_OCMC0(base, index, value) (MSCM_RMW_OCMDR(base, index, MSCM_OCMDR_OCMC0_MASK, MSCM_OCMDR_OCMC0(value)))
#define MSCM_BWR_OCMDR_OCMC0(base, index, value) (MSCM_WR_OCMDR_OCMC0(base, index, value))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMC1[7:4] (RW)
 *
 * OCMEM Control Field 1. This 4-bit field (if used) defines the configuration
 * of the on-chip memory. The field's functionality is dependent on the OCMT
 * value. OCMDR0[5] or OCMDR1[5] bit controls whether prefetches (or speculative
 * accesses) are initiated in response to instruction fetches or data references, see
 * Speculative reads.
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMC1 field. */
#define MSCM_RD_OCMDR_OCMC1(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMC1_MASK) >> MSCM_OCMDR_OCMC1_SHIFT)
#define MSCM_BRD_OCMDR_OCMC1(base, index) (MSCM_RD_OCMDR_OCMC1(base, index))

/*! @brief Set the OCMC1 field to a new value. */
#define MSCM_WR_OCMDR_OCMC1(base, index, value) (MSCM_RMW_OCMDR(base, index, MSCM_OCMDR_OCMC1_MASK, MSCM_OCMDR_OCMC1(value)))
#define MSCM_BWR_OCMDR_OCMC1(base, index, value) (MSCM_WR_OCMDR_OCMC1(base, index, value))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMC2[11:8] (RW)
 *
 * OCMEM Control Field 2. This 4-bit field (if used) defines the configuration
 * of the on-chip memory. The field's functionality is dependent on the OCMT value.
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMC2 field. */
#define MSCM_RD_OCMDR_OCMC2(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMC2_MASK) >> MSCM_OCMDR_OCMC2_SHIFT)
#define MSCM_BRD_OCMDR_OCMC2(base, index) (MSCM_RD_OCMDR_OCMC2(base, index))

/*! @brief Set the OCMC2 field to a new value. */
#define MSCM_WR_OCMDR_OCMC2(base, index, value) (MSCM_RMW_OCMDR(base, index, MSCM_OCMDR_OCMC2_MASK, MSCM_OCMDR_OCMC2(value)))
#define MSCM_BWR_OCMDR_OCMC2(base, index, value) (MSCM_WR_OCMDR_OCMC2(base, index, value))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMPU[12] (RO)
 *
 * OCMEM Memory Protection Unit. This read-only field identifies a memory
 * protected by a Memory Protection Unit.
 *
 * Values:
 * - 0b0 - OCMEMn is not protected by an MPU.
 * - 0b1 - OCMEMn is protected by an MPU.
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMPU field. */
#define MSCM_RD_OCMDR_OCMPU(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMPU_MASK) >> MSCM_OCMDR_OCMPU_SHIFT)
#define MSCM_BRD_OCMDR_OCMPU(base, index) (BITBAND_ACCESS32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_OCMPU_SHIFT))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMT[15:13] (RO)
 *
 * OCMEM Type. This field defines the type of the on-chip memory:
 *
 * Values:
 * - 0b000 - Reserved
 * - 0b001 - Reserved
 * - 0b010 - Reserved
 * - 0b011 - OCMEMn is a ROM.
 * - 0b100 - OCMEMn is a program flash.
 * - 0b101 - OCMEMn is a data flash.
 * - 0b110 - OCMEMn is an EEE.
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMT field. */
#define MSCM_RD_OCMDR_OCMT(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMT_MASK) >> MSCM_OCMDR_OCMT_SHIFT)
#define MSCM_BRD_OCMDR_OCMT(base, index) (MSCM_RD_OCMDR_OCMT(base, index))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field RO[16] (RO)
 *
 * Read-Only. This register bit provides a mechanism to "lock" the configuration
 * state defined by OCMDRn[11:0]. Once asserted, attempted writes to the
 * OCMDRn[11:0] register are ignored until the next reset clears the flag.
 *
 * Values:
 * - 0b0 - writes to the OCMDRn[11:0] are allowed
 * - 0b1 - writes to the OCMDRn[11:0] are ignored
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_RO field. */
#define MSCM_RD_OCMDR_RO(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_RO_MASK) >> MSCM_OCMDR_RO_SHIFT)
#define MSCM_BRD_OCMDR_RO(base, index) (BITBAND_ACCESS32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_RO_SHIFT))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMW[19:17] (RO)
 *
 * OCMEM datapath Width. This read-only field defines the width of the on-chip
 * memory:
 *
 * Values:
 * - 0b010 - OCMEMn 32-bits wide
 * - 0b011 - OCMEMn 64-bits wide
 * - 0b100 - OCMEMn 128-bits wide
 * - 0b101 - OCMEMn 256-bits wide
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMW field. */
#define MSCM_RD_OCMDR_OCMW(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMW_MASK) >> MSCM_OCMDR_OCMW_SHIFT)
#define MSCM_BRD_OCMDR_OCMW(base, index) (MSCM_RD_OCMDR_OCMW(base, index))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMSZ[27:24] (RO)
 *
 * OCMEM Size. This read-only field provides an encoded value of the on-chip
 * memory size. The capacity of the memory is expressed as Size [bytes] = 2(9+SZ)
 * where SZ is non-zero; a SZ = 0 indicates the memory is not present.
 *
 * Values:
 * - 0b0000 - no OCMEMn
 * - 0b0011 - 4KB OCMEMn
 * - 0b0100 - 8KB OCMEMn
 * - 0b0101 - 16KB OCMEMn
 * - 0b0110 - 32KB OCMEMn
 * - 0b0111 - 64KB OCMEMn
 * - 0b1000 - 128KB OCMEMn
 * - 0b1001 - 256KB OCMEMn
 * - 0b1010 - 512KB OCMEMn
 * - 0b1011 - 1024KB OCMEMn
 * - 0b1100 - 2048KB OCMEMn
 * - 0b1101 - 4096KB OCMEMn
 * - 0b1110 - 8192KB OCMEMn
 * - 0b1111 - 16384KB OCMEMn
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMSZ field. */
#define MSCM_RD_OCMDR_OCMSZ(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMSZ_MASK) >> MSCM_OCMDR_OCMSZ_SHIFT)
#define MSCM_BRD_OCMDR_OCMSZ(base, index) (MSCM_RD_OCMDR_OCMSZ(base, index))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMSZH[28] (RO)
 *
 * OCMEM Size "Hole". For on-chip memories that are not fully populated, that
 * is, include a memory "hole" in the upper 25% of the address range, this bit is
 * used.
 *
 * Values:
 * - 0b0 - OCMEMn is a power-of-2 capacity.
 * - 0b1 - OCMEMn is not a power-of-2, with a capacity is 0.75 * OCMSZ.
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMSZH field. */
#define MSCM_RD_OCMDR_OCMSZH(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMSZH_MASK) >> MSCM_OCMDR_OCMSZH_SHIFT)
#define MSCM_BRD_OCMDR_OCMSZH(base, index) (BITBAND_ACCESS32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_OCMSZH_SHIFT))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field V[31] (RO)
 *
 * OCMEM Valid bit. This read-only field defines the validity (presence) of the
 * on-chip memory
 *
 * Values:
 * - 0b0 - OCMEMn is not present.
 * - 0b1 - OCMEMn is present.
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_V field. */
#define MSCM_RD_OCMDR_V(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_V_MASK) >> MSCM_OCMDR_V_SHIFT)
#define MSCM_BRD_OCMDR_V(base, index) (BITBAND_ACCESS32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_V_SHIFT))
/*@}*/

