nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * S32K144 OSC32
 *
 * RTC Oscillator
 *
 * Registers defined in this header file:
 * - OSC32_CR - RTC Oscillator Control Register
 */

#define OSC32_INSTANCE_COUNT (1U) /*!< Number of instances of the OSC32 module. */
#define OSC32_IDX (0U) /*!< Instance number for OSC32. */

/*******************************************************************************
 * OSC32_CR - RTC Oscillator Control Register
 ******************************************************************************/

/*!
 * @brief OSC32_CR - RTC Oscillator Control Register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire OSC32_CR register
 */
/*@{*/
#define OSC32_RD_CR(base)        (OSC32_CR_REG(base))
#define OSC32_WR_CR(base, value) (OSC32_CR_REG(base) = (value))
#define OSC32_RMW_CR(base, mask, value) (OSC32_WR_CR(base, (OSC32_RD_CR(base) & ~(mask)) | (value)))
#define OSC32_SET_CR(base, value) (OSC32_WR_CR(base, OSC32_RD_CR(base) |  (value)))
#define OSC32_CLR_CR(base, value) (OSC32_WR_CR(base, OSC32_RD_CR(base) & ~(value)))
#define OSC32_TOG_CR(base, value) (OSC32_WR_CR(base, OSC32_RD_CR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual OSC32_CR bitfields
 */

/*!
 * @name Register OSC32_CR, field ROSCEREFS[4] (RW)
 *
 * Values:
 * - 0b0 - Bypass mode. RTC oscillator selects the external 32k clock.
 * - 0b1 - Crystal mode.
 */
/*@{*/
/*! @brief Read current value of the OSC32_CR_ROSCEREFS field. */
#define OSC32_RD_CR_ROSCEREFS(base) ((OSC32_CR_REG(base) & OSC32_CR_ROSCEREFS_MASK) >> OSC32_CR_ROSCEREFS_SHIFT)
#define OSC32_BRD_CR_ROSCEREFS(base) (BITBAND_ACCESS8(&OSC32_CR_REG(base), OSC32_CR_ROSCEREFS_SHIFT))

/*! @brief Set the ROSCEREFS field to a new value. */
#define OSC32_WR_CR_ROSCEREFS(base, value) (OSC32_RMW_CR(base, OSC32_CR_ROSCEREFS_MASK, OSC32_CR_ROSCEREFS(value)))
#define OSC32_BWR_CR_ROSCEREFS(base, value) (BITBAND_ACCESS8(&OSC32_CR_REG(base), OSC32_CR_ROSCEREFS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register OSC32_CR, field ROSCSTB[5] (RO)
 *
 * This flag indicates when using the crystal mode if the oscillator has started
 * up stably after 4096 cycles.
 *
 * Values:
 * - 0b0 - RTC 32k oscillator is unstable now and no clock will go out of the
 *     block.
 * - 0b1 - RTC 32k oscillator is stable.
 */
/*@{*/
/*! @brief Read current value of the OSC32_CR_ROSCSTB field. */
#define OSC32_RD_CR_ROSCSTB(base) ((OSC32_CR_REG(base) & OSC32_CR_ROSCSTB_MASK) >> OSC32_CR_ROSCSTB_SHIFT)
#define OSC32_BRD_CR_ROSCSTB(base) (BITBAND_ACCESS8(&OSC32_CR_REG(base), OSC32_CR_ROSCSTB_SHIFT))
/*@}*/

/*!
 * @name Register OSC32_CR, field ROSCSTPEN[6] (RW)
 *
 * This bit is used to enable the RTC 32k VLP Oscillator in stop mode together
 * with ROSCEN bitfield.
 *
 * Values:
 * - 0b0 - Oscillator is disabled regardless the state of ROSCEN.
 * - 0b1 - Oscillator is enabled in Stop mode when ROSCEN is set.
 */
/*@{*/
/*! @brief Read current value of the OSC32_CR_ROSCSTPEN field. */
#define OSC32_RD_CR_ROSCSTPEN(base) ((OSC32_CR_REG(base) & OSC32_CR_ROSCSTPEN_MASK) >> OSC32_CR_ROSCSTPEN_SHIFT)
#define OSC32_BRD_CR_ROSCSTPEN(base) (BITBAND_ACCESS8(&OSC32_CR_REG(base), OSC32_CR_ROSCSTPEN_SHIFT))

/*! @brief Set the ROSCSTPEN field to a new value. */
#define OSC32_WR_CR_ROSCSTPEN(base, value) (OSC32_RMW_CR(base, OSC32_CR_ROSCSTPEN_MASK, OSC32_CR_ROSCSTPEN(value)))
#define OSC32_BWR_CR_ROSCSTPEN(base, value) (BITBAND_ACCESS8(&OSC32_CR_REG(base), OSC32_CR_ROSCSTPEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register OSC32_CR, field ROSCEN[7] (RW)
 *
 * This bit is used to enable the RTC 32k VLP Oscillator.
 *
 * Values:
 * - 0b0 - Oscillator is disabled.
 * - 0b1 - Oscillator is enabled.
 */
/*@{*/
/*! @brief Read current value of the OSC32_CR_ROSCEN field. */
#define OSC32_RD_CR_ROSCEN(base) ((OSC32_CR_REG(base) & OSC32_CR_ROSCEN_MASK) >> OSC32_CR_ROSCEN_SHIFT)
#define OSC32_BRD_CR_ROSCEN(base) (BITBAND_ACCESS8(&OSC32_CR_REG(base), OSC32_CR_ROSCEN_SHIFT))

/*! @brief Set the ROSCEN field to a new value. */
#define OSC32_WR_CR_ROSCEN(base, value) (OSC32_RMW_CR(base, OSC32_CR_ROSCEN_MASK, OSC32_CR_ROSCEN(value)))
#define OSC32_BWR_CR_ROSCEN(base, value) (BITBAND_ACCESS8(&OSC32_CR_REG(base), OSC32_CR_ROSCEN_SHIFT) = (value))
/*@}*/

/*
 * S32K144 PCC
 *
 * PCC
 *
 * Registers defined in this header file:
 * - PCC_IP - PCC Register
 */

#define PCC_INSTANCE_COUNT (1U) /*!< Number of instances of the PCC module. */
#define PCC_IDX (0U) /*!< Instance number for PCC. */

/*******************************************************************************
 * PCC_IP - PCC Register
 ******************************************************************************/

/*!
 * @brief PCC_IP - PCC Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * PCC Register
 */
/*!
 * @name Constants and macros for entire PCC_IP register
 */
/*@{*/
#define PCC_RD_IP(base, index)   (PCC_IP_REG(base, index))
#define PCC_WR_IP(base, index, value) (PCC_IP_REG(base, index) = (value))
#define PCC_RMW_IP(base, index, mask, value) (PCC_WR_IP(base, index, (PCC_RD_IP(base, index) & ~(mask)) | (value)))

/*@}*/

/*
 * Constants & macros for individual PCC_IP bitfields
 */

/*!
 * @name Register PCC_IP, field PCD[2:0] (RW)
 *
 * This read/write bit field is used for peripherals that require a clock
 * divider. At SOC integration, each peripheral is assigned either a divider or
 * not.This field can only be written when the CGC bit is 0 (clock disabled). Likewise,
 * if the INUSE flag is set, this field is locked.
 *
 * Values:
 * - 0b000 - Divide by 1 (pass-through, no clock divide).
 * - 0b001 - Divide by 2.
 * - 0b010 - Divide by 3.
 * - 0b011 - Divide by 4.
 * - 0b100 - Divide by 5.
 * - 0b101 - Divide by 6.
 * - 0b110 - Divide by 7.
 * - 0b111 - Divide by 8.
 */
/*@{*/
/*! @brief Read current value of the PCC_IP_PCD field. */
#define PCC_RD_IP_PCD(base, index) ((PCC_IP_REG(base, index) & PCC_IP_PCD_MASK) >> PCC_IP_PCD_SHIFT)
#define PCC_BRD_IP_PCD(base, index) (PCC_RD_IP_PCD(base, index))

