nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the PCD field to a new value. */
#define PCC_WR_IP_PCD(base, index, value) (PCC_RMW_IP(base, index, PCC_IP_PCD_MASK, PCC_IP_PCD(value)))
#define PCC_BWR_IP_PCD(base, index, value) (PCC_WR_IP_PCD(base, index, value))
/*@}*/

/*!
 * @name Register PCC_IP, field FRAC[3] (RW)
 *
 * This read/write bit field sets the fraction multiply value for the fractional
 * clock divider used as a clock source. Divider output clock = Divider input
 * clock x [(FRAC+1)/(DIV+1)].This field can only be written when the CGC bit is 0
 * (clock disabled). Likewise, if the INUSE flag is set, this field is locked.
 *
 * Values:
 * - 0b0 - Fractional value is 0.
 * - 0b1 - Fractional value is 1.
 */
/*@{*/
/*! @brief Read current value of the PCC_IP_FRAC field. */
#define PCC_RD_IP_FRAC(base, index) ((PCC_IP_REG(base, index) & PCC_IP_FRAC_MASK) >> PCC_IP_FRAC_SHIFT)
#define PCC_BRD_IP_FRAC(base, index) (BITBAND_ACCESS32(&PCC_IP_REG(base, index), PCC_IP_FRAC_SHIFT))

/*! @brief Set the FRAC field to a new value. */
#define PCC_WR_IP_FRAC(base, index, value) (PCC_RMW_IP(base, index, PCC_IP_FRAC_MASK, PCC_IP_FRAC(value)))
#define PCC_BWR_IP_FRAC(base, index, value) (BITBAND_ACCESS32(&PCC_IP_REG(base, index), PCC_IP_FRAC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PCC_IP, field PCS[26:24] (RW)
 *
 * This read/write bit field is used for peripherals that support various clock
 * selections.This field can only be written when the CGC bit is 0 (clock
 * disabled). Likewise, if the INUSE flag is set, this field is locked.
 *
 * Values:
 * - 0b000 - Clock is off (or test clock is enabled) An external clock can be
 *     enabled for this peripheral.
 * - 0b001 - OSCCLK - System Oscillator Platform Clock(scg_sosc_plat_clk).
 * - 0b010 - SCGIRCLK - Slow IRC Clock(scg_sirc_plat_clk), (maximum is 8MHz).
 * - 0b011 - SCGFIRCLK - Fast IRC Clock(scg_firc_plat_clk), (maximum is 48MHz).
 * - 0b100 - Reserved.
 * - 0b101 - Reserved.
 * - 0b110 - SCGPCLK System PLL clock (scg_spll_plat_clk).
 * - 0b111 - Reserved.
 */
/*@{*/
/*! @brief Read current value of the PCC_IP_PCS field. */
#define PCC_RD_IP_PCS(base, index) ((PCC_IP_REG(base, index) & PCC_IP_PCS_MASK) >> PCC_IP_PCS_SHIFT)
#define PCC_BRD_IP_PCS(base, index) (PCC_RD_IP_PCS(base, index))

/*! @brief Set the PCS field to a new value. */
#define PCC_WR_IP_PCS(base, index, value) (PCC_RMW_IP(base, index, PCC_IP_PCS_MASK, PCC_IP_PCS(value)))
#define PCC_BWR_IP_PCS(base, index, value) (PCC_WR_IP_PCS(base, index, value))
/*@}*/

/*!
 * @name Register PCC_IP, field INUSE[29] (RO)
 *
 * This read-only bit shows that this peripheral is already in use by another
 * core. That is, software on another core has already configured the clocking
 * options of this peripheral. For example, if CPU0 software has set this
 * peripheral's CGC bit first, it sees the INUSE bit as cleared. However, if software on
 * another core has set this peripheral's CGC bit first, CPU0 software sees the
 * INUSE bit as set.
 *
 * Values:
 * - 0b0 - Another core is not using this peripheral.
 * - 0b1 - Another core is using this peripheral. Software cannot modify the
 *     existing clocking configuration.
 */
/*@{*/
/*! @brief Read current value of the PCC_IP_INUSE field. */
#define PCC_RD_IP_INUSE(base, index) ((PCC_IP_REG(base, index) & PCC_IP_INUSE_MASK) >> PCC_IP_INUSE_SHIFT)
#define PCC_BRD_IP_INUSE(base, index) (BITBAND_ACCESS32(&PCC_IP_REG(base, index), PCC_IP_INUSE_SHIFT))
/*@}*/

/*!
 * @name Register PCC_IP, field CGC[30] (RW)
 *
 * This read/write bit enables the clock for the peripheral.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the PCC_IP_CGC field. */
#define PCC_RD_IP_CGC(base, index) ((PCC_IP_REG(base, index) & PCC_IP_CGC_MASK) >> PCC_IP_CGC_SHIFT)
#define PCC_BRD_IP_CGC(base, index) (BITBAND_ACCESS32(&PCC_IP_REG(base, index), PCC_IP_CGC_SHIFT))

/*! @brief Set the CGC field to a new value. */
#define PCC_WR_IP_CGC(base, index, value) (PCC_RMW_IP(base, index, PCC_IP_CGC_MASK, PCC_IP_CGC(value)))
#define PCC_BWR_IP_CGC(base, index, value) (BITBAND_ACCESS32(&PCC_IP_REG(base, index), PCC_IP_CGC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PCC_IP, field PR[31] (RO)
 *
 * This bit shows whether the peripheral is present on this device.
 *
 * Values:
 * - 0b0 - Peripheral is not present.
 * - 0b1 - Peripheral is present.
 */
/*@{*/
/*! @brief Read current value of the PCC_IP_PR field. */
#define PCC_RD_IP_PR(base, index) ((PCC_IP_REG(base, index) & PCC_IP_PR_MASK) >> PCC_IP_PR_SHIFT)
#define PCC_BRD_IP_PR(base, index) (BITBAND_ACCESS32(&PCC_IP_REG(base, index), PCC_IP_PR_SHIFT))
/*@}*/

/*
 * S32K144 PDB
 *
 * Programmable Delay Block
 *
 * Registers defined in this header file:
 * - PDB_SC - Status and Control register
 * - PDB_MOD - Modulus register
 * - PDB_CNT - Counter register
 * - PDB_IDLY - Interrupt Delay register
 * - PDB_CH0C1 - Channel n Control register 1
 * - PDB_CH0S - Channel n Status register
 * - PDB_CH0DLY0 - Channel n Delay 0 register
 * - PDB_CH0DLY1 - Channel n Delay 1 register
 * - PDB_CH0DLY2 - Channel n Delay 2 register
 * - PDB_CH0DLY3 - Channel n Delay 3 register
 * - PDB_CH0DLY4 - Channel n Delay 4 register
 * - PDB_CH0DLY5 - Channel n Delay 5 register
 * - PDB_CH0DLY6 - Channel n Delay 6 register
 * - PDB_CH0DLY7 - Channel n Delay 7 register
 * - PDB_CH1C1 - Channel n Control register 1
 * - PDB_CH1S - Channel n Status register
 * - PDB_CH1DLY0 - Channel n Delay 0 register
 * - PDB_CH1DLY1 - Channel n Delay 1 register
 * - PDB_CH1DLY2 - Channel n Delay 2 register
 * - PDB_CH1DLY3 - Channel n Delay 3 register
 * - PDB_CH1DLY4 - Channel n Delay 4 register
 * - PDB_CH1DLY5 - Channel n Delay 5 register
 * - PDB_CH1DLY6 - Channel n Delay 6 register
 * - PDB_CH1DLY7 - Channel n Delay 7 register
 * - PDB_POEN - Pulse-Out n Enable register
 * - PDB_PODLY - Pulse-Out n Delay register
 */

#define PDB_INSTANCE_COUNT (2U) /*!< Number of instances of the PDB module. */
#define PDB0_IDX (0U) /*!< Instance number for PDB0. */
#define PDB1_IDX (1U) /*!< Instance number for PDB1. */

