nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual PDB_IDLY bitfields
 */

/*!
 * @name Register PDB_IDLY, field IDLY[15:0] (RW)
 *
 * Specifies the delay value to schedule the PDB interrupt. It can be used to
 * schedule an independent interrupt at some point in the PDB cycle. If enabled, a
 * PDB interrupt is generated, when the counter is equal to the IDLY. Reading
 * this field returns the value of internal register that is effective for the
 * current cycle of the PDB.
 */
/*@{*/
/*! @brief Read current value of the PDB_IDLY_IDLY field. */
#define PDB_RD_IDLY_IDLY(base) ((PDB_IDLY_REG(base) & PDB_IDLY_IDLY_MASK) >> PDB_IDLY_IDLY_SHIFT)
#define PDB_BRD_IDLY_IDLY(base) (PDB_RD_IDLY_IDLY(base))

/*! @brief Set the IDLY field to a new value. */
#define PDB_WR_IDLY_IDLY(base, value) (PDB_RMW_IDLY(base, PDB_IDLY_IDLY_MASK, PDB_IDLY_IDLY(value)))
#define PDB_BWR_IDLY_IDLY(base, value) (PDB_WR_IDLY_IDLY(base, value))
/*@}*/

/*******************************************************************************
 * PDB_CH0C1 - Channel n Control register 1
 ******************************************************************************/

/*!
 * @brief PDB_CH0C1 - Channel n Control register 1 (RW)
 *
 * Reset value: 0x00000000U
 *
 * Each PDB channel has one control register, CHnC1. The bits in this register
 * control the functionality of each PDB channel operation.
 */
/*!
 * @name Constants and macros for entire PDB_CH0C1 register
 */
/*@{*/
#define PDB_RD_CH0C1(base)       (PDB_CH0C1_REG(base))
#define PDB_WR_CH0C1(base, value) (PDB_CH0C1_REG(base) = (value))
#define PDB_RMW_CH0C1(base, mask, value) (PDB_WR_CH0C1(base, (PDB_RD_CH0C1(base) & ~(mask)) | (value)))
#define PDB_SET_CH0C1(base, value) (PDB_WR_CH0C1(base, PDB_RD_CH0C1(base) |  (value)))
#define PDB_CLR_CH0C1(base, value) (PDB_WR_CH0C1(base, PDB_RD_CH0C1(base) & ~(value)))
#define PDB_TOG_CH0C1(base, value) (PDB_WR_CH0C1(base, PDB_RD_CH0C1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CH0C1 bitfields
 */

/*!
 * @name Register PDB_CH0C1, field EN[7:0] (RW)
 *
 * These bits enable the PDB ADC pre-trigger outputs. Only lower M pre-trigger
 * bits are implemented in this MCU.
 *
 * Values:
 * - 0b00000000 - PDB channel's corresponding pre-trigger disabled.
 * - 0b00000001 - PDB channel's corresponding pre-trigger enabled.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH0C1_EN field. */
#define PDB_RD_CH0C1_EN(base) ((PDB_CH0C1_REG(base) & PDB_CH0C1_EN_MASK) >> PDB_CH0C1_EN_SHIFT)
#define PDB_BRD_CH0C1_EN(base) (PDB_RD_CH0C1_EN(base))

/*! @brief Set the EN field to a new value. */
#define PDB_WR_CH0C1_EN(base, value) (PDB_RMW_CH0C1(base, PDB_CH0C1_EN_MASK, PDB_CH0C1_EN(value)))
#define PDB_BWR_CH0C1_EN(base, value) (PDB_WR_CH0C1_EN(base, value))
/*@}*/

/*!
 * @name Register PDB_CH0C1, field TOS[15:8] (RW)
 *
 * Selects the PDB ADC pre-trigger outputs. Only lower M pre-trigger fields are
 * implemented in this MCU.
 *
 * Values:
 * - 0b00000000 - PDB channel's corresponding pre-trigger is in bypassed mode.
 *     The pre-trigger asserts one peripheral clock cycle after a rising edge is
 *     detected on selected trigger input source or software trigger is selected
 *     and SWTRIG is written with 1.
 * - 0b00000001 - PDB channel's corresponding pre-trigger asserts when the
 *     counter reaches the channel delay register and one peripheral clock cycle after
 *     a rising edge is detected on selected trigger input source or software
 *     trigger is selected and SETRIG is written with 1.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH0C1_TOS field. */
#define PDB_RD_CH0C1_TOS(base) ((PDB_CH0C1_REG(base) & PDB_CH0C1_TOS_MASK) >> PDB_CH0C1_TOS_SHIFT)
#define PDB_BRD_CH0C1_TOS(base) (PDB_RD_CH0C1_TOS(base))

/*! @brief Set the TOS field to a new value. */
#define PDB_WR_CH0C1_TOS(base, value) (PDB_RMW_CH0C1(base, PDB_CH0C1_TOS_MASK, PDB_CH0C1_TOS(value)))
#define PDB_BWR_CH0C1_TOS(base, value) (PDB_WR_CH0C1_TOS(base, value))
/*@}*/

/*!
 * @name Register PDB_CH0C1, field BB[23:16] (RW)
 *
 * These bits enable the PDB ADC pre-trigger operation as back-to-back mode.
 * Only lower M pre-trigger bits are implemented in this MCU. Back-to-back operation
 * enables the ADC conversions complete to trigger the next PDB channel
 * pre-trigger and trigger output, so that the ADC conversions can be triggered on next
 * set of configuration and results registers. Application code must only enable
 * the back-to-back operation of the PDB pre-triggers at the leading of the
 * back-to-back connection chain.
 *
 * Values:
 * - 0b00000000 - PDB channel's corresponding pre-trigger back-to-back operation
 *     disabled.
 * - 0b00000001 - PDB channel's corresponding pre-trigger back-to-back operation
 *     enabled.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH0C1_BB field. */
#define PDB_RD_CH0C1_BB(base) ((PDB_CH0C1_REG(base) & PDB_CH0C1_BB_MASK) >> PDB_CH0C1_BB_SHIFT)
#define PDB_BRD_CH0C1_BB(base) (PDB_RD_CH0C1_BB(base))

/*! @brief Set the BB field to a new value. */
#define PDB_WR_CH0C1_BB(base, value) (PDB_RMW_CH0C1(base, PDB_CH0C1_BB_MASK, PDB_CH0C1_BB(value)))
#define PDB_BWR_CH0C1_BB(base, value) (PDB_WR_CH0C1_BB(base, value))
/*@}*/

/*******************************************************************************
 * PDB_CH0S - Channel n Status register
 ******************************************************************************/

/*!
 * @brief PDB_CH0S - Channel n Status register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CH0S register
 */
/*@{*/
#define PDB_RD_CH0S(base)        (PDB_CH0S_REG(base))
#define PDB_WR_CH0S(base, value) (PDB_CH0S_REG(base) = (value))
#define PDB_RMW_CH0S(base, mask, value) (PDB_WR_CH0S(base, (PDB_RD_CH0S(base) & ~(mask)) | (value)))
#define PDB_SET_CH0S(base, value) (PDB_WR_CH0S(base, PDB_RD_CH0S(base) |  (value)))
#define PDB_CLR_CH0S(base, value) (PDB_WR_CH0S(base, PDB_RD_CH0S(base) & ~(value)))
#define PDB_TOG_CH0S(base, value) (PDB_WR_CH0S(base, PDB_RD_CH0S(base) ^  (value)))
/*@}*/

