nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual PDB_CH0S bitfields
 */

/*!
 * @name Register PDB_CH0S, field ERR[7:0] (RW)
 *
 * Only the lower M bits are implemented in this MCU.
 *
 * Values:
 * - 0b00000000 - Sequence error not detected on PDB channel's corresponding
 *     pre-trigger.
 * - 0b00000001 - Sequence error detected on PDB channel's corresponding
 *     pre-trigger. ADCn block can be triggered for a conversion by one pre-trigger from
 *     PDB channel n. When one conversion, which is triggered by one of the
 *     pre-triggers from PDB channel n, is in progress, new trigger from PDB
 *     channel's corresponding pre-trigger m cannot be accepted by ADCn, and ERR[m] is
 *     set. Writing 0's to clear the sequence error flags.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH0S_ERR field. */
#define PDB_RD_CH0S_ERR(base) ((PDB_CH0S_REG(base) & PDB_CH0S_ERR_MASK) >> PDB_CH0S_ERR_SHIFT)
#define PDB_BRD_CH0S_ERR(base) (PDB_RD_CH0S_ERR(base))

/*! @brief Set the ERR field to a new value. */
#define PDB_WR_CH0S_ERR(base, value) (PDB_RMW_CH0S(base, PDB_CH0S_ERR_MASK, PDB_CH0S_ERR(value)))
#define PDB_BWR_CH0S_ERR(base, value) (PDB_WR_CH0S_ERR(base, value))
/*@}*/

/*!
 * @name Register PDB_CH0S, field CF[23:16] (RW)
 *
 * The CF[m] bit is set when the PDB counter matches the CHnDLYm. Write 0 to
 * clear these bits.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH0S_CF field. */
#define PDB_RD_CH0S_CF(base) ((PDB_CH0S_REG(base) & PDB_CH0S_CF_MASK) >> PDB_CH0S_CF_SHIFT)
#define PDB_BRD_CH0S_CF(base) (PDB_RD_CH0S_CF(base))

/*! @brief Set the CF field to a new value. */
#define PDB_WR_CH0S_CF(base, value) (PDB_RMW_CH0S(base, PDB_CH0S_CF_MASK, PDB_CH0S_CF(value)))
#define PDB_BWR_CH0S_CF(base, value) (PDB_WR_CH0S_CF(base, value))
/*@}*/

/*******************************************************************************
 * PDB_CH0DLY0 - Channel n Delay 0 register
 ******************************************************************************/

/*!
 * @brief PDB_CH0DLY0 - Channel n Delay 0 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CH0DLY0 register
 */
/*@{*/
#define PDB_RD_CH0DLY0(base)     (PDB_CH0DLY0_REG(base))
#define PDB_WR_CH0DLY0(base, value) (PDB_CH0DLY0_REG(base) = (value))
#define PDB_RMW_CH0DLY0(base, mask, value) (PDB_WR_CH0DLY0(base, (PDB_RD_CH0DLY0(base) & ~(mask)) | (value)))
#define PDB_SET_CH0DLY0(base, value) (PDB_WR_CH0DLY0(base, PDB_RD_CH0DLY0(base) |  (value)))
#define PDB_CLR_CH0DLY0(base, value) (PDB_WR_CH0DLY0(base, PDB_RD_CH0DLY0(base) & ~(value)))
#define PDB_TOG_CH0DLY0(base, value) (PDB_WR_CH0DLY0(base, PDB_RD_CH0DLY0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CH0DLY0 bitfields
 */

/*!
 * @name Register PDB_CH0DLY0, field DLY[15:0] (RW)
 *
 * Specifies the delay value for the channel's corresponding pre-trigger. The
 * pre-trigger asserts when the counter is equal to DLY. Reading this field returns
 * the value of internal register that is effective for the current PDB cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH0DLY0_DLY field. */
#define PDB_RD_CH0DLY0_DLY(base) ((PDB_CH0DLY0_REG(base) & PDB_CH0DLY0_DLY_MASK) >> PDB_CH0DLY0_DLY_SHIFT)
#define PDB_BRD_CH0DLY0_DLY(base) (PDB_RD_CH0DLY0_DLY(base))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_CH0DLY0_DLY(base, value) (PDB_RMW_CH0DLY0(base, PDB_CH0DLY0_DLY_MASK, PDB_CH0DLY0_DLY(value)))
#define PDB_BWR_CH0DLY0_DLY(base, value) (PDB_WR_CH0DLY0_DLY(base, value))
/*@}*/

/*******************************************************************************
 * PDB_CH0DLY1 - Channel n Delay 1 register
 ******************************************************************************/

/*!
 * @brief PDB_CH0DLY1 - Channel n Delay 1 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CH0DLY1 register
 */
/*@{*/
#define PDB_RD_CH0DLY1(base)     (PDB_CH0DLY1_REG(base))
#define PDB_WR_CH0DLY1(base, value) (PDB_CH0DLY1_REG(base) = (value))
#define PDB_RMW_CH0DLY1(base, mask, value) (PDB_WR_CH0DLY1(base, (PDB_RD_CH0DLY1(base) & ~(mask)) | (value)))
#define PDB_SET_CH0DLY1(base, value) (PDB_WR_CH0DLY1(base, PDB_RD_CH0DLY1(base) |  (value)))
#define PDB_CLR_CH0DLY1(base, value) (PDB_WR_CH0DLY1(base, PDB_RD_CH0DLY1(base) & ~(value)))
#define PDB_TOG_CH0DLY1(base, value) (PDB_WR_CH0DLY1(base, PDB_RD_CH0DLY1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CH0DLY1 bitfields
 */

/*!
 * @name Register PDB_CH0DLY1, field DLY[15:0] (RW)
 *
 * These bits specify the delay value for the channel's corresponding
 * pre-trigger. The pre-trigger asserts when the counter is equal to DLY. Reading these
 * bits returns the value of internal register that is effective for the current PDB
 * cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH0DLY1_DLY field. */
#define PDB_RD_CH0DLY1_DLY(base) ((PDB_CH0DLY1_REG(base) & PDB_CH0DLY1_DLY_MASK) >> PDB_CH0DLY1_DLY_SHIFT)
#define PDB_BRD_CH0DLY1_DLY(base) (PDB_RD_CH0DLY1_DLY(base))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_CH0DLY1_DLY(base, value) (PDB_RMW_CH0DLY1(base, PDB_CH0DLY1_DLY_MASK, PDB_CH0DLY1_DLY(value)))
#define PDB_BWR_CH0DLY1_DLY(base, value) (PDB_WR_CH0DLY1_DLY(base, value))
/*@}*/

/*******************************************************************************
 * PDB_CH0DLY2 - Channel n Delay 2 register
 ******************************************************************************/

/*!
 * @brief PDB_CH0DLY2 - Channel n Delay 2 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CH0DLY2 register
 */
/*@{*/
#define PDB_RD_CH0DLY2(base)     (PDB_CH0DLY2_REG(base))
#define PDB_WR_CH0DLY2(base, value) (PDB_CH0DLY2_REG(base) = (value))
#define PDB_RMW_CH0DLY2(base, mask, value) (PDB_WR_CH0DLY2(base, (PDB_RD_CH0DLY2(base) & ~(mask)) | (value)))
#define PDB_SET_CH0DLY2(base, value) (PDB_WR_CH0DLY2(base, PDB_RD_CH0DLY2(base) |  (value)))
#define PDB_CLR_CH0DLY2(base, value) (PDB_WR_CH0DLY2(base, PDB_RD_CH0DLY2(base) & ~(value)))
#define PDB_TOG_CH0DLY2(base, value) (PDB_WR_CH0DLY2(base, PDB_RD_CH0DLY2(base) ^  (value)))
/*@}*/

