nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * PDB_CH0DLY6 - Channel n Delay 6 register
 ******************************************************************************/

/*!
 * @brief PDB_CH0DLY6 - Channel n Delay 6 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CH0DLY6 register
 */
/*@{*/
#define PDB_RD_CH0DLY6(base)     (PDB_CH0DLY6_REG(base))
#define PDB_WR_CH0DLY6(base, value) (PDB_CH0DLY6_REG(base) = (value))
#define PDB_RMW_CH0DLY6(base, mask, value) (PDB_WR_CH0DLY6(base, (PDB_RD_CH0DLY6(base) & ~(mask)) | (value)))
#define PDB_SET_CH0DLY6(base, value) (PDB_WR_CH0DLY6(base, PDB_RD_CH0DLY6(base) |  (value)))
#define PDB_CLR_CH0DLY6(base, value) (PDB_WR_CH0DLY6(base, PDB_RD_CH0DLY6(base) & ~(value)))
#define PDB_TOG_CH0DLY6(base, value) (PDB_WR_CH0DLY6(base, PDB_RD_CH0DLY6(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CH0DLY6 bitfields
 */

/*!
 * @name Register PDB_CH0DLY6, field DLY[15:0] (RW)
 *
 * These bits specify the delay value for the channel's corresponding
 * pre-trigger. The pre-trigger asserts when the counter is equal to DLY. Reading these
 * bits returns the value of internal register that is effective for the current PDB
 * cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH0DLY6_DLY field. */
#define PDB_RD_CH0DLY6_DLY(base) ((PDB_CH0DLY6_REG(base) & PDB_CH0DLY6_DLY_MASK) >> PDB_CH0DLY6_DLY_SHIFT)
#define PDB_BRD_CH0DLY6_DLY(base) (PDB_RD_CH0DLY6_DLY(base))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_CH0DLY6_DLY(base, value) (PDB_RMW_CH0DLY6(base, PDB_CH0DLY6_DLY_MASK, PDB_CH0DLY6_DLY(value)))
#define PDB_BWR_CH0DLY6_DLY(base, value) (PDB_WR_CH0DLY6_DLY(base, value))
/*@}*/

/*******************************************************************************
 * PDB_CH0DLY7 - Channel n Delay 7 register
 ******************************************************************************/

/*!
 * @brief PDB_CH0DLY7 - Channel n Delay 7 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CH0DLY7 register
 */
/*@{*/
#define PDB_RD_CH0DLY7(base)     (PDB_CH0DLY7_REG(base))
#define PDB_WR_CH0DLY7(base, value) (PDB_CH0DLY7_REG(base) = (value))
#define PDB_RMW_CH0DLY7(base, mask, value) (PDB_WR_CH0DLY7(base, (PDB_RD_CH0DLY7(base) & ~(mask)) | (value)))
#define PDB_SET_CH0DLY7(base, value) (PDB_WR_CH0DLY7(base, PDB_RD_CH0DLY7(base) |  (value)))
#define PDB_CLR_CH0DLY7(base, value) (PDB_WR_CH0DLY7(base, PDB_RD_CH0DLY7(base) & ~(value)))
#define PDB_TOG_CH0DLY7(base, value) (PDB_WR_CH0DLY7(base, PDB_RD_CH0DLY7(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CH0DLY7 bitfields
 */

/*!
 * @name Register PDB_CH0DLY7, field DLY[15:0] (RW)
 *
 * These bits specify the delay value for the channel's corresponding
 * pre-trigger. The pre-trigger asserts when the counter is equal to DLY. Reading these
 * bits returns the value of internal register that is effective for the current PDB
 * cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH0DLY7_DLY field. */
#define PDB_RD_CH0DLY7_DLY(base) ((PDB_CH0DLY7_REG(base) & PDB_CH0DLY7_DLY_MASK) >> PDB_CH0DLY7_DLY_SHIFT)
#define PDB_BRD_CH0DLY7_DLY(base) (PDB_RD_CH0DLY7_DLY(base))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_CH0DLY7_DLY(base, value) (PDB_RMW_CH0DLY7(base, PDB_CH0DLY7_DLY_MASK, PDB_CH0DLY7_DLY(value)))
#define PDB_BWR_CH0DLY7_DLY(base, value) (PDB_WR_CH0DLY7_DLY(base, value))
/*@}*/

/*******************************************************************************
 * PDB_CH1C1 - Channel n Control register 1
 ******************************************************************************/

/*!
 * @brief PDB_CH1C1 - Channel n Control register 1 (RW)
 *
 * Reset value: 0x00000000U
 *
 * Each PDB channel has one control register, CHnC1. The bits in this register
 * control the functionality of each PDB channel operation.
 */
/*!
 * @name Constants and macros for entire PDB_CH1C1 register
 */
/*@{*/
#define PDB_RD_CH1C1(base)       (PDB_CH1C1_REG(base))
#define PDB_WR_CH1C1(base, value) (PDB_CH1C1_REG(base) = (value))
#define PDB_RMW_CH1C1(base, mask, value) (PDB_WR_CH1C1(base, (PDB_RD_CH1C1(base) & ~(mask)) | (value)))
#define PDB_SET_CH1C1(base, value) (PDB_WR_CH1C1(base, PDB_RD_CH1C1(base) |  (value)))
#define PDB_CLR_CH1C1(base, value) (PDB_WR_CH1C1(base, PDB_RD_CH1C1(base) & ~(value)))
#define PDB_TOG_CH1C1(base, value) (PDB_WR_CH1C1(base, PDB_RD_CH1C1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CH1C1 bitfields
 */

/*!
 * @name Register PDB_CH1C1, field EN[7:0] (RW)
 *
 * These bits enable the PDB ADC pre-trigger outputs. Only lower M pre-trigger
 * bits are implemented in this MCU.
 *
 * Values:
 * - 0b00000000 - PDB channel's corresponding pre-trigger disabled.
 * - 0b00000001 - PDB channel's corresponding pre-trigger enabled.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH1C1_EN field. */
#define PDB_RD_CH1C1_EN(base) ((PDB_CH1C1_REG(base) & PDB_CH1C1_EN_MASK) >> PDB_CH1C1_EN_SHIFT)
#define PDB_BRD_CH1C1_EN(base) (PDB_RD_CH1C1_EN(base))

/*! @brief Set the EN field to a new value. */
#define PDB_WR_CH1C1_EN(base, value) (PDB_RMW_CH1C1(base, PDB_CH1C1_EN_MASK, PDB_CH1C1_EN(value)))
#define PDB_BWR_CH1C1_EN(base, value) (PDB_WR_CH1C1_EN(base, value))
/*@}*/

/*!
 * @name Register PDB_CH1C1, field TOS[15:8] (RW)
 *
 * Selects the PDB ADC pre-trigger outputs. Only lower M pre-trigger fields are
 * implemented in this MCU.
 *
 * Values:
 * - 0b00000000 - PDB channel's corresponding pre-trigger is in bypassed mode.
 *     The pre-trigger asserts one peripheral clock cycle after a rising edge is
 *     detected on selected trigger input source or software trigger is selected
 *     and SWTRIG is written with 1.
 * - 0b00000001 - PDB channel's corresponding pre-trigger asserts when the
 *     counter reaches the channel delay register and one peripheral clock cycle after
 *     a rising edge is detected on selected trigger input source or software
 *     trigger is selected and SETRIG is written with 1.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH1C1_TOS field. */
#define PDB_RD_CH1C1_TOS(base) ((PDB_CH1C1_REG(base) & PDB_CH1C1_TOS_MASK) >> PDB_CH1C1_TOS_SHIFT)
#define PDB_BRD_CH1C1_TOS(base) (PDB_RD_CH1C1_TOS(base))

/*! @brief Set the TOS field to a new value. */
#define PDB_WR_CH1C1_TOS(base, value) (PDB_RMW_CH1C1(base, PDB_CH1C1_TOS_MASK, PDB_CH1C1_TOS(value)))
#define PDB_BWR_CH1C1_TOS(base, value) (PDB_WR_CH1C1_TOS(base, value))
/*@}*/

/*!
 * @name Register PDB_CH1C1, field BB[23:16] (RW)
 *
 * These bits enable the PDB ADC pre-trigger operation as back-to-back mode.
 * Only lower M pre-trigger bits are implemented in this MCU. Back-to-back operation
 * enables the ADC conversions complete to trigger the next PDB channel
 * pre-trigger and trigger output, so that the ADC conversions can be triggered on next
 * set of configuration and results registers. Application code must only enable
 * the back-to-back operation of the PDB pre-triggers at the leading of the
 * back-to-back connection chain.
 *
 * Values:
 * - 0b00000000 - PDB channel's corresponding pre-trigger back-to-back operation
 *     disabled.
 * - 0b00000001 - PDB channel's corresponding pre-trigger back-to-back operation
 *     enabled.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH1C1_BB field. */
#define PDB_RD_CH1C1_BB(base) ((PDB_CH1C1_REG(base) & PDB_CH1C1_BB_MASK) >> PDB_CH1C1_BB_SHIFT)
#define PDB_BRD_CH1C1_BB(base) (PDB_RD_CH1C1_BB(base))

/*! @brief Set the BB field to a new value. */
#define PDB_WR_CH1C1_BB(base, value) (PDB_RMW_CH1C1(base, PDB_CH1C1_BB_MASK, PDB_CH1C1_BB(value)))
#define PDB_BWR_CH1C1_BB(base, value) (PDB_WR_CH1C1_BB(base, value))
/*@}*/

