nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * PDB_CH1DLY2 - Channel n Delay 2 register
 ******************************************************************************/

/*!
 * @brief PDB_CH1DLY2 - Channel n Delay 2 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CH1DLY2 register
 */
/*@{*/
#define PDB_RD_CH1DLY2(base)     (PDB_CH1DLY2_REG(base))
#define PDB_WR_CH1DLY2(base, value) (PDB_CH1DLY2_REG(base) = (value))
#define PDB_RMW_CH1DLY2(base, mask, value) (PDB_WR_CH1DLY2(base, (PDB_RD_CH1DLY2(base) & ~(mask)) | (value)))
#define PDB_SET_CH1DLY2(base, value) (PDB_WR_CH1DLY2(base, PDB_RD_CH1DLY2(base) |  (value)))
#define PDB_CLR_CH1DLY2(base, value) (PDB_WR_CH1DLY2(base, PDB_RD_CH1DLY2(base) & ~(value)))
#define PDB_TOG_CH1DLY2(base, value) (PDB_WR_CH1DLY2(base, PDB_RD_CH1DLY2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CH1DLY2 bitfields
 */

/*!
 * @name Register PDB_CH1DLY2, field DLY[15:0] (RW)
 *
 * These bits specify the delay value for the channel's corresponding
 * pre-trigger. The pre-trigger asserts when the counter is equal to DLY. Reading these
 * bits returns the value of internal register that is effective for the current PDB
 * cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH1DLY2_DLY field. */
#define PDB_RD_CH1DLY2_DLY(base) ((PDB_CH1DLY2_REG(base) & PDB_CH1DLY2_DLY_MASK) >> PDB_CH1DLY2_DLY_SHIFT)
#define PDB_BRD_CH1DLY2_DLY(base) (PDB_RD_CH1DLY2_DLY(base))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_CH1DLY2_DLY(base, value) (PDB_RMW_CH1DLY2(base, PDB_CH1DLY2_DLY_MASK, PDB_CH1DLY2_DLY(value)))
#define PDB_BWR_CH1DLY2_DLY(base, value) (PDB_WR_CH1DLY2_DLY(base, value))
/*@}*/

/*******************************************************************************
 * PDB_CH1DLY3 - Channel n Delay 3 register
 ******************************************************************************/

/*!
 * @brief PDB_CH1DLY3 - Channel n Delay 3 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CH1DLY3 register
 */
/*@{*/
#define PDB_RD_CH1DLY3(base)     (PDB_CH1DLY3_REG(base))
#define PDB_WR_CH1DLY3(base, value) (PDB_CH1DLY3_REG(base) = (value))
#define PDB_RMW_CH1DLY3(base, mask, value) (PDB_WR_CH1DLY3(base, (PDB_RD_CH1DLY3(base) & ~(mask)) | (value)))
#define PDB_SET_CH1DLY3(base, value) (PDB_WR_CH1DLY3(base, PDB_RD_CH1DLY3(base) |  (value)))
#define PDB_CLR_CH1DLY3(base, value) (PDB_WR_CH1DLY3(base, PDB_RD_CH1DLY3(base) & ~(value)))
#define PDB_TOG_CH1DLY3(base, value) (PDB_WR_CH1DLY3(base, PDB_RD_CH1DLY3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CH1DLY3 bitfields
 */

/*!
 * @name Register PDB_CH1DLY3, field DLY[15:0] (RW)
 *
 * These bits specify the delay value for the channel's corresponding
 * pre-trigger. The pre-trigger asserts when the counter is equal to DLY. Reading these
 * bits returns the value of internal register that is effective for the current PDB
 * cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH1DLY3_DLY field. */
#define PDB_RD_CH1DLY3_DLY(base) ((PDB_CH1DLY3_REG(base) & PDB_CH1DLY3_DLY_MASK) >> PDB_CH1DLY3_DLY_SHIFT)
#define PDB_BRD_CH1DLY3_DLY(base) (PDB_RD_CH1DLY3_DLY(base))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_CH1DLY3_DLY(base, value) (PDB_RMW_CH1DLY3(base, PDB_CH1DLY3_DLY_MASK, PDB_CH1DLY3_DLY(value)))
#define PDB_BWR_CH1DLY3_DLY(base, value) (PDB_WR_CH1DLY3_DLY(base, value))
/*@}*/

/*******************************************************************************
 * PDB_CH1DLY4 - Channel n Delay 4 register
 ******************************************************************************/

/*!
 * @brief PDB_CH1DLY4 - Channel n Delay 4 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CH1DLY4 register
 */
/*@{*/
#define PDB_RD_CH1DLY4(base)     (PDB_CH1DLY4_REG(base))
#define PDB_WR_CH1DLY4(base, value) (PDB_CH1DLY4_REG(base) = (value))
#define PDB_RMW_CH1DLY4(base, mask, value) (PDB_WR_CH1DLY4(base, (PDB_RD_CH1DLY4(base) & ~(mask)) | (value)))
#define PDB_SET_CH1DLY4(base, value) (PDB_WR_CH1DLY4(base, PDB_RD_CH1DLY4(base) |  (value)))
#define PDB_CLR_CH1DLY4(base, value) (PDB_WR_CH1DLY4(base, PDB_RD_CH1DLY4(base) & ~(value)))
#define PDB_TOG_CH1DLY4(base, value) (PDB_WR_CH1DLY4(base, PDB_RD_CH1DLY4(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CH1DLY4 bitfields
 */

/*!
 * @name Register PDB_CH1DLY4, field DLY[15:0] (RW)
 *
 * These bits specify the delay value for the channel's corresponding
 * pre-trigger. The pre-trigger asserts when the counter is equal to DLY. Reading these
 * bits returns the value of internal register that is effective for the current PDB
 * cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH1DLY4_DLY field. */
#define PDB_RD_CH1DLY4_DLY(base) ((PDB_CH1DLY4_REG(base) & PDB_CH1DLY4_DLY_MASK) >> PDB_CH1DLY4_DLY_SHIFT)
#define PDB_BRD_CH1DLY4_DLY(base) (PDB_RD_CH1DLY4_DLY(base))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_CH1DLY4_DLY(base, value) (PDB_RMW_CH1DLY4(base, PDB_CH1DLY4_DLY_MASK, PDB_CH1DLY4_DLY(value)))
#define PDB_BWR_CH1DLY4_DLY(base, value) (PDB_WR_CH1DLY4_DLY(base, value))
/*@}*/

/*******************************************************************************
 * PDB_CH1DLY5 - Channel n Delay 5 register
 ******************************************************************************/

/*!
 * @brief PDB_CH1DLY5 - Channel n Delay 5 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CH1DLY5 register
 */
/*@{*/
#define PDB_RD_CH1DLY5(base)     (PDB_CH1DLY5_REG(base))
#define PDB_WR_CH1DLY5(base, value) (PDB_CH1DLY5_REG(base) = (value))
#define PDB_RMW_CH1DLY5(base, mask, value) (PDB_WR_CH1DLY5(base, (PDB_RD_CH1DLY5(base) & ~(mask)) | (value)))
#define PDB_SET_CH1DLY5(base, value) (PDB_WR_CH1DLY5(base, PDB_RD_CH1DLY5(base) |  (value)))
#define PDB_CLR_CH1DLY5(base, value) (PDB_WR_CH1DLY5(base, PDB_RD_CH1DLY5(base) & ~(value)))
#define PDB_TOG_CH1DLY5(base, value) (PDB_WR_CH1DLY5(base, PDB_RD_CH1DLY5(base) ^  (value)))
/*@}*/

