nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual PDB_CH1DLY5 bitfields
 */

/*!
 * @name Register PDB_CH1DLY5, field DLY[15:0] (RW)
 *
 * These bits specify the delay value for the channel's corresponding
 * pre-trigger. The pre-trigger asserts when the counter is equal to DLY. Reading these
 * bits returns the value of internal register that is effective for the current PDB
 * cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH1DLY5_DLY field. */
#define PDB_RD_CH1DLY5_DLY(base) ((PDB_CH1DLY5_REG(base) & PDB_CH1DLY5_DLY_MASK) >> PDB_CH1DLY5_DLY_SHIFT)
#define PDB_BRD_CH1DLY5_DLY(base) (PDB_RD_CH1DLY5_DLY(base))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_CH1DLY5_DLY(base, value) (PDB_RMW_CH1DLY5(base, PDB_CH1DLY5_DLY_MASK, PDB_CH1DLY5_DLY(value)))
#define PDB_BWR_CH1DLY5_DLY(base, value) (PDB_WR_CH1DLY5_DLY(base, value))
/*@}*/

/*******************************************************************************
 * PDB_CH1DLY6 - Channel n Delay 6 register
 ******************************************************************************/

/*!
 * @brief PDB_CH1DLY6 - Channel n Delay 6 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CH1DLY6 register
 */
/*@{*/
#define PDB_RD_CH1DLY6(base)     (PDB_CH1DLY6_REG(base))
#define PDB_WR_CH1DLY6(base, value) (PDB_CH1DLY6_REG(base) = (value))
#define PDB_RMW_CH1DLY6(base, mask, value) (PDB_WR_CH1DLY6(base, (PDB_RD_CH1DLY6(base) & ~(mask)) | (value)))
#define PDB_SET_CH1DLY6(base, value) (PDB_WR_CH1DLY6(base, PDB_RD_CH1DLY6(base) |  (value)))
#define PDB_CLR_CH1DLY6(base, value) (PDB_WR_CH1DLY6(base, PDB_RD_CH1DLY6(base) & ~(value)))
#define PDB_TOG_CH1DLY6(base, value) (PDB_WR_CH1DLY6(base, PDB_RD_CH1DLY6(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CH1DLY6 bitfields
 */

/*!
 * @name Register PDB_CH1DLY6, field DLY[15:0] (RW)
 *
 * These bits specify the delay value for the channel's corresponding
 * pre-trigger. The pre-trigger asserts when the counter is equal to DLY. Reading these
 * bits returns the value of internal register that is effective for the current PDB
 * cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH1DLY6_DLY field. */
#define PDB_RD_CH1DLY6_DLY(base) ((PDB_CH1DLY6_REG(base) & PDB_CH1DLY6_DLY_MASK) >> PDB_CH1DLY6_DLY_SHIFT)
#define PDB_BRD_CH1DLY6_DLY(base) (PDB_RD_CH1DLY6_DLY(base))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_CH1DLY6_DLY(base, value) (PDB_RMW_CH1DLY6(base, PDB_CH1DLY6_DLY_MASK, PDB_CH1DLY6_DLY(value)))
#define PDB_BWR_CH1DLY6_DLY(base, value) (PDB_WR_CH1DLY6_DLY(base, value))
/*@}*/

/*******************************************************************************
 * PDB_CH1DLY7 - Channel n Delay 7 register
 ******************************************************************************/

/*!
 * @brief PDB_CH1DLY7 - Channel n Delay 7 register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_CH1DLY7 register
 */
/*@{*/
#define PDB_RD_CH1DLY7(base)     (PDB_CH1DLY7_REG(base))
#define PDB_WR_CH1DLY7(base, value) (PDB_CH1DLY7_REG(base) = (value))
#define PDB_RMW_CH1DLY7(base, mask, value) (PDB_WR_CH1DLY7(base, (PDB_RD_CH1DLY7(base) & ~(mask)) | (value)))
#define PDB_SET_CH1DLY7(base, value) (PDB_WR_CH1DLY7(base, PDB_RD_CH1DLY7(base) |  (value)))
#define PDB_CLR_CH1DLY7(base, value) (PDB_WR_CH1DLY7(base, PDB_RD_CH1DLY7(base) & ~(value)))
#define PDB_TOG_CH1DLY7(base, value) (PDB_WR_CH1DLY7(base, PDB_RD_CH1DLY7(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PDB_CH1DLY7 bitfields
 */

/*!
 * @name Register PDB_CH1DLY7, field DLY[15:0] (RW)
 *
 * These bits specify the delay value for the channel's corresponding
 * pre-trigger. The pre-trigger asserts when the counter is equal to DLY. Reading these
 * bits returns the value of internal register that is effective for the current PDB
 * cycle.
 */
/*@{*/
/*! @brief Read current value of the PDB_CH1DLY7_DLY field. */
#define PDB_RD_CH1DLY7_DLY(base) ((PDB_CH1DLY7_REG(base) & PDB_CH1DLY7_DLY_MASK) >> PDB_CH1DLY7_DLY_SHIFT)
#define PDB_BRD_CH1DLY7_DLY(base) (PDB_RD_CH1DLY7_DLY(base))

/*! @brief Set the DLY field to a new value. */
#define PDB_WR_CH1DLY7_DLY(base, value) (PDB_RMW_CH1DLY7(base, PDB_CH1DLY7_DLY_MASK, PDB_CH1DLY7_DLY(value)))
#define PDB_BWR_CH1DLY7_DLY(base, value) (PDB_WR_CH1DLY7_DLY(base, value))
/*@}*/

/*******************************************************************************
 * PDB_POEN - Pulse-Out n Enable register
 ******************************************************************************/

/*!
 * @brief PDB_POEN - Pulse-Out n Enable register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire PDB_POEN register
 */
/*@{*/
#define PDB_RD_POEN(base)        (PDB_POEN_REG(base))
#define PDB_WR_POEN(base, value) (PDB_POEN_REG(base) = (value))
#define PDB_RMW_POEN(base, mask, value) (PDB_WR_POEN(base, (PDB_RD_POEN(base) & ~(mask)) | (value)))
#define PDB_SET_POEN(base, value) (PDB_WR_POEN(base, PDB_RD_POEN(base) |  (value)))
#define PDB_CLR_POEN(base, value) (PDB_WR_POEN(base, PDB_RD_POEN(base) & ~(value)))
#define PDB_TOG_POEN(base, value) (PDB_WR_POEN(base, PDB_RD_POEN(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PDB_POEN bitfields
 */

/*!
 * @name Register PDB_POEN, field POEN[7:0] (RW)
 *
 * Enables the pulse output. Only lower Y bits are implemented in this MCU.
 *
 * Values:
 * - 0b00000000 - PDB Pulse-Out disabled
 * - 0b00000001 - PDB Pulse-Out enabled
 */
/*@{*/
/*! @brief Read current value of the PDB_POEN_POEN field. */
#define PDB_RD_POEN_POEN(base) ((PDB_POEN_REG(base) & PDB_POEN_POEN_MASK) >> PDB_POEN_POEN_SHIFT)
#define PDB_BRD_POEN_POEN(base) (PDB_RD_POEN_POEN(base))

/*! @brief Set the POEN field to a new value. */
#define PDB_WR_POEN_POEN(base, value) (PDB_RMW_POEN(base, PDB_POEN_POEN_MASK, PDB_POEN_POEN(value)))
#define PDB_BWR_POEN_POEN(base, value) (PDB_WR_POEN_POEN(base, value))
/*@}*/

