nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * PMC_LVDSC2 - Low Voltage Detect Status and Control 2 Register
 ******************************************************************************/

/*!
 * @brief PMC_LVDSC2 - Low Voltage Detect Status and Control 2 Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains status and control bits to support the low voltage
 * warning (LVW) function. When the internal voltage regulator is in low power mode,
 * the LVD system is disabled regardless of the PMC_LVDSC2 settings.
 */
/*!
 * @name Constants and macros for entire PMC_LVDSC2 register
 */
/*@{*/
#define PMC_RD_LVDSC2(base)      (PMC_LVDSC2_REG(base))
#define PMC_WR_LVDSC2(base, value) (PMC_LVDSC2_REG(base) = (value))
#define PMC_RMW_LVDSC2(base, mask, value) (PMC_WR_LVDSC2(base, (PMC_RD_LVDSC2(base) & ~(mask)) | (value)))
#define PMC_SET_LVDSC2(base, value) (PMC_WR_LVDSC2(base, PMC_RD_LVDSC2(base) |  (value)))
#define PMC_CLR_LVDSC2(base, value) (PMC_WR_LVDSC2(base, PMC_RD_LVDSC2(base) & ~(value)))
#define PMC_TOG_LVDSC2(base, value) (PMC_WR_LVDSC2(base, PMC_RD_LVDSC2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PMC_LVDSC2 bitfields
 */

/*!
 * @name Register PMC_LVDSC2, field LVWIE[5] (RW)
 *
 * This bit enables hardware interrupt requests for LVWF.
 *
 * Values:
 * - 0b0 - Hardware interrupt disabled (use polling)
 * - 0b1 - Request a hardware interrupt when LVWF=1
 */
/*@{*/
/*! @brief Read current value of the PMC_LVDSC2_LVWIE field. */
#define PMC_RD_LVDSC2_LVWIE(base) ((PMC_LVDSC2_REG(base) & PMC_LVDSC2_LVWIE_MASK) >> PMC_LVDSC2_LVWIE_SHIFT)
#define PMC_BRD_LVDSC2_LVWIE(base) (BITBAND_ACCESS8(&PMC_LVDSC2_REG(base), PMC_LVDSC2_LVWIE_SHIFT))

/*! @brief Set the LVWIE field to a new value. */
#define PMC_WR_LVDSC2_LVWIE(base, value) (PMC_RMW_LVDSC2(base, PMC_LVDSC2_LVWIE_MASK, PMC_LVDSC2_LVWIE(value)))
#define PMC_BWR_LVDSC2_LVWIE(base, value) (BITBAND_ACCESS8(&PMC_LVDSC2_REG(base), PMC_LVDSC2_LVWIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PMC_LVDSC2, field LVDWCK[6] (WO)
 *
 * This write-only bit is used to acknowledge low voltage warning errors. Write
 * 1 to clear LVWF. Reads always return 0.
 */
/*@{*/
/*! @brief Set the LVDWCK field to a new value. */
#define PMC_WR_LVDSC2_LVDWCK(base, value) (PMC_RMW_LVDSC2(base, PMC_LVDSC2_LVDWCK_MASK, PMC_LVDSC2_LVDWCK(value)))
#define PMC_BWR_LVDSC2_LVDWCK(base, value) (PMC_WR_LVDSC2_LVDWCK(base, value))
/*@}*/

/*!
 * @name Register PMC_LVDSC2, field LVWF[7] (RO)
 *
 * This bit read-only status bit indicates a low-voltage detect event. The
 * threshold voltage is VLVW.
 *
 * Values:
 * - 0b0 - Low-voltage warning event not detected
 * - 0b1 - Low-voltage warning event detected
 */
/*@{*/
/*! @brief Read current value of the PMC_LVDSC2_LVWF field. */
#define PMC_RD_LVDSC2_LVWF(base) ((PMC_LVDSC2_REG(base) & PMC_LVDSC2_LVWF_MASK) >> PMC_LVDSC2_LVWF_SHIFT)
#define PMC_BRD_LVDSC2_LVWF(base) (BITBAND_ACCESS8(&PMC_LVDSC2_REG(base), PMC_LVDSC2_LVWF_SHIFT))
/*@}*/

/*******************************************************************************
 * PMC_REGSC - Regulator Status and Control Register
 ******************************************************************************/

/*!
 * @brief PMC_REGSC - Regulator Status and Control Register (RW)
 *
 * Reset value: 0x04U
 *
 * This register contains general control and status bits for the regulator and
 * the LPO.
 */
/*!
 * @name Constants and macros for entire PMC_REGSC register
 */
/*@{*/
#define PMC_RD_REGSC(base)       (PMC_REGSC_REG(base))
#define PMC_WR_REGSC(base, value) (PMC_REGSC_REG(base) = (value))
#define PMC_RMW_REGSC(base, mask, value) (PMC_WR_REGSC(base, (PMC_RD_REGSC(base) & ~(mask)) | (value)))
#define PMC_SET_REGSC(base, value) (PMC_WR_REGSC(base, PMC_RD_REGSC(base) |  (value)))
#define PMC_CLR_REGSC(base, value) (PMC_WR_REGSC(base, PMC_RD_REGSC(base) & ~(value)))
#define PMC_TOG_REGSC(base, value) (PMC_WR_REGSC(base, PMC_RD_REGSC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PMC_REGSC bitfields
 */

/*!
 * @name Register PMC_REGSC, field BIASEN[0] (RW)
 *
 * This bit enables source and well biasing for the core logic in low power
 * mode. In full performance mode this bit has no effect. This is useful to further
 * reduce MCU power consumption in low power mode.
 *
 * Values:
 * - 0b0 - Biasing disabled, core logic can run in full performance
 * - 0b0 - Biasing enabled, core logic is slower and there are restrictions in
 *     allowed system clock speed (see device level specification for details)
 */
/*@{*/
/*! @brief Read current value of the PMC_REGSC_BIASEN field. */
#define PMC_RD_REGSC_BIASEN(base) ((PMC_REGSC_REG(base) & PMC_REGSC_BIASEN_MASK) >> PMC_REGSC_BIASEN_SHIFT)
#define PMC_BRD_REGSC_BIASEN(base) (BITBAND_ACCESS8(&PMC_REGSC_REG(base), PMC_REGSC_BIASEN_SHIFT))

/*! @brief Set the BIASEN field to a new value. */
#define PMC_WR_REGSC_BIASEN(base, value) (PMC_RMW_REGSC(base, PMC_REGSC_BIASEN_MASK, PMC_REGSC_BIASEN(value)))
#define PMC_BWR_REGSC_BIASEN(base, value) (BITBAND_ACCESS8(&PMC_REGSC_REG(base), PMC_REGSC_BIASEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PMC_REGSC, field REGFPM[2] (RW)
 *
 * This read-only bit provides the current status of the internal voltage
 * regulator.
 *
 * Values:
 * - 0b0 - Regulator is in low power mode or transition to/from
 * - 0b0 - Regulator is in full performance mode
 */
/*@{*/
/*! @brief Read current value of the PMC_REGSC_REGFPM field. */
#define PMC_RD_REGSC_REGFPM(base) ((PMC_REGSC_REG(base) & PMC_REGSC_REGFPM_MASK) >> PMC_REGSC_REGFPM_SHIFT)
#define PMC_BRD_REGSC_REGFPM(base) (BITBAND_ACCESS8(&PMC_REGSC_REG(base), PMC_REGSC_REGFPM_SHIFT))

/*! @brief Set the REGFPM field to a new value. */
#define PMC_WR_REGSC_REGFPM(base, value) (PMC_RMW_REGSC(base, PMC_REGSC_REGFPM_MASK, PMC_REGSC_REGFPM(value)))
#define PMC_BWR_REGSC_REGFPM(base, value) (BITBAND_ACCESS8(&PMC_REGSC_REG(base), PMC_REGSC_REGFPM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PMC_REGSC, field LPOSTAT[6] (RO)
 *
 * This bit shows the status of the LPO clock to be either in high phase or low
 * phase. Software can poll this status bit to measure actual LOP clock frequency
 * and eventually use the LPOTRIM[4:0] register to change the LPO frequency.
 *
 * Values:
 * - 0b0 - Low power oscillator in low phase
 * - 0b0 - Low power oscillator in high phase
 */
/*@{*/
/*! @brief Read current value of the PMC_REGSC_LPOSTAT field. */
#define PMC_RD_REGSC_LPOSTAT(base) ((PMC_REGSC_REG(base) & PMC_REGSC_LPOSTAT_MASK) >> PMC_REGSC_LPOSTAT_SHIFT)
#define PMC_BRD_REGSC_LPOSTAT(base) (BITBAND_ACCESS8(&PMC_REGSC_REG(base), PMC_REGSC_LPOSTAT_SHIFT))
/*@}*/

/*!
 * @name Register PMC_REGSC, field LPODIS[7] (RW)
 *
 * This bit enables or disable the low power oscillator. After disabling the LPO
 * a time of 2 LPO clock cycles is required before it is allowed to enable it
 * again. Violating this waiting time of 2 cycles can result in malfunction of the
 * LPO.
 *
 * Values:
 * - 0b0 - Low power oscillator disabled
 * - 0b1 - Low power oscillator enabled
 */
/*@{*/
/*! @brief Read current value of the PMC_REGSC_LPODIS field. */
#define PMC_RD_REGSC_LPODIS(base) ((PMC_REGSC_REG(base) & PMC_REGSC_LPODIS_MASK) >> PMC_REGSC_LPODIS_SHIFT)
#define PMC_BRD_REGSC_LPODIS(base) (BITBAND_ACCESS8(&PMC_REGSC_REG(base), PMC_REGSC_LPODIS_SHIFT))

/*! @brief Set the LPODIS field to a new value. */
#define PMC_WR_REGSC_LPODIS(base, value) (PMC_RMW_REGSC(base, PMC_REGSC_LPODIS_MASK, PMC_REGSC_LPODIS(value)))
#define PMC_BWR_REGSC_LPODIS(base, value) (BITBAND_ACCESS8(&PMC_REGSC_REG(base), PMC_REGSC_LPODIS_SHIFT) = (value))
/*@}*/

