nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * PMC_LPOTRIM - Low Power Oscillator Trim Register
 ******************************************************************************/

/*!
 * @brief PMC_LPOTRIM - Low Power Oscillator Trim Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains the period trimming bits for the low power oscillator.
 * Trimming effect of LPOTRIM[4:0] LPOTRIM[4:0] Decimal Period of LPO clock
 * 10000 -16 lowest 10001 -15 increasing ... ... 11110 -2 11111 -1 00000 0 typical
 * 128 kHz 00001 +1 increasing ... ... 01110 +14 01111 +15 highest
 */
/*!
 * @name Constants and macros for entire PMC_LPOTRIM register
 */
/*@{*/
#define PMC_RD_LPOTRIM(base)     (PMC_LPOTRIM_REG(base))
#define PMC_WR_LPOTRIM(base, value) (PMC_LPOTRIM_REG(base) = (value))
#define PMC_RMW_LPOTRIM(base, mask, value) (PMC_WR_LPOTRIM(base, (PMC_RD_LPOTRIM(base) & ~(mask)) | (value)))
#define PMC_SET_LPOTRIM(base, value) (PMC_WR_LPOTRIM(base, PMC_RD_LPOTRIM(base) |  (value)))
#define PMC_CLR_LPOTRIM(base, value) (PMC_WR_LPOTRIM(base, PMC_RD_LPOTRIM(base) & ~(value)))
#define PMC_TOG_LPOTRIM(base, value) (PMC_WR_LPOTRIM(base, PMC_RD_LPOTRIM(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PMC_LPOTRIM bitfields
 */

/*!
 * @name Register PMC_LPOTRIM, field LPOTRIM[4:0] (RW)
 *
 * These bits are used for trimming the frequency of the low power oscillator.
 * See the table above for trimming effect.
 */
/*@{*/
/*! @brief Read current value of the PMC_LPOTRIM_LPOTRIM field. */
#define PMC_RD_LPOTRIM_LPOTRIM(base) ((PMC_LPOTRIM_REG(base) & PMC_LPOTRIM_LPOTRIM_MASK) >> PMC_LPOTRIM_LPOTRIM_SHIFT)
#define PMC_BRD_LPOTRIM_LPOTRIM(base) (PMC_RD_LPOTRIM_LPOTRIM(base))

/*! @brief Set the LPOTRIM field to a new value. */
#define PMC_WR_LPOTRIM_LPOTRIM(base, value) (PMC_RMW_LPOTRIM(base, PMC_LPOTRIM_LPOTRIM_MASK, PMC_LPOTRIM_LPOTRIM(value)))
#define PMC_BWR_LPOTRIM_LPOTRIM(base, value) (PMC_WR_LPOTRIM_LPOTRIM(base, value))
/*@}*/

/*
 * S32K144 PORT
 *
 * Pin Control and Interrupts
 *
 * Registers defined in this header file:
 * - PORT_PCR - Pin Control Register n
 * - PORT_GPCLR - Global Pin Control Low Register
 * - PORT_GPCHR - Global Pin Control High Register
 * - PORT_ISFR - Interrupt Status Flag Register
 * - PORT_DFER - Digital Filter Enable Register
 * - PORT_DFCR - Digital Filter Clock Register
 * - PORT_DFWR - Digital Filter Width Register
 */

#define PORT_INSTANCE_COUNT (5U) /*!< Number of instances of the PORT module. */
#define PORTA_IDX (0U) /*!< Instance number for PORTA. */
#define PORTB_IDX (1U) /*!< Instance number for PORTB. */
#define PORTC_IDX (2U) /*!< Instance number for PORTC. */
#define PORTD_IDX (3U) /*!< Instance number for PORTD. */
#define PORTE_IDX (4U) /*!< Instance number for PORTE. */

/*******************************************************************************
 * PORT_PCR - Pin Control Register n
 ******************************************************************************/

/*!
 * @brief PORT_PCR - Pin Control Register n (RW)
 *
 * Reset value: 0x00000002U
 *
 * See the Signal Multiplexing and Pin Assignment chapter for the reset value of
 * this device. See the GPIO Configuration section for details on the available
 * functions for each pin. Do not modify pin configuration registers associated
 * with pins not available in your selected package. All unbonded pins not
 * available in your package will default to DISABLE state for lowest power consumption.
 */
/*!
 * @name Constants and macros for entire PORT_PCR register
 */
/*@{*/
#define PORT_RD_PCR(base, index) (PORT_PCR_REG(base, index))
#define PORT_WR_PCR(base, index, value) (PORT_PCR_REG(base, index) = (value))
#define PORT_RMW_PCR(base, index, mask, value) (PORT_WR_PCR(base, index, (PORT_RD_PCR(base, index) & ~(mask)) | (value)))
#define PORT_SET_PCR(base, index, value) (PORT_WR_PCR(base, index, PORT_RD_PCR(base, index) |  (value)))
#define PORT_CLR_PCR(base, index, value) (PORT_WR_PCR(base, index, PORT_RD_PCR(base, index) & ~(value)))
#define PORT_TOG_PCR(base, index, value) (PORT_WR_PCR(base, index, PORT_RD_PCR(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PORT_PCR bitfields
 */

/*!
 * @name Register PORT_PCR, field PS[0] (RW)
 *
 * Pull configuration is valid in all digital pin muxing modes.
 *
 * Values:
 * - 0b0 - Internal pulldown resistor is enabled on the corresponding pin, if
 *     the corresponding PE field is set.
 * - 0b1 - Internal pullup resistor is enabled on the corresponding pin, if the
 *     corresponding PE field is set.
 */
/*@{*/
/*! @brief Read current value of the PORT_PCR_PS field. */
#define PORT_RD_PCR_PS(base, index) ((PORT_PCR_REG(base, index) & PORT_PCR_PS_MASK) >> PORT_PCR_PS_SHIFT)
#define PORT_BRD_PCR_PS(base, index) (BITBAND_ACCESS32(&PORT_PCR_REG(base, index), PORT_PCR_PS_SHIFT))

/*! @brief Set the PS field to a new value. */
#define PORT_WR_PCR_PS(base, index, value) (PORT_RMW_PCR(base, index, (PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK), PORT_PCR_PS(value)))
#define PORT_BWR_PCR_PS(base, index, value) (BITBAND_ACCESS32(&PORT_PCR_REG(base, index), PORT_PCR_PS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PORT_PCR, field PE[1] (RW)
 *
 * Pull configuration is valid in all digital pin muxing modes.
 *
 * Values:
 * - 0b0 - Internal pullup or pulldown resistor is not enabled on the
 *     corresponding pin.
 * - 0b1 - Internal pullup or pulldown resistor is enabled on the corresponding
 *     pin, if the pin is configured as a digital input.
 */
/*@{*/
/*! @brief Read current value of the PORT_PCR_PE field. */
#define PORT_RD_PCR_PE(base, index) ((PORT_PCR_REG(base, index) & PORT_PCR_PE_MASK) >> PORT_PCR_PE_SHIFT)
#define PORT_BRD_PCR_PE(base, index) (BITBAND_ACCESS32(&PORT_PCR_REG(base, index), PORT_PCR_PE_SHIFT))

/*! @brief Set the PE field to a new value. */
#define PORT_WR_PCR_PE(base, index, value) (PORT_RMW_PCR(base, index, (PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK), PORT_PCR_PE(value)))
#define PORT_BWR_PCR_PE(base, index, value) (BITBAND_ACCESS32(&PORT_PCR_REG(base, index), PORT_PCR_PE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PORT_PCR, field SRE[2] (RW)
 *
 * Slew rate configuration is valid in all digital pin muxing modes.
 *
 * Values:
 * - 0b0 - Fast slew rate is configured on the corresponding pin, if the pin is
 *     configured as a digital output.
 * - 0b1 - Slow slew rate is configured on the corresponding pin, if the pin is
 *     configured as a digital output.
 */
/*@{*/
/*! @brief Read current value of the PORT_PCR_SRE field. */
#define PORT_RD_PCR_SRE(base, index) ((PORT_PCR_REG(base, index) & PORT_PCR_SRE_MASK) >> PORT_PCR_SRE_SHIFT)
#define PORT_BRD_PCR_SRE(base, index) (BITBAND_ACCESS32(&PORT_PCR_REG(base, index), PORT_PCR_SRE_SHIFT))

