nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * RCM_PARAM - Parameter Register
 ******************************************************************************/

/*!
 * @brief RCM_PARAM - Parameter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire RCM_PARAM register
 */
/*@{*/
#define RCM_RD_PARAM(base)       (RCM_PARAM_REG(base))
/*@}*/

/*******************************************************************************
 * RCM_SRS - System Reset Status Register
 ******************************************************************************/

/*!
 * @brief RCM_SRS - System Reset Status Register (RO)
 *
 * Reset value: 0x00000082U
 *
 * This register includes read-only status flags to indicate the source of the
 * most recent reset. The reset state of these bits depends on what caused the MCU
 * to reset. The reset value of this register depends on the reset source: POR
 * (including LVD) - 0x82 LVD (without POR) - 0x02 Other reset - a bit is set if
 * its corresponding reset source caused the reset
 */
/*!
 * @name Constants and macros for entire RCM_SRS register
 */
/*@{*/
#define RCM_RD_SRS(base)         (RCM_SRS_REG(base))
/*@}*/

/*
 * Constants & macros for individual RCM_SRS bitfields
 */

/*!
 * @name Register RCM_SRS, field LVD[1] (RO)
 *
 * If PMC_LVDSC1[LVDRE] is set and the supply drops below the LVD trip voltage,
 * an LVD reset occurs. If PMC_HVDSC1[HVDRE] is set and the supply rises above
 * the HVD trip voltage, an HVD reset occurs. This field is also set by POR.
 *
 * Values:
 * - 0b0 - Reset not caused by LVD trip, HVD trip or POR
 * - 0b1 - Reset caused by LVD trip, HVD trip or POR
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_LVD field. */
#define RCM_RD_SRS_LVD(base) ((RCM_SRS_REG(base) & RCM_SRS_LVD_MASK) >> RCM_SRS_LVD_SHIFT)
#define RCM_BRD_SRS_LVD(base) (BITBAND_ACCESS32(&RCM_SRS_REG(base), RCM_SRS_LVD_SHIFT))
/*@}*/

/*!
 * @name Register RCM_SRS, field LOC[2] (RO)
 *
 * Indicates a reset has been caused by a loss of external clock. The SCG clock
 * monitor must be enabled for a loss of clock to be detected. Refer to the
 * detailed SCG description for information on enabling the clock monitor.
 *
 * Values:
 * - 0b0 - Reset not caused by a loss of external clock.
 * - 0b1 - Reset caused by a loss of external clock.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_LOC field. */
#define RCM_RD_SRS_LOC(base) ((RCM_SRS_REG(base) & RCM_SRS_LOC_MASK) >> RCM_SRS_LOC_SHIFT)
#define RCM_BRD_SRS_LOC(base) (BITBAND_ACCESS32(&RCM_SRS_REG(base), RCM_SRS_LOC_SHIFT))
/*@}*/

/*!
 * @name Register RCM_SRS, field LOL[3] (RO)
 *
 * Indicates a reset has been caused by a loss of lock/clock in the SCG PLL.
 *
 * Values:
 * - 0b0 - Reset not caused by a loss of lock in the PLL
 * - 0b1 - Reset caused by a loss of lock in the PLL
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_LOL field. */
#define RCM_RD_SRS_LOL(base) ((RCM_SRS_REG(base) & RCM_SRS_LOL_MASK) >> RCM_SRS_LOL_SHIFT)
#define RCM_BRD_SRS_LOL(base) (BITBAND_ACCESS32(&RCM_SRS_REG(base), RCM_SRS_LOL_SHIFT))
/*@}*/

/*!
 * @name Register RCM_SRS, field WDOG[5] (RO)
 *
 * Indicates a reset has been caused by the watchdog timer timing out. This
 * reset source can be blocked by disabling the watchdog.
 *
 * Values:
 * - 0b0 - Reset not caused by watchdog timeout
 * - 0b1 - Reset caused by watchdog timeout
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_WDOG field. */
#define RCM_RD_SRS_WDOG(base) ((RCM_SRS_REG(base) & RCM_SRS_WDOG_MASK) >> RCM_SRS_WDOG_SHIFT)
#define RCM_BRD_SRS_WDOG(base) (BITBAND_ACCESS32(&RCM_SRS_REG(base), RCM_SRS_WDOG_SHIFT))
/*@}*/

/*!
 * @name Register RCM_SRS, field PIN[6] (RO)
 *
 * Indicates a reset has been caused by an active-low level on the external
 * RESET (RESET_b) pin.
 *
 * Values:
 * - 0b0 - Reset not caused by external reset pin
 * - 0b1 - Reset caused by external reset pin
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_PIN field. */
#define RCM_RD_SRS_PIN(base) ((RCM_SRS_REG(base) & RCM_SRS_PIN_MASK) >> RCM_SRS_PIN_SHIFT)
#define RCM_BRD_SRS_PIN(base) (BITBAND_ACCESS32(&RCM_SRS_REG(base), RCM_SRS_PIN_SHIFT))
/*@}*/

/*!
 * @name Register RCM_SRS, field POR[7] (RO)
 *
 * Indicates a reset has been caused by the power-on detection logic. Because
 * the internal supply voltage was ramping up at the time, the low-voltage reset
 * (LVD) status bit is also set to indicate that the reset occurred while the
 * internal supply was below the LVD threshold.
 *
 * Values:
 * - 0b0 - Reset not caused by POR
 * - 0b1 - Reset caused by POR
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_POR field. */
#define RCM_RD_SRS_POR(base) ((RCM_SRS_REG(base) & RCM_SRS_POR_MASK) >> RCM_SRS_POR_SHIFT)
#define RCM_BRD_SRS_POR(base) (BITBAND_ACCESS32(&RCM_SRS_REG(base), RCM_SRS_POR_SHIFT))
/*@}*/

/*!
 * @name Register RCM_SRS, field LOCKUP[9] (RO)
 *
 * Indicates a reset has been caused by the ARM core indication of a LOCKUP
 * event.
 *
 * Values:
 * - 0b0 - Reset not caused by core LOCKUP event
 * - 0b1 - Reset caused by core LOCKUP event
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_LOCKUP field. */
#define RCM_RD_SRS_LOCKUP(base) ((RCM_SRS_REG(base) & RCM_SRS_LOCKUP_MASK) >> RCM_SRS_LOCKUP_SHIFT)
#define RCM_BRD_SRS_LOCKUP(base) (BITBAND_ACCESS32(&RCM_SRS_REG(base), RCM_SRS_LOCKUP_SHIFT))
/*@}*/

/*!
 * @name Register RCM_SRS, field SW[10] (RO)
 *
 * Indicates a reset has been caused by software setting of SYSRESETREQ bit in
 * Application Interrupt and Reset Control Register in the ARM core. no
 * SYSRESETREQ bit in CM4 TRM ?
 *
 * Values:
 * - 0b0 - Reset not caused by software setting of SYSRESETREQ bit
 * - 0b1 - Reset caused by software setting of SYSRESETREQ bit
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_SW field. */
#define RCM_RD_SRS_SW(base)  ((RCM_SRS_REG(base) & RCM_SRS_SW_MASK) >> RCM_SRS_SW_SHIFT)
#define RCM_BRD_SRS_SW(base) (BITBAND_ACCESS32(&RCM_SRS_REG(base), RCM_SRS_SW_SHIFT))
/*@}*/

/*!
 * @name Register RCM_SRS, field SACKERR[13] (RO)
 *
 * Indicates that after an attempt to enter Stop mode, a reset has been caused
 * by a failure of one or more peripherals to acknowledge within approximately one
 * second to enter stop mode.
 *
 * Values:
 * - 0b0 - Reset not caused by peripheral failure to acknowledge attempt to
 *     enter stop mode
 * - 0b1 - Reset caused by peripheral failure to acknowledge attempt to enter
 *     stop mode
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_SACKERR field. */
#define RCM_RD_SRS_SACKERR(base) ((RCM_SRS_REG(base) & RCM_SRS_SACKERR_MASK) >> RCM_SRS_SACKERR_SHIFT)
#define RCM_BRD_SRS_SACKERR(base) (BITBAND_ACCESS32(&RCM_SRS_REG(base), RCM_SRS_SACKERR_SHIFT))
/*@}*/

