nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * RCM_RPC - Reset Pin Control register
 ******************************************************************************/

/*!
 * @brief RCM_RPC - Reset Pin Control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is reset on Chip POR only, it is unaffected by other reset
 * types. The bus clock filter is reset when disabled or when entering stop mode. The
 * LPO filter is reset when disabled.
 */
/*!
 * @name Constants and macros for entire RCM_RPC register
 */
/*@{*/
#define RCM_RD_RPC(base)         (RCM_RPC_REG(base))
#define RCM_WR_RPC(base, value)  (RCM_RPC_REG(base) = (value))
#define RCM_RMW_RPC(base, mask, value) (RCM_WR_RPC(base, (RCM_RD_RPC(base) & ~(mask)) | (value)))
#define RCM_SET_RPC(base, value) (RCM_WR_RPC(base, RCM_RD_RPC(base) |  (value)))
#define RCM_CLR_RPC(base, value) (RCM_WR_RPC(base, RCM_RD_RPC(base) & ~(value)))
#define RCM_TOG_RPC(base, value) (RCM_WR_RPC(base, RCM_RD_RPC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual RCM_RPC bitfields
 */

/*!
 * @name Register RCM_RPC, field RSTFLTSRW[1:0] (RW)
 *
 * Selects how the reset pin filter is enabled in run and wait modes.
 *
 * Values:
 * - 0b00 - All filtering disabled
 * - 0b01 - Bus clock filter enabled for normal operation
 * - 0b10 - LPO clock filter enabled for normal operation
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the RCM_RPC_RSTFLTSRW field. */
#define RCM_RD_RPC_RSTFLTSRW(base) ((RCM_RPC_REG(base) & RCM_RPC_RSTFLTSRW_MASK) >> RCM_RPC_RSTFLTSRW_SHIFT)
#define RCM_BRD_RPC_RSTFLTSRW(base) (RCM_RD_RPC_RSTFLTSRW(base))

/*! @brief Set the RSTFLTSRW field to a new value. */
#define RCM_WR_RPC_RSTFLTSRW(base, value) (RCM_RMW_RPC(base, RCM_RPC_RSTFLTSRW_MASK, RCM_RPC_RSTFLTSRW(value)))
#define RCM_BWR_RPC_RSTFLTSRW(base, value) (RCM_WR_RPC_RSTFLTSRW(base, value))
/*@}*/

/*!
 * @name Register RCM_RPC, field RSTFLTSS[2] (RW)
 *
 * Selects how the reset pin filter is enabled in any stop mode.
 *
 * Values:
 * - 0b0 - All filtering disabled
 * - 0b1 - LPO clock filter enabled
 */
/*@{*/
/*! @brief Read current value of the RCM_RPC_RSTFLTSS field. */
#define RCM_RD_RPC_RSTFLTSS(base) ((RCM_RPC_REG(base) & RCM_RPC_RSTFLTSS_MASK) >> RCM_RPC_RSTFLTSS_SHIFT)
#define RCM_BRD_RPC_RSTFLTSS(base) (BITBAND_ACCESS32(&RCM_RPC_REG(base), RCM_RPC_RSTFLTSS_SHIFT))

/*! @brief Set the RSTFLTSS field to a new value. */
#define RCM_WR_RPC_RSTFLTSS(base, value) (RCM_RMW_RPC(base, RCM_RPC_RSTFLTSS_MASK, RCM_RPC_RSTFLTSS(value)))
#define RCM_BWR_RPC_RSTFLTSS(base, value) (BITBAND_ACCESS32(&RCM_RPC_REG(base), RCM_RPC_RSTFLTSS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_RPC, field RSTFLTSEL[12:8] (RW)
 *
 * Selects the reset pin bus clock filter width. Transitions for less than
 * (RSTFLTSEL+1) bus clock cycles are always filtered, transitions equal to
 * (RSTFLTSEL+1) bus clock cycles may be filtered.
 */
/*@{*/
/*! @brief Read current value of the RCM_RPC_RSTFLTSEL field. */
#define RCM_RD_RPC_RSTFLTSEL(base) ((RCM_RPC_REG(base) & RCM_RPC_RSTFLTSEL_MASK) >> RCM_RPC_RSTFLTSEL_SHIFT)
#define RCM_BRD_RPC_RSTFLTSEL(base) (RCM_RD_RPC_RSTFLTSEL(base))

/*! @brief Set the RSTFLTSEL field to a new value. */
#define RCM_WR_RPC_RSTFLTSEL(base, value) (RCM_RMW_RPC(base, RCM_RPC_RSTFLTSEL_MASK, RCM_RPC_RSTFLTSEL(value)))
#define RCM_BWR_RPC_RSTFLTSEL(base, value) (RCM_WR_RPC_RSTFLTSEL(base, value))
/*@}*/

/*******************************************************************************
 * RCM_MR - Mode Register
 ******************************************************************************/

/*!
 * @brief RCM_MR - Mode Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register includes status flags to indicate the state of the mode pins
 * during the last Chip Reset.
 */
/*!
 * @name Constants and macros for entire RCM_MR register
 */
/*@{*/
#define RCM_RD_MR(base)          (RCM_MR_REG(base))
#define RCM_WR_MR(base, value)   (RCM_MR_REG(base) = (value))
#define RCM_RMW_MR(base, mask, value) (RCM_WR_MR(base, (RCM_RD_MR(base) & ~(mask)) | (value)))
#define RCM_SET_MR(base, value)  (RCM_WR_MR(base, RCM_RD_MR(base) |  (value)))
#define RCM_CLR_MR(base, value)  (RCM_WR_MR(base, RCM_RD_MR(base) & ~(value)))
#define RCM_TOG_MR(base, value)  (RCM_WR_MR(base, RCM_RD_MR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual RCM_MR bitfields
 */

/*!
 * @name Register RCM_MR, field BOOTROM[2:1] (W1C)
 *
 * Indicates the boot source, the boot source remains set until the next System
 * Reset or software can write logic one to clear the corresponding mode bit.
 * While either bit is set, the NMI input is disabled and the vector table is
 * relocated to the ROM base address at $1C00_0000. These bits should be cleared by
 * writing logic one before executing any code from either Flash or SRAM.
 *
 * Values:
 * - 0b00 - Boot from Flash
 * - 0b01 - Boot from ROM due to BOOTCFG0 pin assertion
 * - 0b10 - Boot form ROM due to FOPT[7:6] configuration
 * - 0b11 - Boot from ROM due to both BOOTCFG0 pin assertion and FOPT[7:6]
 *     configuration
 */
/*@{*/
/*! @brief Read current value of the RCM_MR_BOOTROM field. */
#define RCM_RD_MR_BOOTROM(base) ((RCM_MR_REG(base) & RCM_MR_BOOTROM_MASK) >> RCM_MR_BOOTROM_SHIFT)
#define RCM_BRD_MR_BOOTROM(base) (RCM_RD_MR_BOOTROM(base))

/*! @brief Set the BOOTROM field to a new value. */
#define RCM_WR_MR_BOOTROM(base, value) (RCM_RMW_MR(base, RCM_MR_BOOTROM_MASK, RCM_MR_BOOTROM(value)))
#define RCM_BWR_MR_BOOTROM(base, value) (RCM_WR_MR_BOOTROM(base, value))
/*@}*/

/*******************************************************************************
 * RCM_FM - Force Mode Register
 ******************************************************************************/

/*!
 * @brief RCM_FM - Force Mode Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The reset values of the bits in the FORCEROM field are for Chip POR only.
 * They are unaffected by other reset types.
 */
/*!
 * @name Constants and macros for entire RCM_FM register
 */
/*@{*/
#define RCM_RD_FM(base)          (RCM_FM_REG(base))
#define RCM_WR_FM(base, value)   (RCM_FM_REG(base) = (value))
#define RCM_RMW_FM(base, mask, value) (RCM_WR_FM(base, (RCM_RD_FM(base) & ~(mask)) | (value)))
#define RCM_SET_FM(base, value)  (RCM_WR_FM(base, RCM_RD_FM(base) |  (value)))
#define RCM_CLR_FM(base, value)  (RCM_WR_FM(base, RCM_RD_FM(base) & ~(value)))
#define RCM_TOG_FM(base, value)  (RCM_WR_FM(base, RCM_RD_FM(base) ^  (value)))
/*@}*/

