nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual RCM_FM bitfields
 */

/*!
 * @name Register RCM_FM, field FORCEROM[2:1] (RW)
 *
 * When either bit is set, will force boot from ROM during all subsequent system
 * resets.
 *
 * Values:
 * - 0b00 - No effect
 * - 0b01 - Force boot from ROM with RCM_MR[1] set.
 * - 0b10 - Force boot from ROM with RCM_MR[2] set.
 * - 0b11 - Force boot from ROM with RCM_MR[2:1] set.
 */
/*@{*/
/*! @brief Read current value of the RCM_FM_FORCEROM field. */
#define RCM_RD_FM_FORCEROM(base) ((RCM_FM_REG(base) & RCM_FM_FORCEROM_MASK) >> RCM_FM_FORCEROM_SHIFT)
#define RCM_BRD_FM_FORCEROM(base) (RCM_RD_FM_FORCEROM(base))

/*! @brief Set the FORCEROM field to a new value. */
#define RCM_WR_FM_FORCEROM(base, value) (RCM_RMW_FM(base, RCM_FM_FORCEROM_MASK, RCM_FM_FORCEROM(value)))
#define RCM_BWR_FM_FORCEROM(base, value) (RCM_WR_FM_FORCEROM(base, value))
/*@}*/

/*******************************************************************************
 * RCM_SSRS - Sticky System Reset Status Register
 ******************************************************************************/

/*!
 * @brief RCM_SSRS - Sticky System Reset Status Register (RW)
 *
 * Reset value: 0x00000082U
 *
 * This register includes status flags to indicate all reset sources since the
 * last POR or LVD Wakeup that have not been cleared by software. Software can
 * clear the status flags by writing a logic one to a flag.
 */
/*!
 * @name Constants and macros for entire RCM_SSRS register
 */
/*@{*/
#define RCM_RD_SSRS(base)        (RCM_SSRS_REG(base))
#define RCM_WR_SSRS(base, value) (RCM_SSRS_REG(base) = (value))
#define RCM_RMW_SSRS(base, mask, value) (RCM_WR_SSRS(base, (RCM_RD_SSRS(base) & ~(mask)) | (value)))
#define RCM_SET_SSRS(base, value) (RCM_WR_SSRS(base, RCM_RD_SSRS(base) |  (value)))
#define RCM_CLR_SSRS(base, value) (RCM_WR_SSRS(base, RCM_RD_SSRS(base) & ~(value)))
#define RCM_TOG_SSRS(base, value) (RCM_WR_SSRS(base, RCM_RD_SSRS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual RCM_SSRS bitfields
 */

/*!
 * @name Register RCM_SSRS, field SLVD[1] (W1C)
 *
 * If PMC_LVDSC1[LVDRE] is set and the supply drops below the LVD trip voltage,
 * an LVD reset occurs. This field is also set by POR.
 *
 * Values:
 * - 0b0 - Reset not caused by LVD trip or POR
 * - 0b1 - Reset caused by LVD trip or POR
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SLVD field. */
#define RCM_RD_SSRS_SLVD(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SLVD_MASK) >> RCM_SSRS_SLVD_SHIFT)
#define RCM_BRD_SSRS_SLVD(base) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SLVD_SHIFT))

/*! @brief Set the SLVD field to a new value. */
#define RCM_WR_SSRS_SLVD(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK), RCM_SSRS_SLVD(value)))
#define RCM_BWR_SSRS_SLVD(base, value) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SLVD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SLOC[2] (W1C)
 *
 * Indicates a reset has been caused by a loss of external clock. The SCG clock
 * monitor must be enabled for a loss of clock to be detected. Refer to the
 * detailed SCG description for information on enabling the clock monitor.
 *
 * Values:
 * - 0b0 - Reset not caused by a loss of external clock.
 * - 0b1 - Reset caused by a loss of external clock.
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SLOC field. */
#define RCM_RD_SSRS_SLOC(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SLOC_MASK) >> RCM_SSRS_SLOC_SHIFT)
#define RCM_BRD_SSRS_SLOC(base) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SLOC_SHIFT))

/*! @brief Set the SLOC field to a new value. */
#define RCM_WR_SSRS_SLOC(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SLOC_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK), RCM_SSRS_SLOC(value)))
#define RCM_BWR_SSRS_SLOC(base, value) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SLOC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SLOL[3] (W1C)
 *
 * Indicates a reset has been caused by a loss of lock in the SCG PLL. See the
 * SCG description for information on the loss-of-clock event.
 *
 * Values:
 * - 0b0 - Reset not caused by a loss of lock in the PLL
 * - 0b1 - Reset caused by a loss of lock in the PLL
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SLOL field. */
#define RCM_RD_SSRS_SLOL(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SLOL_MASK) >> RCM_SSRS_SLOL_SHIFT)
#define RCM_BRD_SSRS_SLOL(base) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SLOL_SHIFT))

/*! @brief Set the SLOL field to a new value. */
#define RCM_WR_SSRS_SLOL(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SLOL_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK), RCM_SSRS_SLOL(value)))
#define RCM_BWR_SSRS_SLOL(base, value) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SLOL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SWDOG[5] (W1C)
 *
 * Indicates a reset has been caused by the watchdog timer timing out. This
 * reset source can be blocked by disabling the watchdog.
 *
 * Values:
 * - 0b0 - Reset not caused by watchdog timeout
 * - 0b1 - Reset caused by watchdog timeout
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SWDOG field. */
#define RCM_RD_SSRS_SWDOG(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SWDOG_MASK) >> RCM_SSRS_SWDOG_SHIFT)
#define RCM_BRD_SSRS_SWDOG(base) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SWDOG_SHIFT))

/*! @brief Set the SWDOG field to a new value. */
#define RCM_WR_SSRS_SWDOG(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SWDOG_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK), RCM_SSRS_SWDOG(value)))
#define RCM_BWR_SSRS_SWDOG(base, value) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SWDOG_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SPIN[6] (W1C)
 *
 * Indicates a reset has been caused by an active-low level on the external
 * RESET (RESET_b) pin.
 *
 * Values:
 * - 0b0 - Reset not caused by external reset pin
 * - 0b1 - Reset caused by external reset pin
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SPIN field. */
#define RCM_RD_SSRS_SPIN(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SPIN_MASK) >> RCM_SSRS_SPIN_SHIFT)
#define RCM_BRD_SSRS_SPIN(base) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SPIN_SHIFT))

