nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the SPIN field to a new value. */
#define RCM_WR_SSRS_SPIN(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SPIN_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK), RCM_SSRS_SPIN(value)))
#define RCM_BWR_SSRS_SPIN(base, value) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SPIN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SPOR[7] (W1C)
 *
 * Indicates a reset has been caused by the power-on detection logic. Because
 * the internal supply voltage was ramping up at the time, the low-voltage reset
 * (LVD) status bit is also set to indicate that the reset occurred while the
 * internal supply was below the LVD threshold.
 *
 * Values:
 * - 0b0 - Reset not caused by POR
 * - 0b1 - Reset caused by POR
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SPOR field. */
#define RCM_RD_SSRS_SPOR(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SPOR_MASK) >> RCM_SSRS_SPOR_SHIFT)
#define RCM_BRD_SSRS_SPOR(base) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SPOR_SHIFT))

/*! @brief Set the SPOR field to a new value. */
#define RCM_WR_SSRS_SPOR(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SPOR_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK), RCM_SSRS_SPOR(value)))
#define RCM_BWR_SSRS_SPOR(base, value) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SPOR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SLOCKUP[9] (W1C)
 *
 * Indicates a reset has been caused by the ARM core indication of a LOCKUP
 * event.
 *
 * Values:
 * - 0b0 - Reset not caused by core LOCKUP event
 * - 0b1 - Reset caused by core LOCKUP event
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SLOCKUP field. */
#define RCM_RD_SSRS_SLOCKUP(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SLOCKUP_MASK) >> RCM_SSRS_SLOCKUP_SHIFT)
#define RCM_BRD_SSRS_SLOCKUP(base) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SLOCKUP_SHIFT))

/*! @brief Set the SLOCKUP field to a new value. */
#define RCM_WR_SSRS_SLOCKUP(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK), RCM_SSRS_SLOCKUP(value)))
#define RCM_BWR_SSRS_SLOCKUP(base, value) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SLOCKUP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SSW[10] (W1C)
 *
 * Indicates a reset has been caused by software setting of SYSRESETREQ bit in
 * Application Interrupt and Reset Control Register in the ARM core. no
 * SYSRESETREQ bit in CM4 TRM ?
 *
 * Values:
 * - 0b0 - Reset not caused by software setting of SYSRESETREQ bit
 * - 0b1 - Reset caused by software setting of SYSRESETREQ bit
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SSW field. */
#define RCM_RD_SSRS_SSW(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SSW_MASK) >> RCM_SSRS_SSW_SHIFT)
#define RCM_BRD_SSRS_SSW(base) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SSW_SHIFT))

/*! @brief Set the SSW field to a new value. */
#define RCM_WR_SSRS_SSW(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SSW_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSACKERR_MASK), RCM_SSRS_SSW(value)))
#define RCM_BWR_SSRS_SSW(base, value) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SSW_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SSACKERR[13] (W1C)
 *
 * Indicates that after an attempt to enter Stop mode, a reset has been caused
 * by a failure of one or more peripherals to acknowledge within approximately one
 * second to enter stop mode.
 *
 * Values:
 * - 0b0 - Reset not caused by peripheral failure to acknowledge attempt to
 *     enter stop mode
 * - 0b1 - Reset caused by peripheral failure to acknowledge attempt to enter
 *     stop mode
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SSACKERR field. */
#define RCM_RD_SSRS_SSACKERR(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SSACKERR_MASK) >> RCM_SSRS_SSACKERR_SHIFT)
#define RCM_BRD_SSRS_SSACKERR(base) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SSACKERR_SHIFT))

/*! @brief Set the SSACKERR field to a new value. */
#define RCM_WR_SSRS_SSACKERR(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SSACKERR_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK), RCM_SSRS_SSACKERR(value)))
#define RCM_BWR_SSRS_SSACKERR(base, value) (BITBAND_ACCESS32(&RCM_SSRS_REG(base), RCM_SSRS_SSACKERR_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * RCM_SRIE - System Reset Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief RCM_SRIE - System Reset Interrupt Enable Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This registers delays the assertion of a system reset for a period of time
 * (DELAY field) while an interrupt is generated. This allows software to perform a
 * graceful shutdown. A Chip POR source cannot be delayed by this feature, and
 * entering Stop mode will terminate the delay. The SRS will only update after the
 * system reset occurs.
 */
/*!
 * @name Constants and macros for entire RCM_SRIE register
 */
/*@{*/
#define RCM_RD_SRIE(base)        (RCM_SRIE_REG(base))
#define RCM_WR_SRIE(base, value) (RCM_SRIE_REG(base) = (value))
#define RCM_RMW_SRIE(base, mask, value) (RCM_WR_SRIE(base, (RCM_RD_SRIE(base) & ~(mask)) | (value)))
#define RCM_SET_SRIE(base, value) (RCM_WR_SRIE(base, RCM_RD_SRIE(base) |  (value)))
#define RCM_CLR_SRIE(base, value) (RCM_WR_SRIE(base, RCM_RD_SRIE(base) & ~(value)))
#define RCM_TOG_SRIE(base, value) (RCM_WR_SRIE(base, RCM_RD_SRIE(base) ^  (value)))
/*@}*/

