nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual RCM_SRIE bitfields
 */

/*!
 * @name Register RCM_SRIE, field DELAY[1:0] (RW)
 *
 * Configures the maximum reset delay time from when the interrupt is asserted
 * and the system reset occurs.
 *
 * Values:
 * - 0b00 - 8 LPO cycles
 * - 0b01 - 32 LPO cycles
 * - 0b10 - 128 LPO cycles
 * - 0b11 - 512 LPO cycles
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_DELAY field. */
#define RCM_RD_SRIE_DELAY(base) ((RCM_SRIE_REG(base) & RCM_SRIE_DELAY_MASK) >> RCM_SRIE_DELAY_SHIFT)
#define RCM_BRD_SRIE_DELAY(base) (RCM_RD_SRIE_DELAY(base))

/*! @brief Set the DELAY field to a new value. */
#define RCM_WR_SRIE_DELAY(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_DELAY_MASK, RCM_SRIE_DELAY(value)))
#define RCM_BWR_SRIE_DELAY(base, value) (RCM_WR_SRIE_DELAY(base, value))
/*@}*/

/*!
 * @name Register RCM_SRIE, field LOC[2] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_LOC field. */
#define RCM_RD_SRIE_LOC(base) ((RCM_SRIE_REG(base) & RCM_SRIE_LOC_MASK) >> RCM_SRIE_LOC_SHIFT)
#define RCM_BRD_SRIE_LOC(base) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_LOC_SHIFT))

/*! @brief Set the LOC field to a new value. */
#define RCM_WR_SRIE_LOC(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_LOC_MASK, RCM_SRIE_LOC(value)))
#define RCM_BWR_SRIE_LOC(base, value) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_LOC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SRIE, field LOL[3] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_LOL field. */
#define RCM_RD_SRIE_LOL(base) ((RCM_SRIE_REG(base) & RCM_SRIE_LOL_MASK) >> RCM_SRIE_LOL_SHIFT)
#define RCM_BRD_SRIE_LOL(base) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_LOL_SHIFT))

/*! @brief Set the LOL field to a new value. */
#define RCM_WR_SRIE_LOL(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_LOL_MASK, RCM_SRIE_LOL(value)))
#define RCM_BWR_SRIE_LOL(base, value) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_LOL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SRIE, field WDOG[5] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_WDOG field. */
#define RCM_RD_SRIE_WDOG(base) ((RCM_SRIE_REG(base) & RCM_SRIE_WDOG_MASK) >> RCM_SRIE_WDOG_SHIFT)
#define RCM_BRD_SRIE_WDOG(base) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_WDOG_SHIFT))

/*! @brief Set the WDOG field to a new value. */
#define RCM_WR_SRIE_WDOG(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_WDOG_MASK, RCM_SRIE_WDOG(value)))
#define RCM_BWR_SRIE_WDOG(base, value) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_WDOG_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SRIE, field PIN[6] (RW)
 *
 * Values:
 * - 0b0 - Reset not caused by external reset pin
 * - 0b1 - Reset caused by external reset pin
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_PIN field. */
#define RCM_RD_SRIE_PIN(base) ((RCM_SRIE_REG(base) & RCM_SRIE_PIN_MASK) >> RCM_SRIE_PIN_SHIFT)
#define RCM_BRD_SRIE_PIN(base) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_PIN_SHIFT))

/*! @brief Set the PIN field to a new value. */
#define RCM_WR_SRIE_PIN(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_PIN_MASK, RCM_SRIE_PIN(value)))
#define RCM_BWR_SRIE_PIN(base, value) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_PIN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SRIE, field GIE[7] (RW)
 *
 * Values:
 * - 0b0 - All interrupt sources disabled.
 * - 0b1 - All interrupt sources enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_GIE field. */
#define RCM_RD_SRIE_GIE(base) ((RCM_SRIE_REG(base) & RCM_SRIE_GIE_MASK) >> RCM_SRIE_GIE_SHIFT)
#define RCM_BRD_SRIE_GIE(base) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_GIE_SHIFT))

/*! @brief Set the GIE field to a new value. */
#define RCM_WR_SRIE_GIE(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_GIE_MASK, RCM_SRIE_GIE(value)))
#define RCM_BWR_SRIE_GIE(base, value) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_GIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SRIE, field LOCKUP[9] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_LOCKUP field. */
#define RCM_RD_SRIE_LOCKUP(base) ((RCM_SRIE_REG(base) & RCM_SRIE_LOCKUP_MASK) >> RCM_SRIE_LOCKUP_SHIFT)
#define RCM_BRD_SRIE_LOCKUP(base) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_LOCKUP_SHIFT))

/*! @brief Set the LOCKUP field to a new value. */
#define RCM_WR_SRIE_LOCKUP(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_LOCKUP_MASK, RCM_SRIE_LOCKUP(value)))
#define RCM_BWR_SRIE_LOCKUP(base, value) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_LOCKUP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SRIE, field SW[10] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_SW field. */
#define RCM_RD_SRIE_SW(base) ((RCM_SRIE_REG(base) & RCM_SRIE_SW_MASK) >> RCM_SRIE_SW_SHIFT)
#define RCM_BRD_SRIE_SW(base) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_SW_SHIFT))

/*! @brief Set the SW field to a new value. */
#define RCM_WR_SRIE_SW(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_SW_MASK, RCM_SRIE_SW(value)))
#define RCM_BWR_SRIE_SW(base, value) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_SW_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RCM_SRIE, field SACKERR[13] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_SACKERR field. */
#define RCM_RD_SRIE_SACKERR(base) ((RCM_SRIE_REG(base) & RCM_SRIE_SACKERR_MASK) >> RCM_SRIE_SACKERR_SHIFT)
#define RCM_BRD_SRIE_SACKERR(base) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_SACKERR_SHIFT))

/*! @brief Set the SACKERR field to a new value. */
#define RCM_WR_SRIE_SACKERR(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_SACKERR_MASK, RCM_SRIE_SACKERR(value)))
#define RCM_BWR_SRIE_SACKERR(base, value) (BITBAND_ACCESS32(&RCM_SRIE_REG(base), RCM_SRIE_SACKERR_SHIFT) = (value))
/*@}*/

