nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * SCG_RCCR - Run Clock Control Register
 ******************************************************************************/

/*!
 * @brief SCG_RCCR - Run Clock Control Register (RW)
 *
 * Reset value: 0x03000001U
 *
 * This register controls the system clock source and the system clock dividers
 * for the core, platform, external and bus clock domains when in Run mode only.
 * This register can only be written using a 32-bit write. Selecting a different
 * clock source when in RUN requires that clock source to be enabled first and be
 * valid before system clocks switch to that clock source. If system clock
 * divide ratios also change when selecting a different clock mode when in RUN, new
 * system clock divide ratios will not take affect until new clock source is valid.
 */
/*!
 * @name Constants and macros for entire SCG_RCCR register
 */
/*@{*/
#define SCG_RD_RCCR(base)        (SCG_RCCR_REG(base))
#define SCG_WR_RCCR(base, value) (SCG_RCCR_REG(base) = (value))
#define SCG_RMW_RCCR(base, mask, value) (SCG_WR_RCCR(base, (SCG_RD_RCCR(base) & ~(mask)) | (value)))
#define SCG_SET_RCCR(base, value) (SCG_WR_RCCR(base, SCG_RD_RCCR(base) |  (value)))
#define SCG_CLR_RCCR(base, value) (SCG_WR_RCCR(base, SCG_RD_RCCR(base) & ~(value)))
#define SCG_TOG_RCCR(base, value) (SCG_WR_RCCR(base, SCG_RD_RCCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_RCCR bitfields
 */

/*!
 * @name Register SCG_RCCR, field DIVSLOW[3:0] (RW)
 *
 * Values:
 * - 0b0000 - Divide-by-1
 * - 0b0001 - Divide-by-2
 * - 0b0010 - Divide-by-3
 * - 0b0011 - Divide-by-4
 * - 0b0100 - Divide-by-5
 * - 0b0101 - Divide-by-6
 * - 0b0110 - Divide-by-7
 * - 0b0111 - Divide-by-8
 * - 0b1000 - Divide-by-9
 * - 0b1001 - Divide-by-10
 * - 0b1010 - Divide-by-11
 * - 0b1011 - Divide-by-12
 * - 0b1100 - Divide-by-13
 * - 0b1101 - Divide-by-14
 * - 0b1110 - Divide-by-15
 * - 0b1111 - Divide-by-16
 */
/*@{*/
/*! @brief Read current value of the SCG_RCCR_DIVSLOW field. */
#define SCG_RD_RCCR_DIVSLOW(base) ((SCG_RCCR_REG(base) & SCG_RCCR_DIVSLOW_MASK) >> SCG_RCCR_DIVSLOW_SHIFT)
#define SCG_BRD_RCCR_DIVSLOW(base) (SCG_RD_RCCR_DIVSLOW(base))

/*! @brief Set the DIVSLOW field to a new value. */
#define SCG_WR_RCCR_DIVSLOW(base, value) (SCG_RMW_RCCR(base, SCG_RCCR_DIVSLOW_MASK, SCG_RCCR_DIVSLOW(value)))
#define SCG_BWR_RCCR_DIVSLOW(base, value) (SCG_WR_RCCR_DIVSLOW(base, value))
/*@}*/

/*!
 * @name Register SCG_RCCR, field DIVBUS[7:4] (RW)
 *
 * Values:
 * - 0b0000 - Divide-by-1
 * - 0b0001 - Divide-by-2
 * - 0b0010 - Divide-by-3
 * - 0b0011 - Divide-by-4
 * - 0b0100 - Divide-by-5
 * - 0b0101 - Divide-by-6
 * - 0b0110 - Divide-by-7
 * - 0b0111 - Divide-by-8
 * - 0b1000 - Divide-by-9
 * - 0b1001 - Divide-by-10
 * - 0b1010 - Divide-by-11
 * - 0b1011 - Divide-by-12
 * - 0b1100 - Divide-by-13
 * - 0b1101 - Divide-by-14
 * - 0b1110 - Divide-by-15
 * - 0b1111 - Divide-by-16
 */
/*@{*/
/*! @brief Read current value of the SCG_RCCR_DIVBUS field. */
#define SCG_RD_RCCR_DIVBUS(base) ((SCG_RCCR_REG(base) & SCG_RCCR_DIVBUS_MASK) >> SCG_RCCR_DIVBUS_SHIFT)
#define SCG_BRD_RCCR_DIVBUS(base) (SCG_RD_RCCR_DIVBUS(base))

/*! @brief Set the DIVBUS field to a new value. */
#define SCG_WR_RCCR_DIVBUS(base, value) (SCG_RMW_RCCR(base, SCG_RCCR_DIVBUS_MASK, SCG_RCCR_DIVBUS(value)))
#define SCG_BWR_RCCR_DIVBUS(base, value) (SCG_WR_RCCR_DIVBUS(base, value))
/*@}*/

/*!
 * @name Register SCG_RCCR, field DIVPLAT[15:12] (RW)
 *
 * Values:
 * - 0b0000 - Divide-by-1
 * - 0b0001 - Reserved
 * - 0b0010 - Reserved
 * - 0b0011 - Reserved
 * - 0b0100 - Reserved
 * - 0b0101 - Reserved
 * - 0b0110 - Reserved
 * - 0b0111 - Reserved
 * - 0b1000 - Reserved
 * - 0b1001 - Reserved
 * - 0b1010 - Reserved
 * - 0b1011 - Reserved
 * - 0b1100 - Reserved
 * - 0b1101 - Reserved
 * - 0b1110 - Reserved
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SCG_RCCR_DIVPLAT field. */
#define SCG_RD_RCCR_DIVPLAT(base) ((SCG_RCCR_REG(base) & SCG_RCCR_DIVPLAT_MASK) >> SCG_RCCR_DIVPLAT_SHIFT)
#define SCG_BRD_RCCR_DIVPLAT(base) (SCG_RD_RCCR_DIVPLAT(base))

/*! @brief Set the DIVPLAT field to a new value. */
#define SCG_WR_RCCR_DIVPLAT(base, value) (SCG_RMW_RCCR(base, SCG_RCCR_DIVPLAT_MASK, SCG_RCCR_DIVPLAT(value)))
#define SCG_BWR_RCCR_DIVPLAT(base, value) (SCG_WR_RCCR_DIVPLAT(base, value))
/*@}*/

/*!
 * @name Register SCG_RCCR, field DIVCORE[19:16] (RW)
 *
 * Values:
 * - 0b0000 - Divide-by-1
 * - 0b0001 - Divide-by-2
 * - 0b0010 - Divide-by-3
 * - 0b0011 - Divide-by-4
 * - 0b0100 - Divide-by-5
 * - 0b0101 - Divide-by-6
 * - 0b0110 - Divide-by-7
 * - 0b0111 - Divide-by-8
 * - 0b1000 - Divide-by-9
 * - 0b1001 - Divide-by-10
 * - 0b1010 - Divide-by-11
 * - 0b1011 - Divide-by-12
 * - 0b1100 - Divide-by-13
 * - 0b1101 - Divide-by-14
 * - 0b1110 - Divide-by-15
 * - 0b1111 - Divide-by-16
 */
/*@{*/
/*! @brief Read current value of the SCG_RCCR_DIVCORE field. */
#define SCG_RD_RCCR_DIVCORE(base) ((SCG_RCCR_REG(base) & SCG_RCCR_DIVCORE_MASK) >> SCG_RCCR_DIVCORE_SHIFT)
#define SCG_BRD_RCCR_DIVCORE(base) (SCG_RD_RCCR_DIVCORE(base))

/*! @brief Set the DIVCORE field to a new value. */
#define SCG_WR_RCCR_DIVCORE(base, value) (SCG_RMW_RCCR(base, SCG_RCCR_DIVCORE_MASK, SCG_RCCR_DIVCORE(value)))
#define SCG_BWR_RCCR_DIVCORE(base, value) (SCG_WR_RCCR_DIVCORE(base, value))
/*@}*/

/*!
 * @name Register SCG_RCCR, field SCS[27:24] (RW)
 *
 * Selects the clock source generating the system clock in Run mode. Attempting
 * to select a clock that is not valid will be ignored. Selecting a different
 * clock source when in Run mode requires that clock source to be enabled first and
 * be valid before system clocks are allowed to switch to that clock source.
 *
 * Values:
 * - 0b0000 - Reserved
 * - 0b0001 - System OSC
 * - 0b0010 - Slow IRC
 * - 0b0011 - Fast IRC
 * - 0b0100 - RTC OSC
 * - 0b0101 - Reserved
 * - 0b0110 - System PLL
 * - 0b0111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SCG_RCCR_SCS field. */
#define SCG_RD_RCCR_SCS(base) ((SCG_RCCR_REG(base) & SCG_RCCR_SCS_MASK) >> SCG_RCCR_SCS_SHIFT)
#define SCG_BRD_RCCR_SCS(base) (SCG_RD_RCCR_SCS(base))

/*! @brief Set the SCS field to a new value. */
#define SCG_WR_RCCR_SCS(base, value) (SCG_RMW_RCCR(base, SCG_RCCR_SCS_MASK, SCG_RCCR_SCS(value)))
#define SCG_BWR_RCCR_SCS(base, value) (SCG_WR_RCCR_SCS(base, value))
/*@}*/

