nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * SCG_HCCR - HSRUN Clock Control Register
 ******************************************************************************/

/*!
 * @brief SCG_HCCR - HSRUN Clock Control Register (RW)
 *
 * Reset value: 0x03000001U
 *
 * This register controls the system clock source and the system clock dividers
 * for the core, platform, external and bus clock domains when in HSRUN mode
 * only. This register can only be written using a 32-bit write. Selecting a
 * different clock source when in HSRUN requires that clock source to be enabled first
 * and be valid before system clocks switch to that clock source. If system clock
 * divide ratios also change when selecting a different clock mode when in HSRUN,
 * new system clock divide ratios will not take affect until new clock source is
 * valid.
 */
/*!
 * @name Constants and macros for entire SCG_HCCR register
 */
/*@{*/
#define SCG_RD_HCCR(base)        (SCG_HCCR_REG(base))
#define SCG_WR_HCCR(base, value) (SCG_HCCR_REG(base) = (value))
#define SCG_RMW_HCCR(base, mask, value) (SCG_WR_HCCR(base, (SCG_RD_HCCR(base) & ~(mask)) | (value)))
#define SCG_SET_HCCR(base, value) (SCG_WR_HCCR(base, SCG_RD_HCCR(base) |  (value)))
#define SCG_CLR_HCCR(base, value) (SCG_WR_HCCR(base, SCG_RD_HCCR(base) & ~(value)))
#define SCG_TOG_HCCR(base, value) (SCG_WR_HCCR(base, SCG_RD_HCCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_HCCR bitfields
 */

/*!
 * @name Register SCG_HCCR, field DIVSLOW[3:0] (RW)
 *
 * Values:
 * - 0b0000 - Divide-by-1
 * - 0b0001 - Divide-by-2
 * - 0b0010 - Divide-by-3
 * - 0b0011 - Divide-by-4
 * - 0b0100 - Divide-by-5
 * - 0b0101 - Divide-by-6
 * - 0b0110 - Divide-by-7
 * - 0b0111 - Divide-by-8
 * - 0b1000 - Divide-by-9
 * - 0b1001 - Divide-by-10
 * - 0b1010 - Divide-by-11
 * - 0b1011 - Divide-by-12
 * - 0b1100 - Divide-by-13
 * - 0b1101 - Divide-by-14
 * - 0b1110 - Divide-by-15
 * - 0b1111 - Divide-by-16
 */
/*@{*/
/*! @brief Read current value of the SCG_HCCR_DIVSLOW field. */
#define SCG_RD_HCCR_DIVSLOW(base) ((SCG_HCCR_REG(base) & SCG_HCCR_DIVSLOW_MASK) >> SCG_HCCR_DIVSLOW_SHIFT)
#define SCG_BRD_HCCR_DIVSLOW(base) (SCG_RD_HCCR_DIVSLOW(base))

/*! @brief Set the DIVSLOW field to a new value. */
#define SCG_WR_HCCR_DIVSLOW(base, value) (SCG_RMW_HCCR(base, SCG_HCCR_DIVSLOW_MASK, SCG_HCCR_DIVSLOW(value)))
#define SCG_BWR_HCCR_DIVSLOW(base, value) (SCG_WR_HCCR_DIVSLOW(base, value))
/*@}*/

/*!
 * @name Register SCG_HCCR, field DIVBUS[7:4] (RW)
 *
 * Values:
 * - 0b0000 - Divide-by-1
 * - 0b0001 - Divide-by-2
 * - 0b0010 - Divide-by-3
 * - 0b0011 - Divide-by-4
 * - 0b0100 - Divide-by-5
 * - 0b0101 - Divide-by-6
 * - 0b0110 - Divide-by-7
 * - 0b0111 - Divide-by-8
 * - 0b1000 - Divide-by-9
 * - 0b1001 - Divide-by-10
 * - 0b1010 - Divide-by-11
 * - 0b1011 - Divide-by-12
 * - 0b1100 - Divide-by-13
 * - 0b1101 - Divide-by-14
 * - 0b1110 - Divide-by-15
 * - 0b1111 - Divide-by-16
 */
/*@{*/
/*! @brief Read current value of the SCG_HCCR_DIVBUS field. */
#define SCG_RD_HCCR_DIVBUS(base) ((SCG_HCCR_REG(base) & SCG_HCCR_DIVBUS_MASK) >> SCG_HCCR_DIVBUS_SHIFT)
#define SCG_BRD_HCCR_DIVBUS(base) (SCG_RD_HCCR_DIVBUS(base))

/*! @brief Set the DIVBUS field to a new value. */
#define SCG_WR_HCCR_DIVBUS(base, value) (SCG_RMW_HCCR(base, SCG_HCCR_DIVBUS_MASK, SCG_HCCR_DIVBUS(value)))
#define SCG_BWR_HCCR_DIVBUS(base, value) (SCG_WR_HCCR_DIVBUS(base, value))
/*@}*/

/*!
 * @name Register SCG_HCCR, field DIVPLAT[15:12] (RW)
 *
 * Values:
 * - 0b0000 - Divide-by-1
 * - 0b0001 - Reserved
 * - 0b0010 - Reserved
 * - 0b0011 - Reserved
 * - 0b0100 - Reserved
 * - 0b0101 - Reserved
 * - 0b0110 - Reserved
 * - 0b0111 - Reserved
 * - 0b1000 - Reserved
 * - 0b1001 - Reserved
 * - 0b1010 - Reserved
 * - 0b1011 - Reserved
 * - 0b1100 - Reserved
 * - 0b1101 - Reserved
 * - 0b1110 - Reserved
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SCG_HCCR_DIVPLAT field. */
#define SCG_RD_HCCR_DIVPLAT(base) ((SCG_HCCR_REG(base) & SCG_HCCR_DIVPLAT_MASK) >> SCG_HCCR_DIVPLAT_SHIFT)
#define SCG_BRD_HCCR_DIVPLAT(base) (SCG_RD_HCCR_DIVPLAT(base))

/*! @brief Set the DIVPLAT field to a new value. */
#define SCG_WR_HCCR_DIVPLAT(base, value) (SCG_RMW_HCCR(base, SCG_HCCR_DIVPLAT_MASK, SCG_HCCR_DIVPLAT(value)))
#define SCG_BWR_HCCR_DIVPLAT(base, value) (SCG_WR_HCCR_DIVPLAT(base, value))
/*@}*/

/*!
 * @name Register SCG_HCCR, field DIVCORE[19:16] (RW)
 *
 * Values:
 * - 0b0000 - Divide-by-1
 * - 0b0001 - Divide-by-2
 * - 0b0010 - Divide-by-3
 * - 0b0011 - Divide-by-4
 * - 0b0100 - Divide-by-5
 * - 0b0101 - Divide-by-6
 * - 0b0110 - Divide-by-7
 * - 0b0111 - Divide-by-8
 * - 0b1000 - Divide-by-9
 * - 0b1001 - Divide-by-10
 * - 0b1010 - Divide-by-11
 * - 0b1011 - Divide-by-12
 * - 0b1100 - Divide-by-13
 * - 0b1101 - Divide-by-14
 * - 0b1110 - Divide-by-15
 * - 0b1111 - Divide-by-16
 */
/*@{*/
/*! @brief Read current value of the SCG_HCCR_DIVCORE field. */
#define SCG_RD_HCCR_DIVCORE(base) ((SCG_HCCR_REG(base) & SCG_HCCR_DIVCORE_MASK) >> SCG_HCCR_DIVCORE_SHIFT)
#define SCG_BRD_HCCR_DIVCORE(base) (SCG_RD_HCCR_DIVCORE(base))

/*! @brief Set the DIVCORE field to a new value. */
#define SCG_WR_HCCR_DIVCORE(base, value) (SCG_RMW_HCCR(base, SCG_HCCR_DIVCORE_MASK, SCG_HCCR_DIVCORE(value)))
#define SCG_BWR_HCCR_DIVCORE(base, value) (SCG_WR_HCCR_DIVCORE(base, value))
/*@}*/

/*!
 * @name Register SCG_HCCR, field SCS[27:24] (RW)
 *
 * Selects the clock source generating the system clock in HSRUN mode.
 * Attempting to select a clock that is not valid will be ignored. Selecting a different
 * clock source when in HSRUN mode will enable that clock source and switch to
 * that clock mode when it is valid.
 *
 * Values:
 * - 0b0000 - Reserved
 * - 0b0001 - System OSC
 * - 0b0010 - Slow IRC
 * - 0b0011 - Fast IRC
 * - 0b0100 - RTC OSC
 * - 0b0101 - Reserved
 * - 0b0110 - System PLL
 * - 0b0111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SCG_HCCR_SCS field. */
#define SCG_RD_HCCR_SCS(base) ((SCG_HCCR_REG(base) & SCG_HCCR_SCS_MASK) >> SCG_HCCR_SCS_SHIFT)
#define SCG_BRD_HCCR_SCS(base) (SCG_RD_HCCR_SCS(base))

/*! @brief Set the SCS field to a new value. */
#define SCG_WR_HCCR_SCS(base, value) (SCG_RMW_HCCR(base, SCG_HCCR_SCS_MASK, SCG_HCCR_SCS(value)))
#define SCG_BWR_HCCR_SCS(base, value) (SCG_WR_HCCR_SCS(base, value))
/*@}*/

