nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * SCG_CLKOUTCNFG - SCG CLKOUT Configuration Register
 ******************************************************************************/

/*!
 * @brief SCG_CLKOUTCNFG - SCG CLKOUT Configuration Register (RW)
 *
 * Reset value: 0x03000000U
 */
/*!
 * @name Constants and macros for entire SCG_CLKOUTCNFG register
 */
/*@{*/
#define SCG_RD_CLKOUTCNFG(base)  (SCG_CLKOUTCNFG_REG(base))
#define SCG_WR_CLKOUTCNFG(base, value) (SCG_CLKOUTCNFG_REG(base) = (value))
#define SCG_RMW_CLKOUTCNFG(base, mask, value) (SCG_WR_CLKOUTCNFG(base, (SCG_RD_CLKOUTCNFG(base) & ~(mask)) | (value)))
#define SCG_SET_CLKOUTCNFG(base, value) (SCG_WR_CLKOUTCNFG(base, SCG_RD_CLKOUTCNFG(base) |  (value)))
#define SCG_CLR_CLKOUTCNFG(base, value) (SCG_WR_CLKOUTCNFG(base, SCG_RD_CLKOUTCNFG(base) & ~(value)))
#define SCG_TOG_CLKOUTCNFG(base, value) (SCG_WR_CLKOUTCNFG(base, SCG_RD_CLKOUTCNFG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_CLKOUTCNFG bitfields
 */

/*!
 * @name Register SCG_CLKOUTCNFG, field CLKOUTSEL[27:24] (RW)
 *
 * Selects the SCG system clock.
 *
 * Values:
 * - 0b0000 - SCG SLOW Clock
 * - 0b0001 - System OSC
 * - 0b0010 - Slow IRC
 * - 0b0011 - Fast IRC
 * - 0b0100 - RTC OSC
 * - 0b0101 - Reserved
 * - 0b0110 - System PLL
 * - 0b0111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SCG_CLKOUTCNFG_CLKOUTSEL field. */
#define SCG_RD_CLKOUTCNFG_CLKOUTSEL(base) ((SCG_CLKOUTCNFG_REG(base) & SCG_CLKOUTCNFG_CLKOUTSEL_MASK) >> SCG_CLKOUTCNFG_CLKOUTSEL_SHIFT)
#define SCG_BRD_CLKOUTCNFG_CLKOUTSEL(base) (SCG_RD_CLKOUTCNFG_CLKOUTSEL(base))

/*! @brief Set the CLKOUTSEL field to a new value. */
#define SCG_WR_CLKOUTCNFG_CLKOUTSEL(base, value) (SCG_RMW_CLKOUTCNFG(base, SCG_CLKOUTCNFG_CLKOUTSEL_MASK, SCG_CLKOUTCNFG_CLKOUTSEL(value)))
#define SCG_BWR_CLKOUTCNFG_CLKOUTSEL(base, value) (SCG_WR_CLKOUTCNFG_CLKOUTSEL(base, value))
/*@}*/

/*******************************************************************************
 * SCG_SOSCCSR - System OSC Control Status Register
 ******************************************************************************/

/*!
 * @brief SCG_SOSCCSR - System OSC Control Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SCG_SOSCCSR register
 */
/*@{*/
#define SCG_RD_SOSCCSR(base)     (SCG_SOSCCSR_REG(base))
#define SCG_WR_SOSCCSR(base, value) (SCG_SOSCCSR_REG(base) = (value))
#define SCG_RMW_SOSCCSR(base, mask, value) (SCG_WR_SOSCCSR(base, (SCG_RD_SOSCCSR(base) & ~(mask)) | (value)))
#define SCG_SET_SOSCCSR(base, value) (SCG_WR_SOSCCSR(base, SCG_RD_SOSCCSR(base) |  (value)))
#define SCG_CLR_SOSCCSR(base, value) (SCG_WR_SOSCCSR(base, SCG_RD_SOSCCSR(base) & ~(value)))
#define SCG_TOG_SOSCCSR(base, value) (SCG_WR_SOSCCSR(base, SCG_RD_SOSCCSR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_SOSCCSR bitfields
 */

/*!
 * @name Register SCG_SOSCCSR, field SOSCEN[0] (RW)
 *
 * Values:
 * - 0b0 - System OSC is disabled
 * - 0b1 - System OSC is enabled
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCSR_SOSCEN field. */
#define SCG_RD_SOSCCSR_SOSCEN(base) ((SCG_SOSCCSR_REG(base) & SCG_SOSCCSR_SOSCEN_MASK) >> SCG_SOSCCSR_SOSCEN_SHIFT)
#define SCG_BRD_SOSCCSR_SOSCEN(base) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCEN_SHIFT))

/*! @brief Set the SOSCEN field to a new value. */
#define SCG_WR_SOSCCSR_SOSCEN(base, value) (SCG_RMW_SOSCCSR(base, (SCG_SOSCCSR_SOSCEN_MASK | SCG_SOSCCSR_SOSCERR_MASK), SCG_SOSCCSR_SOSCEN(value)))
#define SCG_BWR_SOSCCSR_SOSCEN(base, value) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SOSCCSR, field SOSCSTEN[1] (RW)
 *
 * Values:
 * - 0b0 - System OSC is disabled in Stop modes
 * - 0b1 - System OSC is enabled in Stop modes if SOSCEN=1.
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCSR_SOSCSTEN field. */
#define SCG_RD_SOSCCSR_SOSCSTEN(base) ((SCG_SOSCCSR_REG(base) & SCG_SOSCCSR_SOSCSTEN_MASK) >> SCG_SOSCCSR_SOSCSTEN_SHIFT)
#define SCG_BRD_SOSCCSR_SOSCSTEN(base) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCSTEN_SHIFT))

/*! @brief Set the SOSCSTEN field to a new value. */
#define SCG_WR_SOSCCSR_SOSCSTEN(base, value) (SCG_RMW_SOSCCSR(base, (SCG_SOSCCSR_SOSCSTEN_MASK | SCG_SOSCCSR_SOSCERR_MASK), SCG_SOSCCSR_SOSCSTEN(value)))
#define SCG_BWR_SOSCCSR_SOSCSTEN(base, value) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCSTEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SOSCCSR, field SOSCLPEN[2] (RW)
 *
 * SOSCLPEN is required for low power modes. In VLPS mode (low power stop mode),
 * if you want the clock to remain ON, then both SOSCLPEN and SOSCSTEN bits must
 * be enabled.
 *
 * Values:
 * - 0b0 - System OSC is disabled in VLP modes
 * - 0b1 - System OSC is enabled in VLP modes
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCSR_SOSCLPEN field. */
#define SCG_RD_SOSCCSR_SOSCLPEN(base) ((SCG_SOSCCSR_REG(base) & SCG_SOSCCSR_SOSCLPEN_MASK) >> SCG_SOSCCSR_SOSCLPEN_SHIFT)
#define SCG_BRD_SOSCCSR_SOSCLPEN(base) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCLPEN_SHIFT))

/*! @brief Set the SOSCLPEN field to a new value. */
#define SCG_WR_SOSCCSR_SOSCLPEN(base, value) (SCG_RMW_SOSCCSR(base, (SCG_SOSCCSR_SOSCLPEN_MASK | SCG_SOSCCSR_SOSCERR_MASK), SCG_SOSCCSR_SOSCLPEN(value)))
#define SCG_BWR_SOSCCSR_SOSCLPEN(base, value) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCLPEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SOSCCSR, field SOSCERCLKEN[3] (RW)
 *
 * SOSCERCLKEN is required for stop modes.
 *
 * Values:
 * - 0b0 - System OSC 3V ERCLK output clock is disabled.
 * - 0b1 - System OSC 3V ERCLK output clock is enabled when SYSOSC is enabled.
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCSR_SOSCERCLKEN field. */
#define SCG_RD_SOSCCSR_SOSCERCLKEN(base) ((SCG_SOSCCSR_REG(base) & SCG_SOSCCSR_SOSCERCLKEN_MASK) >> SCG_SOSCCSR_SOSCERCLKEN_SHIFT)
#define SCG_BRD_SOSCCSR_SOSCERCLKEN(base) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCERCLKEN_SHIFT))

