nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the SOSCERCLKEN field to a new value. */
#define SCG_WR_SOSCCSR_SOSCERCLKEN(base, value) (SCG_RMW_SOSCCSR(base, (SCG_SOSCCSR_SOSCERCLKEN_MASK | SCG_SOSCCSR_SOSCERR_MASK), SCG_SOSCCSR_SOSCERCLKEN(value)))
#define SCG_BWR_SOSCCSR_SOSCERCLKEN(base, value) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCERCLKEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SOSCCSR, field SOSCCM[16] (RW)
 *
 * Enables the clock monitor, if the clock source is disabled in a low power
 * mode then the clock monitor is also disabled in the low power mode. When the
 * clock monitor is disabled in a low power mode, it remains disabled until the clock
 * valid flag is set following exit from the low power mode.
 *
 * Values:
 * - 0b0 - System OSC Clock Monitor is disabled
 * - 0b1 - System OSC Clock Monitor is enabled
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCSR_SOSCCM field. */
#define SCG_RD_SOSCCSR_SOSCCM(base) ((SCG_SOSCCSR_REG(base) & SCG_SOSCCSR_SOSCCM_MASK) >> SCG_SOSCCSR_SOSCCM_SHIFT)
#define SCG_BRD_SOSCCSR_SOSCCM(base) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCCM_SHIFT))

/*! @brief Set the SOSCCM field to a new value. */
#define SCG_WR_SOSCCSR_SOSCCM(base, value) (SCG_RMW_SOSCCSR(base, (SCG_SOSCCSR_SOSCCM_MASK | SCG_SOSCCSR_SOSCERR_MASK), SCG_SOSCCSR_SOSCCM(value)))
#define SCG_BWR_SOSCCSR_SOSCCM(base, value) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCCM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SOSCCSR, field SOSCCMRE[17] (RW)
 *
 * Values:
 * - 0b0 - Clock Monitor generates interrupt when error detected
 * - 0b1 - Clock Monitor generates reset when error detected
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCSR_SOSCCMRE field. */
#define SCG_RD_SOSCCSR_SOSCCMRE(base) ((SCG_SOSCCSR_REG(base) & SCG_SOSCCSR_SOSCCMRE_MASK) >> SCG_SOSCCSR_SOSCCMRE_SHIFT)
#define SCG_BRD_SOSCCSR_SOSCCMRE(base) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCCMRE_SHIFT))

/*! @brief Set the SOSCCMRE field to a new value. */
#define SCG_WR_SOSCCSR_SOSCCMRE(base, value) (SCG_RMW_SOSCCSR(base, (SCG_SOSCCSR_SOSCCMRE_MASK | SCG_SOSCCSR_SOSCERR_MASK), SCG_SOSCCSR_SOSCCMRE(value)))
#define SCG_BWR_SOSCCSR_SOSCCMRE(base, value) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCCMRE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SOSCCSR, field LK[23] (RW)
 *
 * Values:
 * - 0b0 - Control Status Register can be written.
 * - 0b1 - Control Status Register cannot be written until the next System Reset.
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCSR_LK field. */
#define SCG_RD_SOSCCSR_LK(base) ((SCG_SOSCCSR_REG(base) & SCG_SOSCCSR_LK_MASK) >> SCG_SOSCCSR_LK_SHIFT)
#define SCG_BRD_SOSCCSR_LK(base) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_LK_SHIFT))

/*! @brief Set the LK field to a new value. */
#define SCG_WR_SOSCCSR_LK(base, value) (SCG_RMW_SOSCCSR(base, (SCG_SOSCCSR_LK_MASK | SCG_SOSCCSR_SOSCERR_MASK), SCG_SOSCCSR_LK(value)))
#define SCG_BWR_SOSCCSR_LK(base, value) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_LK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SOSCCSR, field SOSCVLD[24] (RO)
 *
 * Values:
 * - 0b0 - System OSC is not enabled or clock is not valid
 * - 0b1 - System OSC is enabled and output clock is valid
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCSR_SOSCVLD field. */
#define SCG_RD_SOSCCSR_SOSCVLD(base) ((SCG_SOSCCSR_REG(base) & SCG_SOSCCSR_SOSCVLD_MASK) >> SCG_SOSCCSR_SOSCVLD_SHIFT)
#define SCG_BRD_SOSCCSR_SOSCVLD(base) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCVLD_SHIFT))
/*@}*/

/*!
 * @name Register SCG_SOSCCSR, field SOSCSEL[25] (RO)
 *
 * Values:
 * - 0b0 - System OSC is not the system clock source
 * - 0b1 - System OSC is the system clock source
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCSR_SOSCSEL field. */
#define SCG_RD_SOSCCSR_SOSCSEL(base) ((SCG_SOSCCSR_REG(base) & SCG_SOSCCSR_SOSCSEL_MASK) >> SCG_SOSCCSR_SOSCSEL_SHIFT)
#define SCG_BRD_SOSCCSR_SOSCSEL(base) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCSEL_SHIFT))
/*@}*/

/*!
 * @name Register SCG_SOSCCSR, field SOSCERR[26] (W1C)
 *
 * This flag is reset on Chip POR only, software can also clear this flag by
 * writing a logic one.
 *
 * Values:
 * - 0b0 - System OSC Clock Monitor is disabled or has not detected an error
 * - 0b1 - System OSC Clock Monitor is enabled and detected an error
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCSR_SOSCERR field. */
#define SCG_RD_SOSCCSR_SOSCERR(base) ((SCG_SOSCCSR_REG(base) & SCG_SOSCCSR_SOSCERR_MASK) >> SCG_SOSCCSR_SOSCERR_SHIFT)
#define SCG_BRD_SOSCCSR_SOSCERR(base) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCERR_SHIFT))

/*! @brief Set the SOSCERR field to a new value. */
#define SCG_WR_SOSCCSR_SOSCERR(base, value) (SCG_RMW_SOSCCSR(base, SCG_SOSCCSR_SOSCERR_MASK, SCG_SOSCCSR_SOSCERR(value)))
#define SCG_BWR_SOSCCSR_SOSCERR(base, value) (BITBAND_ACCESS32(&SCG_SOSCCSR_REG(base), SCG_SOSCCSR_SOSCERR_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SCG_SOSCDIV - System OSC Divide Register
 ******************************************************************************/

/*!
 * @brief SCG_SOSCDIV - System OSC Divide Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Changes to SOSCDIV should be done when System OSC is disabled to prevent
 * glitches to output divided clock.
 */
/*!
 * @name Constants and macros for entire SCG_SOSCDIV register
 */
/*@{*/
#define SCG_RD_SOSCDIV(base)     (SCG_SOSCDIV_REG(base))
#define SCG_WR_SOSCDIV(base, value) (SCG_SOSCDIV_REG(base) = (value))
#define SCG_RMW_SOSCDIV(base, mask, value) (SCG_WR_SOSCDIV(base, (SCG_RD_SOSCDIV(base) & ~(mask)) | (value)))
#define SCG_SET_SOSCDIV(base, value) (SCG_WR_SOSCDIV(base, SCG_RD_SOSCDIV(base) |  (value)))
#define SCG_CLR_SOSCDIV(base, value) (SCG_WR_SOSCDIV(base, SCG_RD_SOSCDIV(base) & ~(value)))
#define SCG_TOG_SOSCDIV(base, value) (SCG_WR_SOSCDIV(base, SCG_RD_SOSCDIV(base) ^  (value)))
/*@}*/

