nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual SCG_SOSCDIV bitfields
 */

/*!
 * @name Register SCG_SOSCDIV, field SOSCDIV1[2:0] (RW)
 *
 * Clock divider 1 for System OSC. Used to generate the system clock source and
 * by platform clock modules that need an asynchronous clock source.
 *
 * Values:
 * - 0b000 - Output disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCDIV_SOSCDIV1 field. */
#define SCG_RD_SOSCDIV_SOSCDIV1(base) ((SCG_SOSCDIV_REG(base) & SCG_SOSCDIV_SOSCDIV1_MASK) >> SCG_SOSCDIV_SOSCDIV1_SHIFT)
#define SCG_BRD_SOSCDIV_SOSCDIV1(base) (SCG_RD_SOSCDIV_SOSCDIV1(base))

/*! @brief Set the SOSCDIV1 field to a new value. */
#define SCG_WR_SOSCDIV_SOSCDIV1(base, value) (SCG_RMW_SOSCDIV(base, SCG_SOSCDIV_SOSCDIV1_MASK, SCG_SOSCDIV_SOSCDIV1(value)))
#define SCG_BWR_SOSCDIV_SOSCDIV1(base, value) (SCG_WR_SOSCDIV_SOSCDIV1(base, value))
/*@}*/

/*!
 * @name Register SCG_SOSCDIV, field SOSCDIV2[10:8] (RW)
 *
 * Clock divider 2 for System OSC. Used by bus clock modules that need an
 * asynchronous clock source.
 *
 * Values:
 * - 0b000 - Output disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCDIV_SOSCDIV2 field. */
#define SCG_RD_SOSCDIV_SOSCDIV2(base) ((SCG_SOSCDIV_REG(base) & SCG_SOSCDIV_SOSCDIV2_MASK) >> SCG_SOSCDIV_SOSCDIV2_SHIFT)
#define SCG_BRD_SOSCDIV_SOSCDIV2(base) (SCG_RD_SOSCDIV_SOSCDIV2(base))

/*! @brief Set the SOSCDIV2 field to a new value. */
#define SCG_WR_SOSCDIV_SOSCDIV2(base, value) (SCG_RMW_SOSCDIV(base, SCG_SOSCDIV_SOSCDIV2_MASK, SCG_SOSCDIV_SOSCDIV2(value)))
#define SCG_BWR_SOSCDIV_SOSCDIV2(base, value) (SCG_WR_SOSCDIV_SOSCDIV2(base, value))
/*@}*/

/*!
 * @name Register SCG_SOSCDIV, field SOSCDIV3[18:16] (RW)
 *
 * Clock divider 3 for System OSC. Used by slow clock modules that need an
 * asynchronous clock source.
 *
 * Values:
 * - 0b000 - Output disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCDIV_SOSCDIV3 field. */
#define SCG_RD_SOSCDIV_SOSCDIV3(base) ((SCG_SOSCDIV_REG(base) & SCG_SOSCDIV_SOSCDIV3_MASK) >> SCG_SOSCDIV_SOSCDIV3_SHIFT)
#define SCG_BRD_SOSCDIV_SOSCDIV3(base) (SCG_RD_SOSCDIV_SOSCDIV3(base))

/*! @brief Set the SOSCDIV3 field to a new value. */
#define SCG_WR_SOSCDIV_SOSCDIV3(base, value) (SCG_RMW_SOSCDIV(base, SCG_SOSCDIV_SOSCDIV3_MASK, SCG_SOSCDIV_SOSCDIV3(value)))
#define SCG_BWR_SOSCDIV_SOSCDIV3(base, value) (SCG_WR_SOSCDIV_SOSCDIV3(base, value))
/*@}*/

/*******************************************************************************
 * SCG_SOSCCFG - System Oscillator Configuration Register
 ******************************************************************************/

/*!
 * @brief SCG_SOSCCFG - System Oscillator Configuration Register (RW)
 *
 * Reset value: 0x00000010U
 *
 * The SOSCCFG register cannot be changed when the System OSC is enabled. When
 * the System OSC is enabled, writes to this register are ignored, and there is no
 * transfer error.
 */
/*!
 * @name Constants and macros for entire SCG_SOSCCFG register
 */
/*@{*/
#define SCG_RD_SOSCCFG(base)     (SCG_SOSCCFG_REG(base))
#define SCG_WR_SOSCCFG(base, value) (SCG_SOSCCFG_REG(base) = (value))
#define SCG_RMW_SOSCCFG(base, mask, value) (SCG_WR_SOSCCFG(base, (SCG_RD_SOSCCFG(base) & ~(mask)) | (value)))
#define SCG_SET_SOSCCFG(base, value) (SCG_WR_SOSCCFG(base, SCG_RD_SOSCCFG(base) |  (value)))
#define SCG_CLR_SOSCCFG(base, value) (SCG_WR_SOSCCFG(base, SCG_RD_SOSCCFG(base) & ~(value)))
#define SCG_TOG_SOSCCFG(base, value) (SCG_WR_SOSCCFG(base, SCG_RD_SOSCCFG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_SOSCCFG bitfields
 */

/*!
 * @name Register SCG_SOSCCFG, field EREFS[2] (RW)
 *
 * Selects the source for the external reference clock.
 *
 * Values:
 * - 0b0 - External reference clock from PAD pin selected
 * - 0b1 - Internal oscillator of OSC requested.
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCFG_EREFS field. */
#define SCG_RD_SOSCCFG_EREFS(base) ((SCG_SOSCCFG_REG(base) & SCG_SOSCCFG_EREFS_MASK) >> SCG_SOSCCFG_EREFS_SHIFT)
#define SCG_BRD_SOSCCFG_EREFS(base) (BITBAND_ACCESS32(&SCG_SOSCCFG_REG(base), SCG_SOSCCFG_EREFS_SHIFT))

/*! @brief Set the EREFS field to a new value. */
#define SCG_WR_SOSCCFG_EREFS(base, value) (SCG_RMW_SOSCCFG(base, SCG_SOSCCFG_EREFS_MASK, SCG_SOSCCFG_EREFS(value)))
#define SCG_BWR_SOSCCFG_EREFS(base, value) (BITBAND_ACCESS32(&SCG_SOSCCFG_REG(base), SCG_SOSCCFG_EREFS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SOSCCFG, field HGO[3] (RW)
 *
 * Controls the crystal oscillator power mode of operations.
 *
 * Values:
 * - 0b0 - Configure crystal oscillator for low-power operation
 * - 0b1 - Configure crystal oscillator for high-gain operation
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCFG_HGO field. */
#define SCG_RD_SOSCCFG_HGO(base) ((SCG_SOSCCFG_REG(base) & SCG_SOSCCFG_HGO_MASK) >> SCG_SOSCCFG_HGO_SHIFT)
#define SCG_BRD_SOSCCFG_HGO(base) (BITBAND_ACCESS32(&SCG_SOSCCFG_REG(base), SCG_SOSCCFG_HGO_SHIFT))

/*! @brief Set the HGO field to a new value. */
#define SCG_WR_SOSCCFG_HGO(base, value) (SCG_RMW_SOSCCFG(base, SCG_SOSCCFG_HGO_MASK, SCG_SOSCCFG_HGO(value)))
#define SCG_BWR_SOSCCFG_HGO(base, value) (BITBAND_ACCESS32(&SCG_SOSCCFG_REG(base), SCG_SOSCCFG_HGO_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SOSCCFG, field RANGE[5:4] (RW)
 *
 * Selects the frequency range for the system crystal oscillator (OSC)
 *
 * Values:
 * - 0b00 - Reserved
 * - 0b01 - Low frequency range selected for the crystal oscillator of 32 kHz to
 *     40 kHz.
 * - 0b10 - Medium frequency range selected for the crytstal oscillator of 1 MHz
 *     to 8 MHz.
 * - 0b11 - High frequency range selected for the crystal oscillator of 8 MHz to
 *     32 MHz.
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCFG_RANGE field. */
#define SCG_RD_SOSCCFG_RANGE(base) ((SCG_SOSCCFG_REG(base) & SCG_SOSCCFG_RANGE_MASK) >> SCG_SOSCCFG_RANGE_SHIFT)
#define SCG_BRD_SOSCCFG_RANGE(base) (SCG_RD_SOSCCFG_RANGE(base))

