nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the LK field to a new value. */
#define SCG_WR_SIRCCSR_LK(base, value) (SCG_RMW_SIRCCSR(base, SCG_SIRCCSR_LK_MASK, SCG_SIRCCSR_LK(value)))
#define SCG_BWR_SIRCCSR_LK(base, value) (BITBAND_ACCESS32(&SCG_SIRCCSR_REG(base), SCG_SIRCCSR_LK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SIRCCSR, field SIRCVLD[24] (RO)
 *
 * Values:
 * - 0b0 - Slow IRC is not enabled or clock is not valid
 * - 0b1 - Slow IRC is enabled and output clock is valid
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCCSR_SIRCVLD field. */
#define SCG_RD_SIRCCSR_SIRCVLD(base) ((SCG_SIRCCSR_REG(base) & SCG_SIRCCSR_SIRCVLD_MASK) >> SCG_SIRCCSR_SIRCVLD_SHIFT)
#define SCG_BRD_SIRCCSR_SIRCVLD(base) (BITBAND_ACCESS32(&SCG_SIRCCSR_REG(base), SCG_SIRCCSR_SIRCVLD_SHIFT))
/*@}*/

/*!
 * @name Register SCG_SIRCCSR, field SIRCSEL[25] (RO)
 *
 * Values:
 * - 0b0 - Slow IRC is not the system clock source
 * - 0b1 - Slow IRC is the system clock source
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCCSR_SIRCSEL field. */
#define SCG_RD_SIRCCSR_SIRCSEL(base) ((SCG_SIRCCSR_REG(base) & SCG_SIRCCSR_SIRCSEL_MASK) >> SCG_SIRCCSR_SIRCSEL_SHIFT)
#define SCG_BRD_SIRCCSR_SIRCSEL(base) (BITBAND_ACCESS32(&SCG_SIRCCSR_REG(base), SCG_SIRCCSR_SIRCSEL_SHIFT))
/*@}*/

/*******************************************************************************
 * SCG_SIRCDIV - Slow IRC Divide Register
 ******************************************************************************/

/*!
 * @brief SCG_SIRCDIV - Slow IRC Divide Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Changes to SIRCDIV should be done when Slow IRC is disabled to prevent
 * glitches to output divided clock. The recommended method for changing the SIRCDIV
 * Register is: Disable SIRC Configure the SIRCDIV values as needed Enable SIRC
 */
/*!
 * @name Constants and macros for entire SCG_SIRCDIV register
 */
/*@{*/
#define SCG_RD_SIRCDIV(base)     (SCG_SIRCDIV_REG(base))
#define SCG_WR_SIRCDIV(base, value) (SCG_SIRCDIV_REG(base) = (value))
#define SCG_RMW_SIRCDIV(base, mask, value) (SCG_WR_SIRCDIV(base, (SCG_RD_SIRCDIV(base) & ~(mask)) | (value)))
#define SCG_SET_SIRCDIV(base, value) (SCG_WR_SIRCDIV(base, SCG_RD_SIRCDIV(base) |  (value)))
#define SCG_CLR_SIRCDIV(base, value) (SCG_WR_SIRCDIV(base, SCG_RD_SIRCDIV(base) & ~(value)))
#define SCG_TOG_SIRCDIV(base, value) (SCG_WR_SIRCDIV(base, SCG_RD_SIRCDIV(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_SIRCDIV bitfields
 */

/*!
 * @name Register SCG_SIRCDIV, field SIRCDIV1[2:0] (RW)
 *
 * Clock divider 1 for Slow IRC. Used to generate the system clock source and by
 * platform clock modules that need an asynchronous clock source.
 *
 * Values:
 * - 0b000 - Output disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCDIV_SIRCDIV1 field. */
#define SCG_RD_SIRCDIV_SIRCDIV1(base) ((SCG_SIRCDIV_REG(base) & SCG_SIRCDIV_SIRCDIV1_MASK) >> SCG_SIRCDIV_SIRCDIV1_SHIFT)
#define SCG_BRD_SIRCDIV_SIRCDIV1(base) (SCG_RD_SIRCDIV_SIRCDIV1(base))

/*! @brief Set the SIRCDIV1 field to a new value. */
#define SCG_WR_SIRCDIV_SIRCDIV1(base, value) (SCG_RMW_SIRCDIV(base, SCG_SIRCDIV_SIRCDIV1_MASK, SCG_SIRCDIV_SIRCDIV1(value)))
#define SCG_BWR_SIRCDIV_SIRCDIV1(base, value) (SCG_WR_SIRCDIV_SIRCDIV1(base, value))
/*@}*/

/*!
 * @name Register SCG_SIRCDIV, field SIRCDIV2[10:8] (RW)
 *
 * Clock divider 2 for Slow IRC. Used by bus clock modules that need an
 * asynchronous clock source.
 *
 * Values:
 * - 0b000 - Output disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCDIV_SIRCDIV2 field. */
#define SCG_RD_SIRCDIV_SIRCDIV2(base) ((SCG_SIRCDIV_REG(base) & SCG_SIRCDIV_SIRCDIV2_MASK) >> SCG_SIRCDIV_SIRCDIV2_SHIFT)
#define SCG_BRD_SIRCDIV_SIRCDIV2(base) (SCG_RD_SIRCDIV_SIRCDIV2(base))

/*! @brief Set the SIRCDIV2 field to a new value. */
#define SCG_WR_SIRCDIV_SIRCDIV2(base, value) (SCG_RMW_SIRCDIV(base, SCG_SIRCDIV_SIRCDIV2_MASK, SCG_SIRCDIV_SIRCDIV2(value)))
#define SCG_BWR_SIRCDIV_SIRCDIV2(base, value) (SCG_WR_SIRCDIV_SIRCDIV2(base, value))
/*@}*/

/*!
 * @name Register SCG_SIRCDIV, field SIRCDIV3[18:16] (RW)
 *
 * Clock divider 3 for Slow IRC. Used by slow clock modules that need an
 * asynchronous clock source.
 *
 * Values:
 * - 0b000 - Output disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCDIV_SIRCDIV3 field. */
#define SCG_RD_SIRCDIV_SIRCDIV3(base) ((SCG_SIRCDIV_REG(base) & SCG_SIRCDIV_SIRCDIV3_MASK) >> SCG_SIRCDIV_SIRCDIV3_SHIFT)
#define SCG_BRD_SIRCDIV_SIRCDIV3(base) (SCG_RD_SIRCDIV_SIRCDIV3(base))

/*! @brief Set the SIRCDIV3 field to a new value. */
#define SCG_WR_SIRCDIV_SIRCDIV3(base, value) (SCG_RMW_SIRCDIV(base, SCG_SIRCDIV_SIRCDIV3_MASK, SCG_SIRCDIV_SIRCDIV3(value)))
#define SCG_BWR_SIRCDIV_SIRCDIV3(base, value) (SCG_WR_SIRCDIV_SIRCDIV3(base, value))
/*@}*/

/*******************************************************************************
 * SCG_SIRCCFG - Slow IRC Configuration Register
 ******************************************************************************/

/*!
 * @brief SCG_SIRCCFG - Slow IRC Configuration Register (RW)
 *
 * Reset value: 0x00000001U
 *
 * The SIRCCFG register cannot be changed when the slow IRC clock is enabled.
 * When the slow IRC clock is enabled, writes to this register are ignored, and
 * there is no transfer error.
 */
/*!
 * @name Constants and macros for entire SCG_SIRCCFG register
 */
/*@{*/
#define SCG_RD_SIRCCFG(base)     (SCG_SIRCCFG_REG(base))
#define SCG_WR_SIRCCFG(base, value) (SCG_SIRCCFG_REG(base) = (value))
#define SCG_RMW_SIRCCFG(base, mask, value) (SCG_WR_SIRCCFG(base, (SCG_RD_SIRCCFG(base) & ~(mask)) | (value)))
#define SCG_SET_SIRCCFG(base, value) (SCG_WR_SIRCCFG(base, SCG_RD_SIRCCFG(base) |  (value)))
#define SCG_CLR_SIRCCFG(base, value) (SCG_WR_SIRCCFG(base, SCG_RD_SIRCCFG(base) & ~(value)))
#define SCG_TOG_SIRCCFG(base, value) (SCG_WR_SIRCCFG(base, SCG_RD_SIRCCFG(base) ^  (value)))
/*@}*/

