nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual SCG_SIRCCFG bitfields
 */

/*!
 * @name Register SCG_SIRCCFG, field RANGE[0] (RW)
 *
 * Values:
 * - 0b0 - Slow IRC low range clock (2 MHz)
 * - 0b1 - Slow IRC high range clock (8 MHz)
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCCFG_RANGE field. */
#define SCG_RD_SIRCCFG_RANGE(base) ((SCG_SIRCCFG_REG(base) & SCG_SIRCCFG_RANGE_MASK) >> SCG_SIRCCFG_RANGE_SHIFT)
#define SCG_BRD_SIRCCFG_RANGE(base) (BITBAND_ACCESS32(&SCG_SIRCCFG_REG(base), SCG_SIRCCFG_RANGE_SHIFT))

/*! @brief Set the RANGE field to a new value. */
#define SCG_WR_SIRCCFG_RANGE(base, value) (SCG_RMW_SIRCCFG(base, SCG_SIRCCFG_RANGE_MASK, SCG_SIRCCFG_RANGE(value)))
#define SCG_BWR_SIRCCFG_RANGE(base, value) (BITBAND_ACCESS32(&SCG_SIRCCFG_REG(base), SCG_SIRCCFG_RANGE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SCG_SIRCTRIM - Slow IRC Trim Register
 ******************************************************************************/

/*!
 * @brief SCG_SIRCTRIM - Slow IRC Trim Register (RW)
 *
 * Reset value: 0x037F037FU
 *
 * This register is loaded from IFR during reset. It can be written in
 * functional test mode only.
 */
/*!
 * @name Constants and macros for entire SCG_SIRCTRIM register
 */
/*@{*/
#define SCG_RD_SIRCTRIM(base)    (SCG_SIRCTRIM_REG(base))
#define SCG_WR_SIRCTRIM(base, value) (SCG_SIRCTRIM_REG(base) = (value))
#define SCG_RMW_SIRCTRIM(base, mask, value) (SCG_WR_SIRCTRIM(base, (SCG_RD_SIRCTRIM(base) & ~(mask)) | (value)))
#define SCG_SET_SIRCTRIM(base, value) (SCG_WR_SIRCTRIM(base, SCG_RD_SIRCTRIM(base) |  (value)))
#define SCG_CLR_SIRCTRIM(base, value) (SCG_WR_SIRCTRIM(base, SCG_RD_SIRCTRIM(base) & ~(value)))
#define SCG_TOG_SIRCTRIM(base, value) (SCG_WR_SIRCTRIM(base, SCG_RD_SIRCTRIM(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_SIRCTRIM bitfields
 */

/*!
 * @name Register SCG_SIRCTRIM, field TRIMLO[6:0] (RW)
 *
 * Trim High Range trims the Slow IRC low range clock. Writing a large trim
 * value will speed up the clock. Writing a small value will slow down the clock.
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCTRIM_TRIMLO field. */
#define SCG_RD_SIRCTRIM_TRIMLO(base) ((SCG_SIRCTRIM_REG(base) & SCG_SIRCTRIM_TRIMLO_MASK) >> SCG_SIRCTRIM_TRIMLO_SHIFT)
#define SCG_BRD_SIRCTRIM_TRIMLO(base) (SCG_RD_SIRCTRIM_TRIMLO(base))

/*! @brief Set the TRIMLO field to a new value. */
#define SCG_WR_SIRCTRIM_TRIMLO(base, value) (SCG_RMW_SIRCTRIM(base, SCG_SIRCTRIM_TRIMLO_MASK, SCG_SIRCTRIM_TRIMLO(value)))
#define SCG_BWR_SIRCTRIM_TRIMLO(base, value) (SCG_WR_SIRCTRIM_TRIMLO(base, value))
/*@}*/

/*!
 * @name Register SCG_SIRCTRIM, field LOTRIMRNG[9:8] (RW)
 *
 * Trim effect level of SIRC TRIMLO can be enlarged by setting this field. Loads
 * from a factory programmed location when out of reset.
 *
 * Values:
 * - 0b00 - Frequency shift by 10%
 * - 0b01 - No frequency shift
 * - 0b10 - No frequency shift
 * - 0b11 - Frequency shift by -10%
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCTRIM_LOTRIMRNG field. */
#define SCG_RD_SIRCTRIM_LOTRIMRNG(base) ((SCG_SIRCTRIM_REG(base) & SCG_SIRCTRIM_LOTRIMRNG_MASK) >> SCG_SIRCTRIM_LOTRIMRNG_SHIFT)
#define SCG_BRD_SIRCTRIM_LOTRIMRNG(base) (SCG_RD_SIRCTRIM_LOTRIMRNG(base))

/*! @brief Set the LOTRIMRNG field to a new value. */
#define SCG_WR_SIRCTRIM_LOTRIMRNG(base, value) (SCG_RMW_SIRCTRIM(base, SCG_SIRCTRIM_LOTRIMRNG_MASK, SCG_SIRCTRIM_LOTRIMRNG(value)))
#define SCG_BWR_SIRCTRIM_LOTRIMRNG(base, value) (SCG_WR_SIRCTRIM_LOTRIMRNG(base, value))
/*@}*/

/*!
 * @name Register SCG_SIRCTRIM, field TRIMHI[22:16] (RW)
 *
 * Trim High Range trims the Slow IRC high range clock. Writing a large trim
 * value will speed up the clock. Writing a small value will slow down the clock.
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCTRIM_TRIMHI field. */
#define SCG_RD_SIRCTRIM_TRIMHI(base) ((SCG_SIRCTRIM_REG(base) & SCG_SIRCTRIM_TRIMHI_MASK) >> SCG_SIRCTRIM_TRIMHI_SHIFT)
#define SCG_BRD_SIRCTRIM_TRIMHI(base) (SCG_RD_SIRCTRIM_TRIMHI(base))

/*! @brief Set the TRIMHI field to a new value. */
#define SCG_WR_SIRCTRIM_TRIMHI(base, value) (SCG_RMW_SIRCTRIM(base, SCG_SIRCTRIM_TRIMHI_MASK, SCG_SIRCTRIM_TRIMHI(value)))
#define SCG_BWR_SIRCTRIM_TRIMHI(base, value) (SCG_WR_SIRCTRIM_TRIMHI(base, value))
/*@}*/

/*!
 * @name Register SCG_SIRCTRIM, field HTRIMRNG[25:24] (RW)
 *
 * Trim effect level of SIRC TRIMHI can be enlarged by setting this field. Loads
 * from a factory programmed location when out of reset.
 *
 * Values:
 * - 0b00 - Frequency shift by 10%
 * - 0b01 - No frequency shift
 * - 0b10 - No frequency shift
 * - 0b11 - Frequency shift by -10%
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCTRIM_HTRIMRNG field. */
#define SCG_RD_SIRCTRIM_HTRIMRNG(base) ((SCG_SIRCTRIM_REG(base) & SCG_SIRCTRIM_HTRIMRNG_MASK) >> SCG_SIRCTRIM_HTRIMRNG_SHIFT)
#define SCG_BRD_SIRCTRIM_HTRIMRNG(base) (SCG_RD_SIRCTRIM_HTRIMRNG(base))

/*! @brief Set the HTRIMRNG field to a new value. */
#define SCG_WR_SIRCTRIM_HTRIMRNG(base, value) (SCG_RMW_SIRCTRIM(base, SCG_SIRCTRIM_HTRIMRNG_MASK, SCG_SIRCTRIM_HTRIMRNG(value)))
#define SCG_BWR_SIRCTRIM_HTRIMRNG(base, value) (SCG_WR_SIRCTRIM_HTRIMRNG(base, value))
/*@}*/

/*******************************************************************************
 * SCG_FIRCCSR - Fast IRC Control Status Register
 ******************************************************************************/

/*!
 * @brief SCG_FIRCCSR - Fast IRC Control Status Register (RW)
 *
 * Reset value: 0x00000001U
 */
/*!
 * @name Constants and macros for entire SCG_FIRCCSR register
 */
/*@{*/
#define SCG_RD_FIRCCSR(base)     (SCG_FIRCCSR_REG(base))
#define SCG_WR_FIRCCSR(base, value) (SCG_FIRCCSR_REG(base) = (value))
#define SCG_RMW_FIRCCSR(base, mask, value) (SCG_WR_FIRCCSR(base, (SCG_RD_FIRCCSR(base) & ~(mask)) | (value)))
#define SCG_SET_FIRCCSR(base, value) (SCG_WR_FIRCCSR(base, SCG_RD_FIRCCSR(base) |  (value)))
#define SCG_CLR_FIRCCSR(base, value) (SCG_WR_FIRCCSR(base, SCG_RD_FIRCCSR(base) & ~(value)))
#define SCG_TOG_FIRCCSR(base, value) (SCG_WR_FIRCCSR(base, SCG_RD_FIRCCSR(base) ^  (value)))
/*@}*/

