nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual SCG_FIRCCSR bitfields
 */

/*!
 * @name Register SCG_FIRCCSR, field FIRCEN[0] (RW)
 *
 * Values:
 * - 0b0 - Fast IRC is disabled
 * - 0b1 - Fast IRC is enabled
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCEN field. */
#define SCG_RD_FIRCCSR_FIRCEN(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCEN_MASK) >> SCG_FIRCCSR_FIRCEN_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCEN(base) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCEN_SHIFT))

/*! @brief Set the FIRCEN field to a new value. */
#define SCG_WR_FIRCCSR_FIRCEN(base, value) (SCG_RMW_FIRCCSR(base, (SCG_FIRCCSR_FIRCEN_MASK | SCG_FIRCCSR_FIRCERR_MASK), SCG_FIRCCSR_FIRCEN(value)))
#define SCG_BWR_FIRCCSR_FIRCEN(base, value) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field FIRCSTEN[1] (RW)
 *
 * Values:
 * - 0b0 - Fast IRC is disabled in Stop modes. When selected as the reference
 *     clock to the System PLL and if the System PLL is enabled in STOP mode, the
 *     Fast IRC will stay enabled even if FIRCSTEN=0.
 * - 0b1 - Fast IRC is enabled in Stop modes
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCSTEN field. */
#define SCG_RD_FIRCCSR_FIRCSTEN(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCSTEN_MASK) >> SCG_FIRCCSR_FIRCSTEN_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCSTEN(base) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCSTEN_SHIFT))

/*! @brief Set the FIRCSTEN field to a new value. */
#define SCG_WR_FIRCCSR_FIRCSTEN(base, value) (SCG_RMW_FIRCCSR(base, (SCG_FIRCCSR_FIRCSTEN_MASK | SCG_FIRCCSR_FIRCERR_MASK), SCG_FIRCCSR_FIRCSTEN(value)))
#define SCG_BWR_FIRCCSR_FIRCSTEN(base, value) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCSTEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field FIRCREGOFF[2] (RW)
 *
 * Values:
 * - 0b0 - Fast IRC Regulator is enabled.
 * - 0b1 - Fast IRC Regulator is disabled.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCREGOFF field. */
#define SCG_RD_FIRCCSR_FIRCREGOFF(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCREGOFF_MASK) >> SCG_FIRCCSR_FIRCREGOFF_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCREGOFF(base) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCREGOFF_SHIFT))

/*! @brief Set the FIRCREGOFF field to a new value. */
#define SCG_WR_FIRCCSR_FIRCREGOFF(base, value) (SCG_RMW_FIRCCSR(base, (SCG_FIRCCSR_FIRCREGOFF_MASK | SCG_FIRCCSR_FIRCERR_MASK), SCG_FIRCCSR_FIRCREGOFF(value)))
#define SCG_BWR_FIRCCSR_FIRCREGOFF(base, value) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCREGOFF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field FIRCLPEN[3] (RW)
 *
 * Values:
 * - 0b0 - Fast IRC is disabled in VLP modes
 * - 0b1 - Fast IRC is enabled in VLP modes
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCLPEN field. */
#define SCG_RD_FIRCCSR_FIRCLPEN(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCLPEN_MASK) >> SCG_FIRCCSR_FIRCLPEN_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCLPEN(base) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCLPEN_SHIFT))

/*! @brief Set the FIRCLPEN field to a new value. */
#define SCG_WR_FIRCCSR_FIRCLPEN(base, value) (SCG_RMW_FIRCCSR(base, (SCG_FIRCCSR_FIRCLPEN_MASK | SCG_FIRCCSR_FIRCERR_MASK), SCG_FIRCCSR_FIRCLPEN(value)))
#define SCG_BWR_FIRCCSR_FIRCLPEN(base, value) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCLPEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field FIRCTREN[8] (RW)
 *
 * When FIRC is enabled, writes to this field are allowed.
 *
 * Values:
 * - 0b0 - Disable trimming Fast IRC to an external clock source
 * - 0b1 - Enable trimming Fast IRC to an external clock source If FIRC is
 *     enabled, and FIRCTREN=1, the external reference clock always needs to be valid.
 *     If this is a concern, a clock monitor for this external reference clock
 *     can be enabled to generate an interrupt or reset.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCTREN field. */
#define SCG_RD_FIRCCSR_FIRCTREN(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCTREN_MASK) >> SCG_FIRCCSR_FIRCTREN_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCTREN(base) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCTREN_SHIFT))

/*! @brief Set the FIRCTREN field to a new value. */
#define SCG_WR_FIRCCSR_FIRCTREN(base, value) (SCG_RMW_FIRCCSR(base, (SCG_FIRCCSR_FIRCTREN_MASK | SCG_FIRCCSR_FIRCERR_MASK), SCG_FIRCCSR_FIRCTREN(value)))
#define SCG_BWR_FIRCCSR_FIRCTREN(base, value) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCTREN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field FIRCTRUP[9] (RW)
 *
 * Values:
 * - 0b0 - Disable Fast IRC trimming updates
 * - 0b1 - Enable Fast IRC trimming updates
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCTRUP field. */
#define SCG_RD_FIRCCSR_FIRCTRUP(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCTRUP_MASK) >> SCG_FIRCCSR_FIRCTRUP_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCTRUP(base) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCTRUP_SHIFT))

/*! @brief Set the FIRCTRUP field to a new value. */
#define SCG_WR_FIRCCSR_FIRCTRUP(base, value) (SCG_RMW_FIRCCSR(base, (SCG_FIRCCSR_FIRCTRUP_MASK | SCG_FIRCCSR_FIRCERR_MASK), SCG_FIRCCSR_FIRCTRUP(value)))
#define SCG_BWR_FIRCCSR_FIRCTRUP(base, value) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCTRUP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field LK[23] (RW)
 *
 * Values:
 * - 0b0 - Control Status Register can be written.
 * - 0b1 - Control Status Register cannot be written until the next System Reset.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_LK field. */
#define SCG_RD_FIRCCSR_LK(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_LK_MASK) >> SCG_FIRCCSR_LK_SHIFT)
#define SCG_BRD_FIRCCSR_LK(base) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_LK_SHIFT))

