nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the LK field to a new value. */
#define SCG_WR_FIRCCSR_LK(base, value) (SCG_RMW_FIRCCSR(base, (SCG_FIRCCSR_LK_MASK | SCG_FIRCCSR_FIRCERR_MASK), SCG_FIRCCSR_LK(value)))
#define SCG_BWR_FIRCCSR_LK(base, value) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_LK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field FIRCVLD[24] (RO)
 *
 * Values:
 * - 0b0 - Fast IRC is not enabled or clock is not valid
 * - 0b1 - Fast IRC is enabled and output clock is valid
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCVLD field. */
#define SCG_RD_FIRCCSR_FIRCVLD(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCVLD_MASK) >> SCG_FIRCCSR_FIRCVLD_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCVLD(base) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCVLD_SHIFT))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field FIRCSEL[25] (RO)
 *
 * Values:
 * - 0b0 - Fast IRC is not the system clock source
 * - 0b1 - Fast IRC is the system clock source
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCSEL field. */
#define SCG_RD_FIRCCSR_FIRCSEL(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCSEL_MASK) >> SCG_FIRCCSR_FIRCSEL_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCSEL(base) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCSEL_SHIFT))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field FIRCERR[26] (W1C)
 *
 * This flag is reset on Chip POR only, software can also clear this flag by
 * writing a logic one
 *
 * Values:
 * - 0b0 - Error not detected with the Fast IRC trimming.
 * - 0b1 - Error detected with the Fast IRC trimming.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCERR field. */
#define SCG_RD_FIRCCSR_FIRCERR(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCERR_MASK) >> SCG_FIRCCSR_FIRCERR_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCERR(base) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCERR_SHIFT))

/*! @brief Set the FIRCERR field to a new value. */
#define SCG_WR_FIRCCSR_FIRCERR(base, value) (SCG_RMW_FIRCCSR(base, SCG_FIRCCSR_FIRCERR_MASK, SCG_FIRCCSR_FIRCERR(value)))
#define SCG_BWR_FIRCCSR_FIRCERR(base, value) (BITBAND_ACCESS32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCERR_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SCG_FIRCDIV - Fast IRC Divide Register
 ******************************************************************************/

/*!
 * @brief SCG_FIRCDIV - Fast IRC Divide Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Changes to FIRCDIV should be done when FAST IRC is disabled to prevent
 * glitches to output divided clock.
 */
/*!
 * @name Constants and macros for entire SCG_FIRCDIV register
 */
/*@{*/
#define SCG_RD_FIRCDIV(base)     (SCG_FIRCDIV_REG(base))
#define SCG_WR_FIRCDIV(base, value) (SCG_FIRCDIV_REG(base) = (value))
#define SCG_RMW_FIRCDIV(base, mask, value) (SCG_WR_FIRCDIV(base, (SCG_RD_FIRCDIV(base) & ~(mask)) | (value)))
#define SCG_SET_FIRCDIV(base, value) (SCG_WR_FIRCDIV(base, SCG_RD_FIRCDIV(base) |  (value)))
#define SCG_CLR_FIRCDIV(base, value) (SCG_WR_FIRCDIV(base, SCG_RD_FIRCDIV(base) & ~(value)))
#define SCG_TOG_FIRCDIV(base, value) (SCG_WR_FIRCDIV(base, SCG_RD_FIRCDIV(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_FIRCDIV bitfields
 */

/*!
 * @name Register SCG_FIRCDIV, field FIRCDIV1[2:0] (RW)
 *
 * Clock divider 1 for Fast IRC. Used to generate the system clock source and by
 * platform clock modules that need an asynchronous clock source.
 *
 * Values:
 * - 0b000 - Output disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCDIV_FIRCDIV1 field. */
#define SCG_RD_FIRCDIV_FIRCDIV1(base) ((SCG_FIRCDIV_REG(base) & SCG_FIRCDIV_FIRCDIV1_MASK) >> SCG_FIRCDIV_FIRCDIV1_SHIFT)
#define SCG_BRD_FIRCDIV_FIRCDIV1(base) (SCG_RD_FIRCDIV_FIRCDIV1(base))

/*! @brief Set the FIRCDIV1 field to a new value. */
#define SCG_WR_FIRCDIV_FIRCDIV1(base, value) (SCG_RMW_FIRCDIV(base, SCG_FIRCDIV_FIRCDIV1_MASK, SCG_FIRCDIV_FIRCDIV1(value)))
#define SCG_BWR_FIRCDIV_FIRCDIV1(base, value) (SCG_WR_FIRCDIV_FIRCDIV1(base, value))
/*@}*/

/*!
 * @name Register SCG_FIRCDIV, field FIRCDIV2[10:8] (RW)
 *
 * Clock divider 2 for the Fast IRC. Used by bus clock modules that need an
 * asynchronous clock source.
 *
 * Values:
 * - 0b000 - Output disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCDIV_FIRCDIV2 field. */
#define SCG_RD_FIRCDIV_FIRCDIV2(base) ((SCG_FIRCDIV_REG(base) & SCG_FIRCDIV_FIRCDIV2_MASK) >> SCG_FIRCDIV_FIRCDIV2_SHIFT)
#define SCG_BRD_FIRCDIV_FIRCDIV2(base) (SCG_RD_FIRCDIV_FIRCDIV2(base))

/*! @brief Set the FIRCDIV2 field to a new value. */
#define SCG_WR_FIRCDIV_FIRCDIV2(base, value) (SCG_RMW_FIRCDIV(base, SCG_FIRCDIV_FIRCDIV2_MASK, SCG_FIRCDIV_FIRCDIV2(value)))
#define SCG_BWR_FIRCDIV_FIRCDIV2(base, value) (SCG_WR_FIRCDIV_FIRCDIV2(base, value))
/*@}*/

/*!
 * @name Register SCG_FIRCDIV, field FIRCDIV3[18:16] (RW)
 *
 * Clock divider 2 for the Fast IRC. Used by slow clock modules that need an
 * asynchronous clock source.
 *
 * Values:
 * - 0b000 - Clock disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCDIV_FIRCDIV3 field. */
#define SCG_RD_FIRCDIV_FIRCDIV3(base) ((SCG_FIRCDIV_REG(base) & SCG_FIRCDIV_FIRCDIV3_MASK) >> SCG_FIRCDIV_FIRCDIV3_SHIFT)
#define SCG_BRD_FIRCDIV_FIRCDIV3(base) (SCG_RD_FIRCDIV_FIRCDIV3(base))

/*! @brief Set the FIRCDIV3 field to a new value. */
#define SCG_WR_FIRCDIV_FIRCDIV3(base, value) (SCG_RMW_FIRCDIV(base, SCG_FIRCDIV_FIRCDIV3_MASK, SCG_FIRCDIV_FIRCDIV3(value)))
#define SCG_BWR_FIRCDIV_FIRCDIV3(base, value) (SCG_WR_FIRCDIV_FIRCDIV3(base, value))
/*@}*/

