nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * SCG_FIRCCFG - Fast IRC Configuration Register
 ******************************************************************************/

/*!
 * @brief SCG_FIRCCFG - Fast IRC Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The FIRCCFG register cannot be changed when the Fast IRC is enabled. When the
 * Fast IRC is enabled, writes to this register are ignored, and there is no
 * transfer error.
 */
/*!
 * @name Constants and macros for entire SCG_FIRCCFG register
 */
/*@{*/
#define SCG_RD_FIRCCFG(base)     (SCG_FIRCCFG_REG(base))
#define SCG_WR_FIRCCFG(base, value) (SCG_FIRCCFG_REG(base) = (value))
#define SCG_RMW_FIRCCFG(base, mask, value) (SCG_WR_FIRCCFG(base, (SCG_RD_FIRCCFG(base) & ~(mask)) | (value)))
#define SCG_SET_FIRCCFG(base, value) (SCG_WR_FIRCCFG(base, SCG_RD_FIRCCFG(base) |  (value)))
#define SCG_CLR_FIRCCFG(base, value) (SCG_WR_FIRCCFG(base, SCG_RD_FIRCCFG(base) & ~(value)))
#define SCG_TOG_FIRCCFG(base, value) (SCG_WR_FIRCCFG(base, SCG_RD_FIRCCFG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_FIRCCFG bitfields
 */

/*!
 * @name Register SCG_FIRCCFG, field RANGE[1:0] (RW)
 *
 * Values:
 * - 0b00 - Fast IRC is trimmed to 48 MHz
 * - 0b01 - Fast IRC is trimmed to 52 MHz
 * - 0b10 - Fast IRC is trimmed to 56 MHz
 * - 0b11 - Fast IRC is trimmed to 60 MHz
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCFG_RANGE field. */
#define SCG_RD_FIRCCFG_RANGE(base) ((SCG_FIRCCFG_REG(base) & SCG_FIRCCFG_RANGE_MASK) >> SCG_FIRCCFG_RANGE_SHIFT)
#define SCG_BRD_FIRCCFG_RANGE(base) (SCG_RD_FIRCCFG_RANGE(base))

/*! @brief Set the RANGE field to a new value. */
#define SCG_WR_FIRCCFG_RANGE(base, value) (SCG_RMW_FIRCCFG(base, SCG_FIRCCFG_RANGE_MASK, SCG_FIRCCFG_RANGE(value)))
#define SCG_BWR_FIRCCFG_RANGE(base, value) (SCG_WR_FIRCCFG_RANGE(base, value))
/*@}*/

/*******************************************************************************
 * SCG_FIRCTCFG - Fast IRC Trim Configuration Register
 ******************************************************************************/

/*!
 * @brief SCG_FIRCTCFG - Fast IRC Trim Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The FIRCTCFG register cannot be changed when Fast IRC tuning is enabled. When
 * the Fast IRC tuning is enabled, writes to this register are ignored, and
 * there is no transfer error.
 */
/*!
 * @name Constants and macros for entire SCG_FIRCTCFG register
 */
/*@{*/
#define SCG_RD_FIRCTCFG(base)    (SCG_FIRCTCFG_REG(base))
#define SCG_WR_FIRCTCFG(base, value) (SCG_FIRCTCFG_REG(base) = (value))
#define SCG_RMW_FIRCTCFG(base, mask, value) (SCG_WR_FIRCTCFG(base, (SCG_RD_FIRCTCFG(base) & ~(mask)) | (value)))
#define SCG_SET_FIRCTCFG(base, value) (SCG_WR_FIRCTCFG(base, SCG_RD_FIRCTCFG(base) |  (value)))
#define SCG_CLR_FIRCTCFG(base, value) (SCG_WR_FIRCTCFG(base, SCG_RD_FIRCTCFG(base) & ~(value)))
#define SCG_TOG_FIRCTCFG(base, value) (SCG_WR_FIRCTCFG(base, SCG_RD_FIRCTCFG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_FIRCTCFG bitfields
 */

/*!
 * @name Register SCG_FIRCTCFG, field TRIMSRC[1:0] (RW)
 *
 * Configures the external clock source to tune the Fast IRC.
 *
 * Values:
 * - 0b00 - USB0 Start of Frame (1 kHz)
 * - 0b01 - USB1 Start of Frame (1 kHz)
 * - 0b10 - System OSC
 * - 0b11 - RTC OSC (32.768 kHz)
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCTCFG_TRIMSRC field. */
#define SCG_RD_FIRCTCFG_TRIMSRC(base) ((SCG_FIRCTCFG_REG(base) & SCG_FIRCTCFG_TRIMSRC_MASK) >> SCG_FIRCTCFG_TRIMSRC_SHIFT)
#define SCG_BRD_FIRCTCFG_TRIMSRC(base) (SCG_RD_FIRCTCFG_TRIMSRC(base))

/*! @brief Set the TRIMSRC field to a new value. */
#define SCG_WR_FIRCTCFG_TRIMSRC(base, value) (SCG_RMW_FIRCTCFG(base, SCG_FIRCTCFG_TRIMSRC_MASK, SCG_FIRCTCFG_TRIMSRC(value)))
#define SCG_BWR_FIRCTCFG_TRIMSRC(base, value) (SCG_WR_FIRCTCFG_TRIMSRC(base, value))
/*@}*/

/*!
 * @name Register SCG_FIRCTCFG, field TRIMDIV[10:8] (RW)
 *
 * Divide the System OSC down for Fast IRC trimming. The resulting frequency
 * after this divide should be 31.250 kHz.
 *
 * Values:
 * - 0b000 - Divide by 1
 * - 0b001 - Divide by 128
 * - 0b010 - Divide by 256
 * - 0b011 - Divide by 512
 * - 0b100 - Divide by 1024
 * - 0b101 - Divide by 2048
 * - 0b110 - Reserved. Writing this value will result in Divide by 1.
 * - 0b111 - Reserved. Writing this value will result in a Divide by 1.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCTCFG_TRIMDIV field. */
#define SCG_RD_FIRCTCFG_TRIMDIV(base) ((SCG_FIRCTCFG_REG(base) & SCG_FIRCTCFG_TRIMDIV_MASK) >> SCG_FIRCTCFG_TRIMDIV_SHIFT)
#define SCG_BRD_FIRCTCFG_TRIMDIV(base) (SCG_RD_FIRCTCFG_TRIMDIV(base))

/*! @brief Set the TRIMDIV field to a new value. */
#define SCG_WR_FIRCTCFG_TRIMDIV(base, value) (SCG_RMW_FIRCTCFG(base, SCG_FIRCTCFG_TRIMDIV_MASK, SCG_FIRCTCFG_TRIMDIV(value)))
#define SCG_BWR_FIRCTCFG_TRIMDIV(base, value) (SCG_WR_FIRCTCFG_TRIMDIV(base, value))
/*@}*/

/*******************************************************************************
 * SCG_FIRCTRIML - Fast IRC Trim Low Register
 ******************************************************************************/

/*!
 * @brief SCG_FIRCTRIML - Fast IRC Trim Low Register (RW)
 *
 * Reset value: 0x001F3F7FU
 *
 * This register is loaded from IFR during reset. It can be written in
 * functional test mode only. These values are used for trimming the two low range
 * (RANGE=00 and RANGE=01) frequencies of FIRC.
 */
/*!
 * @name Constants and macros for entire SCG_FIRCTRIML register
 */
/*@{*/
#define SCG_RD_FIRCTRIML(base)   (SCG_FIRCTRIML_REG(base))
#define SCG_WR_FIRCTRIML(base, value) (SCG_FIRCTRIML_REG(base) = (value))
#define SCG_RMW_FIRCTRIML(base, mask, value) (SCG_WR_FIRCTRIML(base, (SCG_RD_FIRCTRIML(base) & ~(mask)) | (value)))
#define SCG_SET_FIRCTRIML(base, value) (SCG_WR_FIRCTRIML(base, SCG_RD_FIRCTRIML(base) |  (value)))
#define SCG_CLR_FIRCTRIML(base, value) (SCG_WR_FIRCTRIML(base, SCG_RD_FIRCTRIML(base) & ~(value)))
#define SCG_TOG_FIRCTRIML(base, value) (SCG_WR_FIRCTRIML(base, SCG_RD_FIRCTRIML(base) ^  (value)))
/*@}*/

