nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual SCG_FIRCTRIML bitfields
 */

/*!
 * @name Register SCG_FIRCTRIML, field TRIMFINE[6:0] (RW)
 *
 * Once the Fast IRC Clock is trimmed to 0.7% of the target frequency using the
 * TRIMCOAR bits, the TRIMFINE bits can be used to trim the Fast IRC Clock to
 * within 0.04% of the target frequency.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCTRIML_TRIMFINE field. */
#define SCG_RD_FIRCTRIML_TRIMFINE(base) ((SCG_FIRCTRIML_REG(base) & SCG_FIRCTRIML_TRIMFINE_MASK) >> SCG_FIRCTRIML_TRIMFINE_SHIFT)
#define SCG_BRD_FIRCTRIML_TRIMFINE(base) (SCG_RD_FIRCTRIML_TRIMFINE(base))

/*! @brief Set the TRIMFINE field to a new value. */
#define SCG_WR_FIRCTRIML_TRIMFINE(base, value) (SCG_RMW_FIRCTRIML(base, SCG_FIRCTRIML_TRIMFINE_MASK, SCG_FIRCTRIML_TRIMFINE(value)))
#define SCG_BWR_FIRCTRIML_TRIMFINE(base, value) (SCG_WR_FIRCTRIML_TRIMFINE(base, value))
/*@}*/

/*!
 * @name Register SCG_FIRCTRIML, field TRIMCOAR[13:8] (RW)
 *
 * TRIMCOAR bits are used to coursely trim the Fast IRC Clock to within
 * approximately 0.7% of the target frequency.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCTRIML_TRIMCOAR field. */
#define SCG_RD_FIRCTRIML_TRIMCOAR(base) ((SCG_FIRCTRIML_REG(base) & SCG_FIRCTRIML_TRIMCOAR_MASK) >> SCG_FIRCTRIML_TRIMCOAR_SHIFT)
#define SCG_BRD_FIRCTRIML_TRIMCOAR(base) (SCG_RD_FIRCTRIML_TRIMCOAR(base))

/*! @brief Set the TRIMCOAR field to a new value. */
#define SCG_WR_FIRCTRIML_TRIMCOAR(base, value) (SCG_RMW_FIRCTRIML(base, SCG_FIRCTRIML_TRIMCOAR_MASK, SCG_FIRCTRIML_TRIMCOAR(value)))
#define SCG_BWR_FIRCTRIML_TRIMCOAR(base, value) (SCG_WR_FIRCTRIML_TRIMCOAR(base, value))
/*@}*/

/*!
 * @name Register SCG_FIRCTRIML, field TRIMTEMP[20:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCTRIML_TRIMTEMP field. */
#define SCG_RD_FIRCTRIML_TRIMTEMP(base) ((SCG_FIRCTRIML_REG(base) & SCG_FIRCTRIML_TRIMTEMP_MASK) >> SCG_FIRCTRIML_TRIMTEMP_SHIFT)
#define SCG_BRD_FIRCTRIML_TRIMTEMP(base) (SCG_RD_FIRCTRIML_TRIMTEMP(base))

/*! @brief Set the TRIMTEMP field to a new value. */
#define SCG_WR_FIRCTRIML_TRIMTEMP(base, value) (SCG_RMW_FIRCTRIML(base, SCG_FIRCTRIML_TRIMTEMP_MASK, SCG_FIRCTRIML_TRIMTEMP(value)))
#define SCG_BWR_FIRCTRIML_TRIMTEMP(base, value) (SCG_WR_FIRCTRIML_TRIMTEMP(base, value))
/*@}*/

/*******************************************************************************
 * SCG_FIRCTRIMH - Fast IRC Trim High Register
 ******************************************************************************/

/*!
 * @brief SCG_FIRCTRIMH - Fast IRC Trim High Register (RW)
 *
 * Reset value: 0x001F3F7FU
 *
 * This register is loaded from IFR during reset. It can be written in
 * functional test mode only. These values are used for trimming the two high range
 * (RANGE=10 and RANGE=11) frequencies of FIRC.
 */
/*!
 * @name Constants and macros for entire SCG_FIRCTRIMH register
 */
/*@{*/
#define SCG_RD_FIRCTRIMH(base)   (SCG_FIRCTRIMH_REG(base))
#define SCG_WR_FIRCTRIMH(base, value) (SCG_FIRCTRIMH_REG(base) = (value))
#define SCG_RMW_FIRCTRIMH(base, mask, value) (SCG_WR_FIRCTRIMH(base, (SCG_RD_FIRCTRIMH(base) & ~(mask)) | (value)))
#define SCG_SET_FIRCTRIMH(base, value) (SCG_WR_FIRCTRIMH(base, SCG_RD_FIRCTRIMH(base) |  (value)))
#define SCG_CLR_FIRCTRIMH(base, value) (SCG_WR_FIRCTRIMH(base, SCG_RD_FIRCTRIMH(base) & ~(value)))
#define SCG_TOG_FIRCTRIMH(base, value) (SCG_WR_FIRCTRIMH(base, SCG_RD_FIRCTRIMH(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_FIRCTRIMH bitfields
 */

/*!
 * @name Register SCG_FIRCTRIMH, field TRIMFINE[6:0] (RW)
 *
 * Once the Fast IRC Clock is trimmed to 0.7% of the target frequency using the
 * TRIMCOAR bits, the TRIMFINE bits can be used to trim the Fast IRC Clock to
 * within 0.04% of the target frequency.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCTRIMH_TRIMFINE field. */
#define SCG_RD_FIRCTRIMH_TRIMFINE(base) ((SCG_FIRCTRIMH_REG(base) & SCG_FIRCTRIMH_TRIMFINE_MASK) >> SCG_FIRCTRIMH_TRIMFINE_SHIFT)
#define SCG_BRD_FIRCTRIMH_TRIMFINE(base) (SCG_RD_FIRCTRIMH_TRIMFINE(base))

/*! @brief Set the TRIMFINE field to a new value. */
#define SCG_WR_FIRCTRIMH_TRIMFINE(base, value) (SCG_RMW_FIRCTRIMH(base, SCG_FIRCTRIMH_TRIMFINE_MASK, SCG_FIRCTRIMH_TRIMFINE(value)))
#define SCG_BWR_FIRCTRIMH_TRIMFINE(base, value) (SCG_WR_FIRCTRIMH_TRIMFINE(base, value))
/*@}*/

/*!
 * @name Register SCG_FIRCTRIMH, field TRIMCOAR[13:8] (RW)
 *
 * TRIMCOAR bits are used to coursely trim the Fast IRC Clock to within
 * approximately 0.7% of the target frequency.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCTRIMH_TRIMCOAR field. */
#define SCG_RD_FIRCTRIMH_TRIMCOAR(base) ((SCG_FIRCTRIMH_REG(base) & SCG_FIRCTRIMH_TRIMCOAR_MASK) >> SCG_FIRCTRIMH_TRIMCOAR_SHIFT)
#define SCG_BRD_FIRCTRIMH_TRIMCOAR(base) (SCG_RD_FIRCTRIMH_TRIMCOAR(base))

/*! @brief Set the TRIMCOAR field to a new value. */
#define SCG_WR_FIRCTRIMH_TRIMCOAR(base, value) (SCG_RMW_FIRCTRIMH(base, SCG_FIRCTRIMH_TRIMCOAR_MASK, SCG_FIRCTRIMH_TRIMCOAR(value)))
#define SCG_BWR_FIRCTRIMH_TRIMCOAR(base, value) (SCG_WR_FIRCTRIMH_TRIMCOAR(base, value))
/*@}*/

/*!
 * @name Register SCG_FIRCTRIMH, field TRIMTEMP[20:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCTRIMH_TRIMTEMP field. */
#define SCG_RD_FIRCTRIMH_TRIMTEMP(base) ((SCG_FIRCTRIMH_REG(base) & SCG_FIRCTRIMH_TRIMTEMP_MASK) >> SCG_FIRCTRIMH_TRIMTEMP_SHIFT)
#define SCG_BRD_FIRCTRIMH_TRIMTEMP(base) (SCG_RD_FIRCTRIMH_TRIMTEMP(base))

/*! @brief Set the TRIMTEMP field to a new value. */
#define SCG_WR_FIRCTRIMH_TRIMTEMP(base, value) (SCG_RMW_FIRCTRIMH(base, SCG_FIRCTRIMH_TRIMTEMP_MASK, SCG_FIRCTRIMH_TRIMTEMP(value)))
#define SCG_BWR_FIRCTRIMH_TRIMTEMP(base, value) (SCG_WR_FIRCTRIMH_TRIMTEMP(base, value))
/*@}*/

/*******************************************************************************
 * SCG_FIRCSTAT - Fast IRC Status Register
 ******************************************************************************/

/*!
 * @brief SCG_FIRCSTAT - Fast IRC Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded from IFR during reset. These register gets uploaded
 * with the trim values generated by FIRC auto trimming which is enabled when FIRC
 * is enabled and FIRCTREN=1 and FIRCTRUP=1. When FIRC auto trimming is enabled
 * and FIRCTRUP is off, writes to this register is allowed and values written to
 * this register are used to trim FIRC clock.
 */
/*!
 * @name Constants and macros for entire SCG_FIRCSTAT register
 */
/*@{*/
#define SCG_RD_FIRCSTAT(base)    (SCG_FIRCSTAT_REG(base))
#define SCG_WR_FIRCSTAT(base, value) (SCG_FIRCSTAT_REG(base) = (value))
#define SCG_RMW_FIRCSTAT(base, mask, value) (SCG_WR_FIRCSTAT(base, (SCG_RD_FIRCSTAT(base) & ~(mask)) | (value)))
#define SCG_SET_FIRCSTAT(base, value) (SCG_WR_FIRCSTAT(base, SCG_RD_FIRCSTAT(base) |  (value)))
#define SCG_CLR_FIRCSTAT(base, value) (SCG_WR_FIRCSTAT(base, SCG_RD_FIRCSTAT(base) & ~(value)))
#define SCG_TOG_FIRCSTAT(base, value) (SCG_WR_FIRCSTAT(base, SCG_RD_FIRCSTAT(base) ^  (value)))
/*@}*/

