nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual SCG_FIRCSTAT bitfields
 */

/*!
 * @name Register SCG_FIRCSTAT, field TRIMFINE[6:0] (RW)
 *
 * When FIRC is enabled and auto trimming is enabled (FIRCTREN=1 and FIRCTRUP=1)
 * these register gets uploaded with the trimmed coarse value. When FIRCTRUP=0,
 * these register is writeable to allow user programming of fine trim values.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCSTAT_TRIMFINE field. */
#define SCG_RD_FIRCSTAT_TRIMFINE(base) ((SCG_FIRCSTAT_REG(base) & SCG_FIRCSTAT_TRIMFINE_MASK) >> SCG_FIRCSTAT_TRIMFINE_SHIFT)
#define SCG_BRD_FIRCSTAT_TRIMFINE(base) (SCG_RD_FIRCSTAT_TRIMFINE(base))

/*! @brief Set the TRIMFINE field to a new value. */
#define SCG_WR_FIRCSTAT_TRIMFINE(base, value) (SCG_RMW_FIRCSTAT(base, SCG_FIRCSTAT_TRIMFINE_MASK, SCG_FIRCSTAT_TRIMFINE(value)))
#define SCG_BWR_FIRCSTAT_TRIMFINE(base, value) (SCG_WR_FIRCSTAT_TRIMFINE(base, value))
/*@}*/

/*!
 * @name Register SCG_FIRCSTAT, field TRIMCOAR[15:8] (RW)
 *
 * When FIRC is enabled and auto trimming is enabled (FIRCTREN=1 and FIRCTRUP=1)
 * these register gets uploaded with the trimmed coarse value. When FIRCTRUP=0,
 * these register is writable to allow user programming of coarse trim values.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCSTAT_TRIMCOAR field. */
#define SCG_RD_FIRCSTAT_TRIMCOAR(base) ((SCG_FIRCSTAT_REG(base) & SCG_FIRCSTAT_TRIMCOAR_MASK) >> SCG_FIRCSTAT_TRIMCOAR_SHIFT)
#define SCG_BRD_FIRCSTAT_TRIMCOAR(base) (SCG_RD_FIRCSTAT_TRIMCOAR(base))

/*! @brief Set the TRIMCOAR field to a new value. */
#define SCG_WR_FIRCSTAT_TRIMCOAR(base, value) (SCG_RMW_FIRCSTAT(base, SCG_FIRCSTAT_TRIMCOAR_MASK, SCG_FIRCSTAT_TRIMCOAR(value)))
#define SCG_BWR_FIRCSTAT_TRIMCOAR(base, value) (SCG_WR_FIRCSTAT_TRIMCOAR(base, value))
/*@}*/

/*******************************************************************************
 * SCG_ROSCCSR - RTC OSC Control Status Register
 ******************************************************************************/

/*!
 * @brief SCG_ROSCCSR - RTC OSC Control Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SCG_ROSCCSR register
 */
/*@{*/
#define SCG_RD_ROSCCSR(base)     (SCG_ROSCCSR_REG(base))
#define SCG_WR_ROSCCSR(base, value) (SCG_ROSCCSR_REG(base) = (value))
#define SCG_RMW_ROSCCSR(base, mask, value) (SCG_WR_ROSCCSR(base, (SCG_RD_ROSCCSR(base) & ~(mask)) | (value)))
#define SCG_SET_ROSCCSR(base, value) (SCG_WR_ROSCCSR(base, SCG_RD_ROSCCSR(base) |  (value)))
#define SCG_CLR_ROSCCSR(base, value) (SCG_WR_ROSCCSR(base, SCG_RD_ROSCCSR(base) & ~(value)))
#define SCG_TOG_ROSCCSR(base, value) (SCG_WR_ROSCCSR(base, SCG_RD_ROSCCSR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_ROSCCSR bitfields
 */

/*!
 * @name Register SCG_ROSCCSR, field ROSCCM[16] (RW)
 *
 * Enables the clock monitor, if the clock source is disabled in a low power
 * mode then the clock monitor is also disabled in the low power mode. The clock
 * monitor is always disabled in LLS/VLLS modes. When the clock monitor is disabled
 * in a low power mode, it remains disabled until the clock valid flag is set
 * following exit from the low power mode.
 *
 * Values:
 * - 0b0 - RTC OSC Clock Monitor is disabled
 * - 0b1 - RTC OSC Clock Monitor is enabled
 */
/*@{*/
/*! @brief Read current value of the SCG_ROSCCSR_ROSCCM field. */
#define SCG_RD_ROSCCSR_ROSCCM(base) ((SCG_ROSCCSR_REG(base) & SCG_ROSCCSR_ROSCCM_MASK) >> SCG_ROSCCSR_ROSCCM_SHIFT)
#define SCG_BRD_ROSCCSR_ROSCCM(base) (BITBAND_ACCESS32(&SCG_ROSCCSR_REG(base), SCG_ROSCCSR_ROSCCM_SHIFT))

/*! @brief Set the ROSCCM field to a new value. */
#define SCG_WR_ROSCCSR_ROSCCM(base, value) (SCG_RMW_ROSCCSR(base, (SCG_ROSCCSR_ROSCCM_MASK | SCG_ROSCCSR_ROSCERR_MASK), SCG_ROSCCSR_ROSCCM(value)))
#define SCG_BWR_ROSCCSR_ROSCCM(base, value) (BITBAND_ACCESS32(&SCG_ROSCCSR_REG(base), SCG_ROSCCSR_ROSCCM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_ROSCCSR, field ROSCCMRE[17] (RW)
 *
 * Values:
 * - 0b0 - Clock Monitor generates interrupt when error detected
 * - 0b1 - Clock Monitor generates reset when error detected
 */
/*@{*/
/*! @brief Read current value of the SCG_ROSCCSR_ROSCCMRE field. */
#define SCG_RD_ROSCCSR_ROSCCMRE(base) ((SCG_ROSCCSR_REG(base) & SCG_ROSCCSR_ROSCCMRE_MASK) >> SCG_ROSCCSR_ROSCCMRE_SHIFT)
#define SCG_BRD_ROSCCSR_ROSCCMRE(base) (BITBAND_ACCESS32(&SCG_ROSCCSR_REG(base), SCG_ROSCCSR_ROSCCMRE_SHIFT))

/*! @brief Set the ROSCCMRE field to a new value. */
#define SCG_WR_ROSCCSR_ROSCCMRE(base, value) (SCG_RMW_ROSCCSR(base, (SCG_ROSCCSR_ROSCCMRE_MASK | SCG_ROSCCSR_ROSCERR_MASK), SCG_ROSCCSR_ROSCCMRE(value)))
#define SCG_BWR_ROSCCSR_ROSCCMRE(base, value) (BITBAND_ACCESS32(&SCG_ROSCCSR_REG(base), SCG_ROSCCSR_ROSCCMRE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_ROSCCSR, field LK[23] (RW)
 *
 * Values:
 * - 0b0 - Control Status Register can be written.
 * - 0b1 - Control Status Register cannot be written until the next System Reset.
 */
/*@{*/
/*! @brief Read current value of the SCG_ROSCCSR_LK field. */
#define SCG_RD_ROSCCSR_LK(base) ((SCG_ROSCCSR_REG(base) & SCG_ROSCCSR_LK_MASK) >> SCG_ROSCCSR_LK_SHIFT)
#define SCG_BRD_ROSCCSR_LK(base) (BITBAND_ACCESS32(&SCG_ROSCCSR_REG(base), SCG_ROSCCSR_LK_SHIFT))

/*! @brief Set the LK field to a new value. */
#define SCG_WR_ROSCCSR_LK(base, value) (SCG_RMW_ROSCCSR(base, (SCG_ROSCCSR_LK_MASK | SCG_ROSCCSR_ROSCERR_MASK), SCG_ROSCCSR_LK(value)))
#define SCG_BWR_ROSCCSR_LK(base, value) (BITBAND_ACCESS32(&SCG_ROSCCSR_REG(base), SCG_ROSCCSR_LK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_ROSCCSR, field ROSCVLD[24] (RO)
 *
 * Values:
 * - 0b0 - RTC OSC is not enabled or clock is not valid
 * - 0b1 - RTC OSC is enabled and output clock is valid
 */
/*@{*/
/*! @brief Read current value of the SCG_ROSCCSR_ROSCVLD field. */
#define SCG_RD_ROSCCSR_ROSCVLD(base) ((SCG_ROSCCSR_REG(base) & SCG_ROSCCSR_ROSCVLD_MASK) >> SCG_ROSCCSR_ROSCVLD_SHIFT)
#define SCG_BRD_ROSCCSR_ROSCVLD(base) (BITBAND_ACCESS32(&SCG_ROSCCSR_REG(base), SCG_ROSCCSR_ROSCVLD_SHIFT))
/*@}*/

/*!
 * @name Register SCG_ROSCCSR, field ROSCSEL[25] (RO)
 *
 * Values:
 * - 0b0 - RTC OSC is not the system clock source
 * - 0b1 - RTC OSC is the system clock source
 */
/*@{*/
/*! @brief Read current value of the SCG_ROSCCSR_ROSCSEL field. */
#define SCG_RD_ROSCCSR_ROSCSEL(base) ((SCG_ROSCCSR_REG(base) & SCG_ROSCCSR_ROSCSEL_MASK) >> SCG_ROSCCSR_ROSCSEL_SHIFT)
#define SCG_BRD_ROSCCSR_ROSCSEL(base) (BITBAND_ACCESS32(&SCG_ROSCCSR_REG(base), SCG_ROSCCSR_ROSCSEL_SHIFT))
/*@}*/

/*!
 * @name Register SCG_ROSCCSR, field ROSCERR[26] (W1C)
 *
 * This flag is reset on Chip POR only, software can also clear this flag by
 * writing a logic one
 *
 * Values:
 * - 0b0 - RTC OSC Clock Monitor is disabled or has not detected an error
 * - 0b1 - RTC OSC Clock Monitor is enabled and detected an RTC loss of clock
 *     error
 */
/*@{*/
/*! @brief Read current value of the SCG_ROSCCSR_ROSCERR field. */
#define SCG_RD_ROSCCSR_ROSCERR(base) ((SCG_ROSCCSR_REG(base) & SCG_ROSCCSR_ROSCERR_MASK) >> SCG_ROSCCSR_ROSCERR_SHIFT)
#define SCG_BRD_ROSCCSR_ROSCERR(base) (BITBAND_ACCESS32(&SCG_ROSCCSR_REG(base), SCG_ROSCCSR_ROSCERR_SHIFT))

/*! @brief Set the ROSCERR field to a new value. */
#define SCG_WR_ROSCCSR_ROSCERR(base, value) (SCG_RMW_ROSCCSR(base, SCG_ROSCCSR_ROSCERR_MASK, SCG_ROSCCSR_ROSCERR(value)))
#define SCG_BWR_ROSCCSR_ROSCERR(base, value) (BITBAND_ACCESS32(&SCG_ROSCCSR_REG(base), SCG_ROSCCSR_ROSCERR_SHIFT) = (value))
/*@}*/

