nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * SCG_SPLLCSR - System PLL Control Status Register
 ******************************************************************************/

/*!
 * @brief SCG_SPLLCSR - System PLL Control Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SCG_SPLLCSR register
 */
/*@{*/
#define SCG_RD_SPLLCSR(base)     (SCG_SPLLCSR_REG(base))
#define SCG_WR_SPLLCSR(base, value) (SCG_SPLLCSR_REG(base) = (value))
#define SCG_RMW_SPLLCSR(base, mask, value) (SCG_WR_SPLLCSR(base, (SCG_RD_SPLLCSR(base) & ~(mask)) | (value)))
#define SCG_SET_SPLLCSR(base, value) (SCG_WR_SPLLCSR(base, SCG_RD_SPLLCSR(base) |  (value)))
#define SCG_CLR_SPLLCSR(base, value) (SCG_WR_SPLLCSR(base, SCG_RD_SPLLCSR(base) & ~(value)))
#define SCG_TOG_SPLLCSR(base, value) (SCG_WR_SPLLCSR(base, SCG_RD_SPLLCSR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_SPLLCSR bitfields
 */

/*!
 * @name Register SCG_SPLLCSR, field SPLLEN[0] (RW)
 *
 * Values:
 * - 0b0 - System PLL is disabled
 * - 0b1 - System PLL is enabled
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLEN field. */
#define SCG_RD_SPLLCSR_SPLLEN(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLEN_MASK) >> SCG_SPLLCSR_SPLLEN_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLEN(base) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLEN_SHIFT))

/*! @brief Set the SPLLEN field to a new value. */
#define SCG_WR_SPLLCSR_SPLLEN(base, value) (SCG_RMW_SPLLCSR(base, (SCG_SPLLCSR_SPLLEN_MASK | SCG_SPLLCSR_SPLLERR_MASK), SCG_SPLLCSR_SPLLEN(value)))
#define SCG_BWR_SPLLCSR_SPLLEN(base, value) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field SPLLSTEN[1] (RW)
 *
 * Values:
 * - 0b0 - System PLL is disabled in Stop modes
 * - 0b1 - System PLL is enabled in Stop modes
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLSTEN field. */
#define SCG_RD_SPLLCSR_SPLLSTEN(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLSTEN_MASK) >> SCG_SPLLCSR_SPLLSTEN_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLSTEN(base) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLSTEN_SHIFT))

/*! @brief Set the SPLLSTEN field to a new value. */
#define SCG_WR_SPLLCSR_SPLLSTEN(base, value) (SCG_RMW_SPLLCSR(base, (SCG_SPLLCSR_SPLLSTEN_MASK | SCG_SPLLCSR_SPLLERR_MASK), SCG_SPLLCSR_SPLLSTEN(value)))
#define SCG_BWR_SPLLCSR_SPLLSTEN(base, value) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLSTEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field SPLLCM[16] (RW)
 *
 * Enables the clock monitor, if the clock source is disabled in a low power
 * mode then the clock monitor is also disabled in the low power mode. When the
 * clock monitor is disabled in a low power mode, it remains disabled until the clock
 * valid flag is set following exit from the low power mode.
 *
 * Values:
 * - 0b0 - System PLL Clock Monitor is disabled
 * - 0b1 - System PLL Clock Monitor is enabled
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLCM field. */
#define SCG_RD_SPLLCSR_SPLLCM(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLCM_MASK) >> SCG_SPLLCSR_SPLLCM_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLCM(base) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLCM_SHIFT))

/*! @brief Set the SPLLCM field to a new value. */
#define SCG_WR_SPLLCSR_SPLLCM(base, value) (SCG_RMW_SPLLCSR(base, (SCG_SPLLCSR_SPLLCM_MASK | SCG_SPLLCSR_SPLLERR_MASK), SCG_SPLLCSR_SPLLCM(value)))
#define SCG_BWR_SPLLCSR_SPLLCM(base, value) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLCM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field SPLLCMRE[17] (RW)
 *
 * Values:
 * - 0b0 - Clock Monitor generates interrupt when error detected
 * - 0b1 - Clock Monitor generates reset when error detected
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLCMRE field. */
#define SCG_RD_SPLLCSR_SPLLCMRE(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLCMRE_MASK) >> SCG_SPLLCSR_SPLLCMRE_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLCMRE(base) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLCMRE_SHIFT))

/*! @brief Set the SPLLCMRE field to a new value. */
#define SCG_WR_SPLLCSR_SPLLCMRE(base, value) (SCG_RMW_SPLLCSR(base, (SCG_SPLLCSR_SPLLCMRE_MASK | SCG_SPLLCSR_SPLLERR_MASK), SCG_SPLLCSR_SPLLCMRE(value)))
#define SCG_BWR_SPLLCSR_SPLLCMRE(base, value) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLCMRE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field LK[23] (RW)
 *
 * Values:
 * - 0b0 - Control Status Register can be written.
 * - 0b1 - Control Status Register cannot be written until the next System Reset.
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_LK field. */
#define SCG_RD_SPLLCSR_LK(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_LK_MASK) >> SCG_SPLLCSR_LK_SHIFT)
#define SCG_BRD_SPLLCSR_LK(base) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_LK_SHIFT))

/*! @brief Set the LK field to a new value. */
#define SCG_WR_SPLLCSR_LK(base, value) (SCG_RMW_SPLLCSR(base, (SCG_SPLLCSR_LK_MASK | SCG_SPLLCSR_SPLLERR_MASK), SCG_SPLLCSR_LK(value)))
#define SCG_BWR_SPLLCSR_LK(base, value) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_LK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field SPLLVLD[24] (RO)
 *
 * Indicates when the SPLL clock is valid. Disabling the SPLL or a SOSC error
 * when selected as the reference clock to the SPLL will cause the SPLLVLD to clear
 * without setting SPLLERROR.
 *
 * Values:
 * - 0b0 - System PLL is not enabled or clock is not valid
 * - 0b1 - System PLL is enabled and output clock is valid
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLVLD field. */
#define SCG_RD_SPLLCSR_SPLLVLD(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLVLD_MASK) >> SCG_SPLLCSR_SPLLVLD_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLVLD(base) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLVLD_SHIFT))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field SPLLSEL[25] (RO)
 *
 * Values:
 * - 0b0 - System PLL is not the system clock source
 * - 0b1 - System PLL is the system clock source
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLSEL field. */
#define SCG_RD_SPLLCSR_SPLLSEL(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLSEL_MASK) >> SCG_SPLLCSR_SPLLSEL_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLSEL(base) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLSEL_SHIFT))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field SPLLERR[26] (W1C)
 *
 * This flag is reset on Chip POR only, software can also clear this flag by
 * writing a logic one
 *
 * Values:
 * - 0b0 - System PLL Clock Monitor is disabled or has not detected an error
 * - 0b1 - System PLL Clock Monitor is enabled and detected an error. System PLL
 *     Clock Error flag will not set when System OSC is selected as its source
 *     and SOSCERR has set.
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLERR field. */
#define SCG_RD_SPLLCSR_SPLLERR(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLERR_MASK) >> SCG_SPLLCSR_SPLLERR_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLERR(base) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLERR_SHIFT))

/*! @brief Set the SPLLERR field to a new value. */
#define SCG_WR_SPLLCSR_SPLLERR(base, value) (SCG_RMW_SPLLCSR(base, SCG_SPLLCSR_SPLLERR_MASK, SCG_SPLLCSR_SPLLERR(value)))
#define SCG_BWR_SPLLCSR_SPLLERR(base, value) (BITBAND_ACCESS32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLERR_SHIFT) = (value))
/*@}*/

