nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * SCG_SPLLDIV - System PLL Divide Register
 ******************************************************************************/

/*!
 * @brief SCG_SPLLDIV - System PLL Divide Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Changes to SPLLDIV should be done when System PLL is disabled to prevent
 * glitches to output divided clock.
 */
/*!
 * @name Constants and macros for entire SCG_SPLLDIV register
 */
/*@{*/
#define SCG_RD_SPLLDIV(base)     (SCG_SPLLDIV_REG(base))
#define SCG_WR_SPLLDIV(base, value) (SCG_SPLLDIV_REG(base) = (value))
#define SCG_RMW_SPLLDIV(base, mask, value) (SCG_WR_SPLLDIV(base, (SCG_RD_SPLLDIV(base) & ~(mask)) | (value)))
#define SCG_SET_SPLLDIV(base, value) (SCG_WR_SPLLDIV(base, SCG_RD_SPLLDIV(base) |  (value)))
#define SCG_CLR_SPLLDIV(base, value) (SCG_WR_SPLLDIV(base, SCG_RD_SPLLDIV(base) & ~(value)))
#define SCG_TOG_SPLLDIV(base, value) (SCG_WR_SPLLDIV(base, SCG_RD_SPLLDIV(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_SPLLDIV bitfields
 */

/*!
 * @name Register SCG_SPLLDIV, field SPLLDIV1[2:0] (RW)
 *
 * Clock divider 1 for System PLL. Used to generate the system clock source used
 * by platform clock modules that need an asynchronous clock source.
 *
 * Values:
 * - 0b000 - Clock disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLDIV_SPLLDIV1 field. */
#define SCG_RD_SPLLDIV_SPLLDIV1(base) ((SCG_SPLLDIV_REG(base) & SCG_SPLLDIV_SPLLDIV1_MASK) >> SCG_SPLLDIV_SPLLDIV1_SHIFT)
#define SCG_BRD_SPLLDIV_SPLLDIV1(base) (SCG_RD_SPLLDIV_SPLLDIV1(base))

/*! @brief Set the SPLLDIV1 field to a new value. */
#define SCG_WR_SPLLDIV_SPLLDIV1(base, value) (SCG_RMW_SPLLDIV(base, SCG_SPLLDIV_SPLLDIV1_MASK, SCG_SPLLDIV_SPLLDIV1(value)))
#define SCG_BWR_SPLLDIV_SPLLDIV1(base, value) (SCG_WR_SPLLDIV_SPLLDIV1(base, value))
/*@}*/

/*!
 * @name Register SCG_SPLLDIV, field SPLLDIV2[10:8] (RW)
 *
 * Clock divider 2 for System PLL. Used by bus clock modules that need an
 * asynchronous clock source.
 *
 * Values:
 * - 0b000 - Clock disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLDIV_SPLLDIV2 field. */
#define SCG_RD_SPLLDIV_SPLLDIV2(base) ((SCG_SPLLDIV_REG(base) & SCG_SPLLDIV_SPLLDIV2_MASK) >> SCG_SPLLDIV_SPLLDIV2_SHIFT)
#define SCG_BRD_SPLLDIV_SPLLDIV2(base) (SCG_RD_SPLLDIV_SPLLDIV2(base))

/*! @brief Set the SPLLDIV2 field to a new value. */
#define SCG_WR_SPLLDIV_SPLLDIV2(base, value) (SCG_RMW_SPLLDIV(base, SCG_SPLLDIV_SPLLDIV2_MASK, SCG_SPLLDIV_SPLLDIV2(value)))
#define SCG_BWR_SPLLDIV_SPLLDIV2(base, value) (SCG_WR_SPLLDIV_SPLLDIV2(base, value))
/*@}*/

/*!
 * @name Register SCG_SPLLDIV, field SPLLDIV3[18:16] (RW)
 *
 * Clock divider 3 for System PLL. Used by slow clock modules that need an
 * asynchronous clock source.
 *
 * Values:
 * - 0b000 - Clock disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLDIV_SPLLDIV3 field. */
#define SCG_RD_SPLLDIV_SPLLDIV3(base) ((SCG_SPLLDIV_REG(base) & SCG_SPLLDIV_SPLLDIV3_MASK) >> SCG_SPLLDIV_SPLLDIV3_SHIFT)
#define SCG_BRD_SPLLDIV_SPLLDIV3(base) (SCG_RD_SPLLDIV_SPLLDIV3(base))

/*! @brief Set the SPLLDIV3 field to a new value. */
#define SCG_WR_SPLLDIV_SPLLDIV3(base, value) (SCG_RMW_SPLLDIV(base, SCG_SPLLDIV_SPLLDIV3_MASK, SCG_SPLLDIV_SPLLDIV3(value)))
#define SCG_BWR_SPLLDIV_SPLLDIV3(base, value) (SCG_WR_SPLLDIV_SPLLDIV3(base, value))
/*@}*/

/*******************************************************************************
 * SCG_SPLLCFG - System PLL Configuration Register
 ******************************************************************************/

/*!
 * @brief SCG_SPLLCFG - System PLL Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The SPLLCFG register cannot be changed when the System PLL is enabled. When
 * the System PLL is enabled, writes to this register are ignored, and there is no
 * transfer error.
 */
/*!
 * @name Constants and macros for entire SCG_SPLLCFG register
 */
/*@{*/
#define SCG_RD_SPLLCFG(base)     (SCG_SPLLCFG_REG(base))
#define SCG_WR_SPLLCFG(base, value) (SCG_SPLLCFG_REG(base) = (value))
#define SCG_RMW_SPLLCFG(base, mask, value) (SCG_WR_SPLLCFG(base, (SCG_RD_SPLLCFG(base) & ~(mask)) | (value)))
#define SCG_SET_SPLLCFG(base, value) (SCG_WR_SPLLCFG(base, SCG_RD_SPLLCFG(base) |  (value)))
#define SCG_CLR_SPLLCFG(base, value) (SCG_WR_SPLLCFG(base, SCG_RD_SPLLCFG(base) & ~(value)))
#define SCG_TOG_SPLLCFG(base, value) (SCG_WR_SPLLCFG(base, SCG_RD_SPLLCFG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SCG_SPLLCFG bitfields
 */

/*!
 * @name Register SCG_SPLLCFG, field SOURCE[0] (RW)
 *
 * Configures the input clock source for the System PLL.
 *
 * Values:
 * - 0b0 - System OSC
 * - 0b1 - Fast IRC
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCFG_SOURCE field. */
#define SCG_RD_SPLLCFG_SOURCE(base) ((SCG_SPLLCFG_REG(base) & SCG_SPLLCFG_SOURCE_MASK) >> SCG_SPLLCFG_SOURCE_SHIFT)
#define SCG_BRD_SPLLCFG_SOURCE(base) (BITBAND_ACCESS32(&SCG_SPLLCFG_REG(base), SCG_SPLLCFG_SOURCE_SHIFT))

/*! @brief Set the SOURCE field to a new value. */
#define SCG_WR_SPLLCFG_SOURCE(base, value) (SCG_RMW_SPLLCFG(base, SCG_SPLLCFG_SOURCE_MASK, SCG_SPLLCFG_SOURCE(value)))
#define SCG_BWR_SPLLCFG_SOURCE(base, value) (BITBAND_ACCESS32(&SCG_SPLLCFG_REG(base), SCG_SPLLCFG_SOURCE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SCG_SPLLCFG, field PREDIV[10:8] (RW)
 *
 * Selects the amount to divide down the reference clock for the System PLL. The
 * resulting frequency must be in the range of 8 MHz to 32 MHz. System PLL
 * Reference Divide Factor PERDIV Divide Factor 000 1 001 2 010 3 011 4 100 5 101 6
 * 110 7 111 8
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCFG_PREDIV field. */
#define SCG_RD_SPLLCFG_PREDIV(base) ((SCG_SPLLCFG_REG(base) & SCG_SPLLCFG_PREDIV_MASK) >> SCG_SPLLCFG_PREDIV_SHIFT)
#define SCG_BRD_SPLLCFG_PREDIV(base) (SCG_RD_SPLLCFG_PREDIV(base))

/*! @brief Set the PREDIV field to a new value. */
#define SCG_WR_SPLLCFG_PREDIV(base, value) (SCG_RMW_SPLLCFG(base, SCG_SPLLCFG_PREDIV_MASK, SCG_SPLLCFG_PREDIV(value)))
#define SCG_BWR_SPLLCFG_PREDIV(base, value) (SCG_WR_SPLLCFG_PREDIV(base, value))
/*@}*/

/*!
 * @name Register SCG_SPLLCFG, field MULT[20:16] (RW)
 *
 * Multiplier for the System PLL. The MULT bits establish the multiplication
 * factor applied to the PLL reference clock frequency. PLL VCO Multiply Factor MULT
 * Multiply Factor MULT Multiply Factor MULT Multiply Factor MULT Multiply
 * Factor 00000 16 01000 24 10000 32 11000 40 00001 17 01001 25 10001 33 11001 41
 * 00010 18 01010 26 10010 34 11010 42 00011 19 01011 27 10011 35 11011 43 00100 20
 * 01100 28 10100 36 11100 44 00101 21 01101 29 10101 37 11101 45 00110 22 01110
 * 30 10110 38 11110 46 00111 23 01111 31 10111 39 11111 47
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCFG_MULT field. */
#define SCG_RD_SPLLCFG_MULT(base) ((SCG_SPLLCFG_REG(base) & SCG_SPLLCFG_MULT_MASK) >> SCG_SPLLCFG_MULT_SHIFT)
#define SCG_BRD_SPLLCFG_MULT(base) (SCG_RD_SPLLCFG_MULT(base))

