nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the MULT field to a new value. */
#define SCG_WR_SPLLCFG_MULT(base, value) (SCG_RMW_SPLLCFG(base, SCG_SPLLCFG_MULT_MASK, SCG_SPLLCFG_MULT(value)))
#define SCG_BWR_SPLLCFG_MULT(base, value) (SCG_WR_SPLLCFG_MULT(base, value))
/*@}*/

/*
 * S32K144 SIM
 *
 * System Integration Module
 *
 * Registers defined in this header file:
 * - SIM_CHIPCTL - Chip Control register
 * - SIM_FTMOPT0 - FTM Option Register 0
 * - SIM_LPOCLKS - LPO Clock Select Register
 * - SIM_ADCOPT - ADC Options Register
 * - SIM_FTMOPT1 - FTM Option Register 1
 * - SIM_SDID - System Device Identification Register
 * - SIM_PLATCGC - Platform Clock Gating Control Register
 * - SIM_FCFG1 - Flash Configuration Register 1
 * - SIM_FCFG2 - Flash Configuration Register 2
 * - SIM_UIDH - Unique Identification Register High
 * - SIM_UIDMH - Unique Identification Register Mid-High
 * - SIM_UIDML - Unique Identification Register Mid Low
 * - SIM_UIDL - Unique Identification Register Low
 * - SIM_CLKDIV4 - System Clock Divider Register 4
 * - SIM_MISCTRL - Miscellaneous Control register
 */

#define SIM_INSTANCE_COUNT (1U) /*!< Number of instances of the SIM module. */
#define SIM_IDX (0U) /*!< Instance number for SIM. */

/*******************************************************************************
 * SIM_CHIPCTL - Chip Control register
 ******************************************************************************/

/*!
 * @brief SIM_CHIPCTL - Chip Control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * SIM_CHIPCTL contains the controls for selecting ADC COCO trigger, trace
 * clock, clock out source, PDB back-to-back mode and ADC interleave channel.
 */
/*!
 * @name Constants and macros for entire SIM_CHIPCTL register
 */
/*@{*/
#define SIM_RD_CHIPCTL(base)     (SIM_CHIPCTL_REG(base))
#define SIM_WR_CHIPCTL(base, value) (SIM_CHIPCTL_REG(base) = (value))
#define SIM_RMW_CHIPCTL(base, mask, value) (SIM_WR_CHIPCTL(base, (SIM_RD_CHIPCTL(base) & ~(mask)) | (value)))
#define SIM_SET_CHIPCTL(base, value) (SIM_WR_CHIPCTL(base, SIM_RD_CHIPCTL(base) |  (value)))
#define SIM_CLR_CHIPCTL(base, value) (SIM_WR_CHIPCTL(base, SIM_RD_CHIPCTL(base) & ~(value)))
#define SIM_TOG_CHIPCTL(base, value) (SIM_WR_CHIPCTL(base, SIM_RD_CHIPCTL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_CHIPCTL bitfields
 */

/*!
 * @name Register SIM_CHIPCTL, field ADC_INTERLEAVE_SEL[3:0] (RW)
 *
 * Select ADC interleave pins. Bit 3 to 0 are for PTB14, PTB13, PTB1 and PTB0
 * respectively.
 *
 * Values:
 * - 0b0000 - No interleave channel
 */
/*@{*/
/*! @brief Read current value of the SIM_CHIPCTL_ADC_INTERLEAVE_SEL field. */
#define SIM_RD_CHIPCTL_ADC_INTERLEAVE_SEL(base) ((SIM_CHIPCTL_REG(base) & SIM_CHIPCTL_ADC_INTERLEAVE_SEL_MASK) >> SIM_CHIPCTL_ADC_INTERLEAVE_SEL_SHIFT)
#define SIM_BRD_CHIPCTL_ADC_INTERLEAVE_SEL(base) (SIM_RD_CHIPCTL_ADC_INTERLEAVE_SEL(base))

/*! @brief Set the ADC_INTERLEAVE_SEL field to a new value. */
#define SIM_WR_CHIPCTL_ADC_INTERLEAVE_SEL(base, value) (SIM_RMW_CHIPCTL(base, SIM_CHIPCTL_ADC_INTERLEAVE_SEL_MASK, SIM_CHIPCTL_ADC_INTERLEAVE_SEL(value)))
#define SIM_BWR_CHIPCTL_ADC_INTERLEAVE_SEL(base, value) (SIM_WR_CHIPCTL_ADC_INTERLEAVE_SEL(base, value))
/*@}*/

/*!
 * @name Register SIM_CHIPCTL, field CLKOUTSEL[7:6] (RW)
 *
 * Selects the clock to output on the CLKOUT pin.
 *
 * Values:
 * - 0b00 - Reseved
 * - 0b01 - System oscillator clock
 * - 0b10 - RTC oscillator clock (32 kHz)
 * - 0b11 - LPO clock (128 kHz)
 */
/*@{*/
/*! @brief Read current value of the SIM_CHIPCTL_CLKOUTSEL field. */
#define SIM_RD_CHIPCTL_CLKOUTSEL(base) ((SIM_CHIPCTL_REG(base) & SIM_CHIPCTL_CLKOUTSEL_MASK) >> SIM_CHIPCTL_CLKOUTSEL_SHIFT)
#define SIM_BRD_CHIPCTL_CLKOUTSEL(base) (SIM_RD_CHIPCTL_CLKOUTSEL(base))

/*! @brief Set the CLKOUTSEL field to a new value. */
#define SIM_WR_CHIPCTL_CLKOUTSEL(base, value) (SIM_RMW_CHIPCTL(base, SIM_CHIPCTL_CLKOUTSEL_MASK, SIM_CHIPCTL_CLKOUTSEL(value)))
#define SIM_BWR_CHIPCTL_CLKOUTSEL(base, value) (SIM_WR_CHIPCTL_CLKOUTSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_CHIPCTL, field TRACECLK_SEL[12] (RW)
 *
 * Selects core clock or platform clock as the trace clock source.
 *
 * Values:
 * - 0b0 - core clock
 * - 0b1 - platform clock
 */
/*@{*/
/*! @brief Read current value of the SIM_CHIPCTL_TRACECLK_SEL field. */
#define SIM_RD_CHIPCTL_TRACECLK_SEL(base) ((SIM_CHIPCTL_REG(base) & SIM_CHIPCTL_TRACECLK_SEL_MASK) >> SIM_CHIPCTL_TRACECLK_SEL_SHIFT)
#define SIM_BRD_CHIPCTL_TRACECLK_SEL(base) (BITBAND_ACCESS32(&SIM_CHIPCTL_REG(base), SIM_CHIPCTL_TRACECLK_SEL_SHIFT))

/*! @brief Set the TRACECLK_SEL field to a new value. */
#define SIM_WR_CHIPCTL_TRACECLK_SEL(base, value) (SIM_RMW_CHIPCTL(base, SIM_CHIPCTL_TRACECLK_SEL_MASK, SIM_CHIPCTL_TRACECLK_SEL(value)))
#define SIM_BWR_CHIPCTL_TRACECLK_SEL(base, value) (BITBAND_ACCESS32(&SIM_CHIPCTL_REG(base), SIM_CHIPCTL_TRACECLK_SEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_CHIPCTL, field PDB_BB_SEL[13] (RW)
 *
 * Selects ADC COCO source as pdb back-to-back mode, see Back-to-back
 * acknowledgement connections for details.
 *
 * Values:
 * - 0b0 - PDB0 channel 0 back-to-back operation with ADC0 COCO[7:0]; PDB1
 *     channel 0 back-to-back operation with ADC1 COCO[7:0]; PDB2 channel 0
 *     back-to-back operation with ADC2 COCO[7:0].
 * - 0b1 - Channel 0 of PDB0,PDB1 and PDB2 back-to-back operation with COCO[7:0]
 *     of ADC0, ADC1 and ADC2.
 */
/*@{*/
/*! @brief Read current value of the SIM_CHIPCTL_PDB_BB_SEL field. */
#define SIM_RD_CHIPCTL_PDB_BB_SEL(base) ((SIM_CHIPCTL_REG(base) & SIM_CHIPCTL_PDB_BB_SEL_MASK) >> SIM_CHIPCTL_PDB_BB_SEL_SHIFT)
#define SIM_BRD_CHIPCTL_PDB_BB_SEL(base) (BITBAND_ACCESS32(&SIM_CHIPCTL_REG(base), SIM_CHIPCTL_PDB_BB_SEL_SHIFT))

/*! @brief Set the PDB_BB_SEL field to a new value. */
#define SIM_WR_CHIPCTL_PDB_BB_SEL(base, value) (SIM_RMW_CHIPCTL(base, SIM_CHIPCTL_PDB_BB_SEL_MASK, SIM_CHIPCTL_PDB_BB_SEL(value)))
#define SIM_BWR_CHIPCTL_PDB_BB_SEL(base, value) (BITBAND_ACCESS32(&SIM_CHIPCTL_REG(base), SIM_CHIPCTL_PDB_BB_SEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_CHIPCTL, field COCO_TRG_SEL[14] (RW)
 *
 * Selects ADC1 or ADC2 COCO output as TRGMUX input.
 *
 * Values:
 * - 0b0 - ADC1 COCO
 * - 0b1 - ADC2 COCO
 */
/*@{*/
/*! @brief Read current value of the SIM_CHIPCTL_COCO_TRG_SEL field. */
#define SIM_RD_CHIPCTL_COCO_TRG_SEL(base) ((SIM_CHIPCTL_REG(base) & SIM_CHIPCTL_COCO_TRG_SEL_MASK) >> SIM_CHIPCTL_COCO_TRG_SEL_SHIFT)
#define SIM_BRD_CHIPCTL_COCO_TRG_SEL(base) (BITBAND_ACCESS32(&SIM_CHIPCTL_REG(base), SIM_CHIPCTL_COCO_TRG_SEL_SHIFT))

/*! @brief Set the COCO_TRG_SEL field to a new value. */
#define SIM_WR_CHIPCTL_COCO_TRG_SEL(base, value) (SIM_RMW_CHIPCTL(base, SIM_CHIPCTL_COCO_TRG_SEL_MASK, SIM_CHIPCTL_COCO_TRG_SEL(value)))
#define SIM_BWR_CHIPCTL_COCO_TRG_SEL(base, value) (BITBAND_ACCESS32(&SIM_CHIPCTL_REG(base), SIM_CHIPCTL_COCO_TRG_SEL_SHIFT) = (value))
/*@}*/

