nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * SIM_FTMOPT0 - FTM Option Register 0
 ******************************************************************************/

/*!
 * @brief SIM_FTMOPT0 - FTM Option Register 0 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_FTMOPT0 register
 */
/*@{*/
#define SIM_RD_FTMOPT0(base)     (SIM_FTMOPT0_REG(base))
#define SIM_WR_FTMOPT0(base, value) (SIM_FTMOPT0_REG(base) = (value))
#define SIM_RMW_FTMOPT0(base, mask, value) (SIM_WR_FTMOPT0(base, (SIM_RD_FTMOPT0(base) & ~(mask)) | (value)))
#define SIM_SET_FTMOPT0(base, value) (SIM_WR_FTMOPT0(base, SIM_RD_FTMOPT0(base) |  (value)))
#define SIM_CLR_FTMOPT0(base, value) (SIM_WR_FTMOPT0(base, SIM_RD_FTMOPT0(base) & ~(value)))
#define SIM_TOG_FTMOPT0(base, value) (SIM_WR_FTMOPT0(base, SIM_RD_FTMOPT0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_FTMOPT0 bitfields
 */

/*!
 * @name Register SIM_FTMOPT0, field FTM0FLTxSEL[2:0] (RW)
 *
 * Selects the source of FTM0 fault. Every bit means one fault input
 * respectively. The pin source for fault must be configured for the FTM module fault
 * function through the appropriate pin control register in the port control module
 * when it comes from external fault pin. TRGMUX_FTM0 SELx is corresponding to FTM0
 * Fault x input.
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT0_FTM0FLTxSEL field. */
#define SIM_RD_FTMOPT0_FTM0FLTxSEL(base) ((SIM_FTMOPT0_REG(base) & SIM_FTMOPT0_FTM0FLTxSEL_MASK) >> SIM_FTMOPT0_FTM0FLTxSEL_SHIFT)
#define SIM_BRD_FTMOPT0_FTM0FLTxSEL(base) (SIM_RD_FTMOPT0_FTM0FLTxSEL(base))

/*! @brief Set the FTM0FLTxSEL field to a new value. */
#define SIM_WR_FTMOPT0_FTM0FLTxSEL(base, value) (SIM_RMW_FTMOPT0(base, SIM_FTMOPT0_FTM0FLTxSEL_MASK, SIM_FTMOPT0_FTM0FLTxSEL(value)))
#define SIM_BWR_FTMOPT0_FTM0FLTxSEL(base, value) (SIM_WR_FTMOPT0_FTM0FLTxSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT0, field FTM1FLTxSEL[6:4] (RW)
 *
 * Selects the source of FTM1 fault. Every bit means one fault input
 * respectively. The pin source for fault must be configured for the FTM module fault
 * function through the appropriate pin control register in the port control module
 * when it comes from external fault pin. TRGMUX_FTM1 SELx is corresponding to FTM1
 * Fault x input.
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT0_FTM1FLTxSEL field. */
#define SIM_RD_FTMOPT0_FTM1FLTxSEL(base) ((SIM_FTMOPT0_REG(base) & SIM_FTMOPT0_FTM1FLTxSEL_MASK) >> SIM_FTMOPT0_FTM1FLTxSEL_SHIFT)
#define SIM_BRD_FTMOPT0_FTM1FLTxSEL(base) (SIM_RD_FTMOPT0_FTM1FLTxSEL(base))

/*! @brief Set the FTM1FLTxSEL field to a new value. */
#define SIM_WR_FTMOPT0_FTM1FLTxSEL(base, value) (SIM_RMW_FTMOPT0(base, SIM_FTMOPT0_FTM1FLTxSEL_MASK, SIM_FTMOPT0_FTM1FLTxSEL(value)))
#define SIM_BWR_FTMOPT0_FTM1FLTxSEL(base, value) (SIM_WR_FTMOPT0_FTM1FLTxSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT0, field FTM2FLTxSEL[10:8] (RW)
 *
 * Selects the source of FTM2 fault. Every bit means one fault input
 * respectively. The pin source for fault must be configured for the FTM module fault
 * function through the appropriate pin control register in the port control module
 * when it comes from external fault pin. TRGMUX_FTM2 SELx is corresponding to FTM2
 * Fault x input .
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT0_FTM2FLTxSEL field. */
#define SIM_RD_FTMOPT0_FTM2FLTxSEL(base) ((SIM_FTMOPT0_REG(base) & SIM_FTMOPT0_FTM2FLTxSEL_MASK) >> SIM_FTMOPT0_FTM2FLTxSEL_SHIFT)
#define SIM_BRD_FTMOPT0_FTM2FLTxSEL(base) (SIM_RD_FTMOPT0_FTM2FLTxSEL(base))

/*! @brief Set the FTM2FLTxSEL field to a new value. */
#define SIM_WR_FTMOPT0_FTM2FLTxSEL(base, value) (SIM_RMW_FTMOPT0(base, SIM_FTMOPT0_FTM2FLTxSEL_MASK, SIM_FTMOPT0_FTM2FLTxSEL(value)))
#define SIM_BWR_FTMOPT0_FTM2FLTxSEL(base, value) (SIM_WR_FTMOPT0_FTM2FLTxSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT0, field FTM3FLTxSEL[14:12] (RW)
 *
 * Selects the source of FTM3 fault. Every bit means one fault input
 * respectively. The pin source for fault must be configured for the FTM module fault
 * function through the appropriate pin control register in the port control module
 * when it comes from external fault pin. TRGMUX_FTM3 SELx is corresponding to FTM3
 * Fault x input .
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT0_FTM3FLTxSEL field. */
#define SIM_RD_FTMOPT0_FTM3FLTxSEL(base) ((SIM_FTMOPT0_REG(base) & SIM_FTMOPT0_FTM3FLTxSEL_MASK) >> SIM_FTMOPT0_FTM3FLTxSEL_SHIFT)
#define SIM_BRD_FTMOPT0_FTM3FLTxSEL(base) (SIM_RD_FTMOPT0_FTM3FLTxSEL(base))

/*! @brief Set the FTM3FLTxSEL field to a new value. */
#define SIM_WR_FTMOPT0_FTM3FLTxSEL(base, value) (SIM_RMW_FTMOPT0(base, SIM_FTMOPT0_FTM3FLTxSEL_MASK, SIM_FTMOPT0_FTM3FLTxSEL(value)))
#define SIM_BWR_FTMOPT0_FTM3FLTxSEL(base, value) (SIM_WR_FTMOPT0_FTM3FLTxSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT0, field FTM0CLKSEL[25:24] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM0 module. The
 * selected pin must also be configured for the FTM external clock function through
 * the appropriate Pin Control Register in the Port Control module.
 *
 * Values:
 * - 0b00 - FTM0 external clock driven by TCLK0 pin.
 * - 0b01 - FTM0 external clock driven by TCLK1 pin.
 * - 0b10 - FTM0 external clock driven by TCLK2 pin.
 * - 0b11 - No clock input
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT0_FTM0CLKSEL field. */
#define SIM_RD_FTMOPT0_FTM0CLKSEL(base) ((SIM_FTMOPT0_REG(base) & SIM_FTMOPT0_FTM0CLKSEL_MASK) >> SIM_FTMOPT0_FTM0CLKSEL_SHIFT)
#define SIM_BRD_FTMOPT0_FTM0CLKSEL(base) (SIM_RD_FTMOPT0_FTM0CLKSEL(base))

/*! @brief Set the FTM0CLKSEL field to a new value. */
#define SIM_WR_FTMOPT0_FTM0CLKSEL(base, value) (SIM_RMW_FTMOPT0(base, SIM_FTMOPT0_FTM0CLKSEL_MASK, SIM_FTMOPT0_FTM0CLKSEL(value)))
#define SIM_BWR_FTMOPT0_FTM0CLKSEL(base, value) (SIM_WR_FTMOPT0_FTM0CLKSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT0, field FTM1CLKSEL[27:26] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM1 module. The
 * selected pin must also be configured for the FTM external clock function through
 * the appropriate Pin Control Register in the Port Control module.
 *
 * Values:
 * - 0b00 - FTM1 external clock driven by TCLK0 pin.
 * - 0b01 - FTM1 external clock driven by TCLK1 pin.
 * - 0b10 - FTM1 external clock driven by TCLK2 pin.
 * - 0b11 - No clock input
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT0_FTM1CLKSEL field. */
#define SIM_RD_FTMOPT0_FTM1CLKSEL(base) ((SIM_FTMOPT0_REG(base) & SIM_FTMOPT0_FTM1CLKSEL_MASK) >> SIM_FTMOPT0_FTM1CLKSEL_SHIFT)
#define SIM_BRD_FTMOPT0_FTM1CLKSEL(base) (SIM_RD_FTMOPT0_FTM1CLKSEL(base))

