nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the FTM1CLKSEL field to a new value. */
#define SIM_WR_FTMOPT0_FTM1CLKSEL(base, value) (SIM_RMW_FTMOPT0(base, SIM_FTMOPT0_FTM1CLKSEL_MASK, SIM_FTMOPT0_FTM1CLKSEL(value)))
#define SIM_BWR_FTMOPT0_FTM1CLKSEL(base, value) (SIM_WR_FTMOPT0_FTM1CLKSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT0, field FTM2CLKSEL[29:28] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM2 module. The
 * selected pin must also be configured for the FTM external clock function through
 * the appropriate Pin Control Register in the Port Control module.
 *
 * Values:
 * - 0b00 - FTM2 external clock driven by TCLK0 pin.
 * - 0b01 - FTM2 external clock driven by TCLK1 pin.
 * - 0b10 - FTM2 external clock driven by TCLK2 pin.
 * - 0b11 - No clock input
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT0_FTM2CLKSEL field. */
#define SIM_RD_FTMOPT0_FTM2CLKSEL(base) ((SIM_FTMOPT0_REG(base) & SIM_FTMOPT0_FTM2CLKSEL_MASK) >> SIM_FTMOPT0_FTM2CLKSEL_SHIFT)
#define SIM_BRD_FTMOPT0_FTM2CLKSEL(base) (SIM_RD_FTMOPT0_FTM2CLKSEL(base))

/*! @brief Set the FTM2CLKSEL field to a new value. */
#define SIM_WR_FTMOPT0_FTM2CLKSEL(base, value) (SIM_RMW_FTMOPT0(base, SIM_FTMOPT0_FTM2CLKSEL_MASK, SIM_FTMOPT0_FTM2CLKSEL(value)))
#define SIM_BWR_FTMOPT0_FTM2CLKSEL(base, value) (SIM_WR_FTMOPT0_FTM2CLKSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT0, field FTM3CLKSEL[31:30] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM3 module. The
 * selected pin must also be configured for the FTM external clock function through
 * the appropriate Pin Control Register in the Port Control module.
 *
 * Values:
 * - 0b00 - FTM3 external clock driven by TCLK0 pin.
 * - 0b01 - FTM3 external clock driven by TCLK1 pin.
 * - 0b10 - FTM3 external clock driven by TCLK2 pin.
 * - 0b11 - No clock input
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT0_FTM3CLKSEL field. */
#define SIM_RD_FTMOPT0_FTM3CLKSEL(base) ((SIM_FTMOPT0_REG(base) & SIM_FTMOPT0_FTM3CLKSEL_MASK) >> SIM_FTMOPT0_FTM3CLKSEL_SHIFT)
#define SIM_BRD_FTMOPT0_FTM3CLKSEL(base) (SIM_RD_FTMOPT0_FTM3CLKSEL(base))

/*! @brief Set the FTM3CLKSEL field to a new value. */
#define SIM_WR_FTMOPT0_FTM3CLKSEL(base, value) (SIM_RMW_FTMOPT0(base, SIM_FTMOPT0_FTM3CLKSEL_MASK, SIM_FTMOPT0_FTM3CLKSEL(value)))
#define SIM_BWR_FTMOPT0_FTM3CLKSEL(base, value) (SIM_WR_FTMOPT0_FTM3CLKSEL(base, value))
/*@}*/

/*******************************************************************************
 * SIM_LPOCLKS - LPO Clock Select Register
 ******************************************************************************/

/*!
 * @brief SIM_LPOCLKS - LPO Clock Select Register (RW)
 *
 * Reset value: 0x00000003U
 *
 * The LPOCLKS register is a write-once register, and only reset on POR or LVD.
 */
/*!
 * @name Constants and macros for entire SIM_LPOCLKS register
 */
/*@{*/
#define SIM_RD_LPOCLKS(base)     (SIM_LPOCLKS_REG(base))
#define SIM_WR_LPOCLKS(base, value) (SIM_LPOCLKS_REG(base) = (value))
#define SIM_RMW_LPOCLKS(base, mask, value) (SIM_WR_LPOCLKS(base, (SIM_RD_LPOCLKS(base) & ~(mask)) | (value)))
#define SIM_SET_LPOCLKS(base, value) (SIM_WR_LPOCLKS(base, SIM_RD_LPOCLKS(base) |  (value)))
#define SIM_CLR_LPOCLKS(base, value) (SIM_WR_LPOCLKS(base, SIM_RD_LPOCLKS(base) & ~(value)))
#define SIM_TOG_LPOCLKS(base, value) (SIM_WR_LPOCLKS(base, SIM_RD_LPOCLKS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_LPOCLKS bitfields
 */

/*!
 * @name Register SIM_LPOCLKS, field LPO1KCLKEN[0] (RW)
 *
 * Values:
 * - 0b0 - Disable 1 kHz LPO clock output
 * - 0b1 - Enable 1 kHz LPO clock output
 */
/*@{*/
/*! @brief Read current value of the SIM_LPOCLKS_LPO1KCLKEN field. */
#define SIM_RD_LPOCLKS_LPO1KCLKEN(base) ((SIM_LPOCLKS_REG(base) & SIM_LPOCLKS_LPO1KCLKEN_MASK) >> SIM_LPOCLKS_LPO1KCLKEN_SHIFT)
#define SIM_BRD_LPOCLKS_LPO1KCLKEN(base) (BITBAND_ACCESS32(&SIM_LPOCLKS_REG(base), SIM_LPOCLKS_LPO1KCLKEN_SHIFT))

/*! @brief Set the LPO1KCLKEN field to a new value. */
#define SIM_WR_LPOCLKS_LPO1KCLKEN(base, value) (SIM_RMW_LPOCLKS(base, SIM_LPOCLKS_LPO1KCLKEN_MASK, SIM_LPOCLKS_LPO1KCLKEN(value)))
#define SIM_BWR_LPOCLKS_LPO1KCLKEN(base, value) (BITBAND_ACCESS32(&SIM_LPOCLKS_REG(base), SIM_LPOCLKS_LPO1KCLKEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_LPOCLKS, field LPO32KCLKEN[1] (RW)
 *
 * Values:
 * - 0b0 - Disable 32 kHz LPO clock output
 * - 0b1 - Enable 32 kHz LPO clock output
 */
/*@{*/
/*! @brief Read current value of the SIM_LPOCLKS_LPO32KCLKEN field. */
#define SIM_RD_LPOCLKS_LPO32KCLKEN(base) ((SIM_LPOCLKS_REG(base) & SIM_LPOCLKS_LPO32KCLKEN_MASK) >> SIM_LPOCLKS_LPO32KCLKEN_SHIFT)
#define SIM_BRD_LPOCLKS_LPO32KCLKEN(base) (BITBAND_ACCESS32(&SIM_LPOCLKS_REG(base), SIM_LPOCLKS_LPO32KCLKEN_SHIFT))

/*! @brief Set the LPO32KCLKEN field to a new value. */
#define SIM_WR_LPOCLKS_LPO32KCLKEN(base, value) (SIM_RMW_LPOCLKS(base, SIM_LPOCLKS_LPO32KCLKEN_MASK, SIM_LPOCLKS_LPO32KCLKEN(value)))
#define SIM_BWR_LPOCLKS_LPO32KCLKEN(base, value) (BITBAND_ACCESS32(&SIM_LPOCLKS_REG(base), SIM_LPOCLKS_LPO32KCLKEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_LPOCLKS, field LPOCLKSEL[3:2] (RW)
 *
 * Selects LPO clock source for peripherals Is this really configurable? Figure
 * 5-1 shows only one option for LPO_CLK, the 128 kHz LPO
 *
 * Values:
 * - 0b00 - 128 kHz LPO clock
 * - 0b01 - 32 kHz oscillator clock
 * - 0b10 - 32 kHz LPO clock which is divided by the 128 kHz LPO clock
 * - 0b11 - 1 kHz LPO clock which is divided by the 128 kHz LPO clock
 */
/*@{*/
/*! @brief Read current value of the SIM_LPOCLKS_LPOCLKSEL field. */
#define SIM_RD_LPOCLKS_LPOCLKSEL(base) ((SIM_LPOCLKS_REG(base) & SIM_LPOCLKS_LPOCLKSEL_MASK) >> SIM_LPOCLKS_LPOCLKSEL_SHIFT)
#define SIM_BRD_LPOCLKS_LPOCLKSEL(base) (SIM_RD_LPOCLKS_LPOCLKSEL(base))

/*! @brief Set the LPOCLKSEL field to a new value. */
#define SIM_WR_LPOCLKS_LPOCLKSEL(base, value) (SIM_RMW_LPOCLKS(base, SIM_LPOCLKS_LPOCLKSEL_MASK, SIM_LPOCLKS_LPOCLKSEL(value)))
#define SIM_BWR_LPOCLKS_LPOCLKSEL(base, value) (SIM_WR_LPOCLKS_LPOCLKSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_LPOCLKS, field CLK32KSEL[5:4] (RW)
 *
 * Selects 32 kHz clock source for peripherals
 *
 * Values:
 * - 0b00 - 32 kHz oscillator clock
 * - 0b01 - 32 kHz LPO clock
 * - 0b10 - RTC_CLKIN clock
 * - 0b11 - no clock
 */
/*@{*/
/*! @brief Read current value of the SIM_LPOCLKS_CLK32KSEL field. */
#define SIM_RD_LPOCLKS_CLK32KSEL(base) ((SIM_LPOCLKS_REG(base) & SIM_LPOCLKS_CLK32KSEL_MASK) >> SIM_LPOCLKS_CLK32KSEL_SHIFT)
#define SIM_BRD_LPOCLKS_CLK32KSEL(base) (SIM_RD_LPOCLKS_CLK32KSEL(base))

