nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the CLK32KSEL field to a new value. */
#define SIM_WR_LPOCLKS_CLK32KSEL(base, value) (SIM_RMW_LPOCLKS(base, SIM_LPOCLKS_CLK32KSEL_MASK, SIM_LPOCLKS_CLK32KSEL(value)))
#define SIM_BWR_LPOCLKS_CLK32KSEL(base, value) (SIM_WR_LPOCLKS_CLK32KSEL(base, value))
/*@}*/

/*******************************************************************************
 * SIM_ADCOPT - ADC Options Register
 ******************************************************************************/

/*!
 * @brief SIM_ADCOPT - ADC Options Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_ADCOPT register
 */
/*@{*/
#define SIM_RD_ADCOPT(base)      (SIM_ADCOPT_REG(base))
#define SIM_WR_ADCOPT(base, value) (SIM_ADCOPT_REG(base) = (value))
#define SIM_RMW_ADCOPT(base, mask, value) (SIM_WR_ADCOPT(base, (SIM_RD_ADCOPT(base) & ~(mask)) | (value)))
#define SIM_SET_ADCOPT(base, value) (SIM_WR_ADCOPT(base, SIM_RD_ADCOPT(base) |  (value)))
#define SIM_CLR_ADCOPT(base, value) (SIM_WR_ADCOPT(base, SIM_RD_ADCOPT(base) & ~(value)))
#define SIM_TOG_ADCOPT(base, value) (SIM_WR_ADCOPT(base, SIM_RD_ADCOPT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_ADCOPT bitfields
 */

/*!
 * @name Register SIM_ADCOPT, field ADC0TRGSEL[0] (RW)
 *
 * Selects trigger source for ADC0.
 *
 * Values:
 * - 0b0 - PDB output
 * - 0b1 - TRGMUX output
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADC0TRGSEL field. */
#define SIM_RD_ADCOPT_ADC0TRGSEL(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADC0TRGSEL_MASK) >> SIM_ADCOPT_ADC0TRGSEL_SHIFT)
#define SIM_BRD_ADCOPT_ADC0TRGSEL(base) (BITBAND_ACCESS32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ADC0TRGSEL_SHIFT))

/*! @brief Set the ADC0TRGSEL field to a new value. */
#define SIM_WR_ADCOPT_ADC0TRGSEL(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADC0TRGSEL_MASK, SIM_ADCOPT_ADC0TRGSEL(value)))
#define SIM_BWR_ADCOPT_ADC0TRGSEL(base, value) (BITBAND_ACCESS32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ADC0TRGSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADC0SWPRETRG[3:1] (RW)
 *
 * Values:
 * - 0b000 - software pre-trigger disabled
 * - 0b001 - software pre-trigger 0
 * - 0b010 - software pre-trigger 1
 * - 0b011 - software pre-trigger 2
 * - 0b100 - software pre-trigger 3
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADC0SWPRETRG field. */
#define SIM_RD_ADCOPT_ADC0SWPRETRG(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADC0SWPRETRG_MASK) >> SIM_ADCOPT_ADC0SWPRETRG_SHIFT)
#define SIM_BRD_ADCOPT_ADC0SWPRETRG(base) (SIM_RD_ADCOPT_ADC0SWPRETRG(base))

/*! @brief Set the ADC0SWPRETRG field to a new value. */
#define SIM_WR_ADCOPT_ADC0SWPRETRG(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADC0SWPRETRG_MASK, SIM_ADCOPT_ADC0SWPRETRG(value)))
#define SIM_BWR_ADCOPT_ADC0SWPRETRG(base, value) (SIM_WR_ADCOPT_ADC0SWPRETRG(base, value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADC0PRETRGSEL[5:4] (RW)
 *
 * Selects pre-trigger source for ADC0.
 *
 * Values:
 * - 0b00 - PDB pre-trigger (default)
 * - 0b01 - TRGMUX pre-trigger
 * - 0b10 - Software pre-trigger
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADC0PRETRGSEL field. */
#define SIM_RD_ADCOPT_ADC0PRETRGSEL(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADC0PRETRGSEL_MASK) >> SIM_ADCOPT_ADC0PRETRGSEL_SHIFT)
#define SIM_BRD_ADCOPT_ADC0PRETRGSEL(base) (SIM_RD_ADCOPT_ADC0PRETRGSEL(base))

/*! @brief Set the ADC0PRETRGSEL field to a new value. */
#define SIM_WR_ADCOPT_ADC0PRETRGSEL(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADC0PRETRGSEL_MASK, SIM_ADCOPT_ADC0PRETRGSEL(value)))
#define SIM_BWR_ADCOPT_ADC0PRETRGSEL(base, value) (SIM_WR_ADCOPT_ADC0PRETRGSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADC1TRGSEL[8] (RW)
 *
 * Selects trigger source for ADC1.
 *
 * Values:
 * - 0b0 - PDB output
 * - 0b1 - TRGMUX output
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADC1TRGSEL field. */
#define SIM_RD_ADCOPT_ADC1TRGSEL(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADC1TRGSEL_MASK) >> SIM_ADCOPT_ADC1TRGSEL_SHIFT)
#define SIM_BRD_ADCOPT_ADC1TRGSEL(base) (BITBAND_ACCESS32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ADC1TRGSEL_SHIFT))

/*! @brief Set the ADC1TRGSEL field to a new value. */
#define SIM_WR_ADCOPT_ADC1TRGSEL(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADC1TRGSEL_MASK, SIM_ADCOPT_ADC1TRGSEL(value)))
#define SIM_BWR_ADCOPT_ADC1TRGSEL(base, value) (BITBAND_ACCESS32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ADC1TRGSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADC1SWPRETRG[11:9] (RW)
 *
 * Values:
 * - 0b000 - software pre-trigger disabled
 * - 0b001 - software pre-trigger 0
 * - 0b010 - software pre-trigger 1
 * - 0b011 - software pre-trigger 2
 * - 0b100 - software pre-trigger 3
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADC1SWPRETRG field. */
#define SIM_RD_ADCOPT_ADC1SWPRETRG(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADC1SWPRETRG_MASK) >> SIM_ADCOPT_ADC1SWPRETRG_SHIFT)
#define SIM_BRD_ADCOPT_ADC1SWPRETRG(base) (SIM_RD_ADCOPT_ADC1SWPRETRG(base))

/*! @brief Set the ADC1SWPRETRG field to a new value. */
#define SIM_WR_ADCOPT_ADC1SWPRETRG(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADC1SWPRETRG_MASK, SIM_ADCOPT_ADC1SWPRETRG(value)))
#define SIM_BWR_ADCOPT_ADC1SWPRETRG(base, value) (SIM_WR_ADCOPT_ADC1SWPRETRG(base, value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADC1PRETRGSEL[13:12] (RW)
 *
 * Selects pre-trigger source for ADC1.
 *
 * Values:
 * - 0b00 - PDB pre-trigger (default)
 * - 0b01 - TRGMUX pre-trigger
 * - 0b10 - Software pre-trigger
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADC1PRETRGSEL field. */
#define SIM_RD_ADCOPT_ADC1PRETRGSEL(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADC1PRETRGSEL_MASK) >> SIM_ADCOPT_ADC1PRETRGSEL_SHIFT)
#define SIM_BRD_ADCOPT_ADC1PRETRGSEL(base) (SIM_RD_ADCOPT_ADC1PRETRGSEL(base))

/*! @brief Set the ADC1PRETRGSEL field to a new value. */
#define SIM_WR_ADCOPT_ADC1PRETRGSEL(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADC1PRETRGSEL_MASK, SIM_ADCOPT_ADC1PRETRGSEL(value)))
#define SIM_BWR_ADCOPT_ADC1PRETRGSEL(base, value) (SIM_WR_ADCOPT_ADC1PRETRGSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADC2TRGSEL[16] (RW)
 *
 * Selects trigger source for ADC2.
 *
 * Values:
 * - 0b0 - PDB output
 * - 0b1 - TRGMUX output
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADC2TRGSEL field. */
#define SIM_RD_ADCOPT_ADC2TRGSEL(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADC2TRGSEL_MASK) >> SIM_ADCOPT_ADC2TRGSEL_SHIFT)
#define SIM_BRD_ADCOPT_ADC2TRGSEL(base) (BITBAND_ACCESS32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ADC2TRGSEL_SHIFT))

/*! @brief Set the ADC2TRGSEL field to a new value. */
#define SIM_WR_ADCOPT_ADC2TRGSEL(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADC2TRGSEL_MASK, SIM_ADCOPT_ADC2TRGSEL(value)))
#define SIM_BWR_ADCOPT_ADC2TRGSEL(base, value) (BITBAND_ACCESS32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ADC2TRGSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADC2SWPRETRG[19:17] (RW)
 *
 * Values:
 * - 0b000 - software pre-trigger disabled
 * - 0b001 - software pre-trigger 0
 * - 0b010 - software pre-trigger 1
 * - 0b011 - software pre-trigger 2
 * - 0b100 - software pre-trigger 3
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADC2SWPRETRG field. */
#define SIM_RD_ADCOPT_ADC2SWPRETRG(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADC2SWPRETRG_MASK) >> SIM_ADCOPT_ADC2SWPRETRG_SHIFT)
#define SIM_BRD_ADCOPT_ADC2SWPRETRG(base) (SIM_RD_ADCOPT_ADC2SWPRETRG(base))

/*! @brief Set the ADC2SWPRETRG field to a new value. */
#define SIM_WR_ADCOPT_ADC2SWPRETRG(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADC2SWPRETRG_MASK, SIM_ADCOPT_ADC2SWPRETRG(value)))
#define SIM_BWR_ADCOPT_ADC2SWPRETRG(base, value) (SIM_WR_ADCOPT_ADC2SWPRETRG(base, value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADC2PRETRGSEL[21:20] (RW)
 *
 * Selects pre-trigger source for ADC2
 *
 * Values:
 * - 0b00 - PDB pre-trigger (default)
 * - 0b01 - TRGMUX pre-trigger
 * - 0b10 - Software pre-trigger
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADC2PRETRGSEL field. */
#define SIM_RD_ADCOPT_ADC2PRETRGSEL(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADC2PRETRGSEL_MASK) >> SIM_ADCOPT_ADC2PRETRGSEL_SHIFT)
#define SIM_BRD_ADCOPT_ADC2PRETRGSEL(base) (SIM_RD_ADCOPT_ADC2PRETRGSEL(base))

