nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the ADC2PRETRGSEL field to a new value. */
#define SIM_WR_ADCOPT_ADC2PRETRGSEL(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADC2PRETRGSEL_MASK, SIM_ADCOPT_ADC2PRETRGSEL(value)))
#define SIM_BWR_ADCOPT_ADC2PRETRGSEL(base, value) (SIM_WR_ADCOPT_ADC2PRETRGSEL(base, value))
/*@}*/

/*******************************************************************************
 * SIM_FTMOPT1 - FTM Option Register 1
 ******************************************************************************/

/*!
 * @brief SIM_FTMOPT1 - FTM Option Register 1 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_FTMOPT1 register
 */
/*@{*/
#define SIM_RD_FTMOPT1(base)     (SIM_FTMOPT1_REG(base))
#define SIM_WR_FTMOPT1(base, value) (SIM_FTMOPT1_REG(base) = (value))
#define SIM_RMW_FTMOPT1(base, mask, value) (SIM_WR_FTMOPT1(base, (SIM_RD_FTMOPT1(base) & ~(mask)) | (value)))
#define SIM_SET_FTMOPT1(base, value) (SIM_WR_FTMOPT1(base, SIM_RD_FTMOPT1(base) |  (value)))
#define SIM_CLR_FTMOPT1(base, value) (SIM_WR_FTMOPT1(base, SIM_RD_FTMOPT1(base) & ~(value)))
#define SIM_TOG_FTMOPT1(base, value) (SIM_WR_FTMOPT1(base, SIM_RD_FTMOPT1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_FTMOPT1 bitfields
 */

/*!
 * @name Register SIM_FTMOPT1, field FTM0SYNCBIT[0] (RW)
 *
 * value description TBD
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT1_FTM0SYNCBIT field. */
#define SIM_RD_FTMOPT1_FTM0SYNCBIT(base) ((SIM_FTMOPT1_REG(base) & SIM_FTMOPT1_FTM0SYNCBIT_MASK) >> SIM_FTMOPT1_FTM0SYNCBIT_SHIFT)
#define SIM_BRD_FTMOPT1_FTM0SYNCBIT(base) (BITBAND_ACCESS32(&SIM_FTMOPT1_REG(base), SIM_FTMOPT1_FTM0SYNCBIT_SHIFT))

/*! @brief Set the FTM0SYNCBIT field to a new value. */
#define SIM_WR_FTMOPT1_FTM0SYNCBIT(base, value) (SIM_RMW_FTMOPT1(base, SIM_FTMOPT1_FTM0SYNCBIT_MASK, SIM_FTMOPT1_FTM0SYNCBIT(value)))
#define SIM_BWR_FTMOPT1_FTM0SYNCBIT(base, value) (BITBAND_ACCESS32(&SIM_FTMOPT1_REG(base), SIM_FTMOPT1_FTM0SYNCBIT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT1, field FTM1SYNCBIT[1] (RW)
 *
 * value description TBD
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT1_FTM1SYNCBIT field. */
#define SIM_RD_FTMOPT1_FTM1SYNCBIT(base) ((SIM_FTMOPT1_REG(base) & SIM_FTMOPT1_FTM1SYNCBIT_MASK) >> SIM_FTMOPT1_FTM1SYNCBIT_SHIFT)
#define SIM_BRD_FTMOPT1_FTM1SYNCBIT(base) (BITBAND_ACCESS32(&SIM_FTMOPT1_REG(base), SIM_FTMOPT1_FTM1SYNCBIT_SHIFT))

/*! @brief Set the FTM1SYNCBIT field to a new value. */
#define SIM_WR_FTMOPT1_FTM1SYNCBIT(base, value) (SIM_RMW_FTMOPT1(base, SIM_FTMOPT1_FTM1SYNCBIT_MASK, SIM_FTMOPT1_FTM1SYNCBIT(value)))
#define SIM_BWR_FTMOPT1_FTM1SYNCBIT(base, value) (BITBAND_ACCESS32(&SIM_FTMOPT1_REG(base), SIM_FTMOPT1_FTM1SYNCBIT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT1, field FTM2SYNCBIT[2] (RW)
 *
 * value description TBD
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT1_FTM2SYNCBIT field. */
#define SIM_RD_FTMOPT1_FTM2SYNCBIT(base) ((SIM_FTMOPT1_REG(base) & SIM_FTMOPT1_FTM2SYNCBIT_MASK) >> SIM_FTMOPT1_FTM2SYNCBIT_SHIFT)
#define SIM_BRD_FTMOPT1_FTM2SYNCBIT(base) (BITBAND_ACCESS32(&SIM_FTMOPT1_REG(base), SIM_FTMOPT1_FTM2SYNCBIT_SHIFT))

/*! @brief Set the FTM2SYNCBIT field to a new value. */
#define SIM_WR_FTMOPT1_FTM2SYNCBIT(base, value) (SIM_RMW_FTMOPT1(base, SIM_FTMOPT1_FTM2SYNCBIT_MASK, SIM_FTMOPT1_FTM2SYNCBIT(value)))
#define SIM_BWR_FTMOPT1_FTM2SYNCBIT(base, value) (BITBAND_ACCESS32(&SIM_FTMOPT1_REG(base), SIM_FTMOPT1_FTM2SYNCBIT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT1, field FTM3SYNCBIT[3] (RW)
 *
 * These bits need a description and expected values.
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT1_FTM3SYNCBIT field. */
#define SIM_RD_FTMOPT1_FTM3SYNCBIT(base) ((SIM_FTMOPT1_REG(base) & SIM_FTMOPT1_FTM3SYNCBIT_MASK) >> SIM_FTMOPT1_FTM3SYNCBIT_SHIFT)
#define SIM_BRD_FTMOPT1_FTM3SYNCBIT(base) (BITBAND_ACCESS32(&SIM_FTMOPT1_REG(base), SIM_FTMOPT1_FTM3SYNCBIT_SHIFT))

/*! @brief Set the FTM3SYNCBIT field to a new value. */
#define SIM_WR_FTMOPT1_FTM3SYNCBIT(base, value) (SIM_RMW_FTMOPT1(base, SIM_FTMOPT1_FTM3SYNCBIT_MASK, SIM_FTMOPT1_FTM3SYNCBIT(value)))
#define SIM_BWR_FTMOPT1_FTM3SYNCBIT(base, value) (BITBAND_ACCESS32(&SIM_FTMOPT1_REG(base), SIM_FTMOPT1_FTM3SYNCBIT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT1, field FTM1CH0SEL[5:4] (RW)
 *
 * Selects FTM1 CH0 input
 *
 * Values:
 * - 0b00 - FTM1_CH0 input
 * - 0b01 - CMP0 output
 * - 0b10 - CMP1 output
 * - 0b11 - CMP2 output
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT1_FTM1CH0SEL field. */
#define SIM_RD_FTMOPT1_FTM1CH0SEL(base) ((SIM_FTMOPT1_REG(base) & SIM_FTMOPT1_FTM1CH0SEL_MASK) >> SIM_FTMOPT1_FTM1CH0SEL_SHIFT)
#define SIM_BRD_FTMOPT1_FTM1CH0SEL(base) (SIM_RD_FTMOPT1_FTM1CH0SEL(base))

/*! @brief Set the FTM1CH0SEL field to a new value. */
#define SIM_WR_FTMOPT1_FTM1CH0SEL(base, value) (SIM_RMW_FTMOPT1(base, SIM_FTMOPT1_FTM1CH0SEL_MASK, SIM_FTMOPT1_FTM1CH0SEL(value)))
#define SIM_BWR_FTMOPT1_FTM1CH0SEL(base, value) (SIM_WR_FTMOPT1_FTM1CH0SEL(base, value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT1, field FTM2CH0SEL[7:6] (RW)
 *
 * Selects FTM2 CH0 input
 *
 * Values:
 * - 0b00 - FTM2_CH0 input
 * - 0b01 - CMP0 output
 * - 0b10 - CMP1 output
 * - 0b11 - CMP2 output
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT1_FTM2CH0SEL field. */
#define SIM_RD_FTMOPT1_FTM2CH0SEL(base) ((SIM_FTMOPT1_REG(base) & SIM_FTMOPT1_FTM2CH0SEL_MASK) >> SIM_FTMOPT1_FTM2CH0SEL_SHIFT)
#define SIM_BRD_FTMOPT1_FTM2CH0SEL(base) (SIM_RD_FTMOPT1_FTM2CH0SEL(base))

/*! @brief Set the FTM2CH0SEL field to a new value. */
#define SIM_WR_FTMOPT1_FTM2CH0SEL(base, value) (SIM_RMW_FTMOPT1(base, SIM_FTMOPT1_FTM2CH0SEL_MASK, SIM_FTMOPT1_FTM2CH0SEL(value)))
#define SIM_BWR_FTMOPT1_FTM2CH0SEL(base, value) (SIM_WR_FTMOPT1_FTM2CH0SEL(base, value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT1, field FTM2CH1SEL[8] (RW)
 *
 * Selects FTM2 CH1 input
 *
 * Values:
 * - 0b0 - FTM2_CH1 input
 * - 0b1 - exclusive OR of FTM2_CH0,FTM2_CH1, and FTM1_CH1
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT1_FTM2CH1SEL field. */
#define SIM_RD_FTMOPT1_FTM2CH1SEL(base) ((SIM_FTMOPT1_REG(base) & SIM_FTMOPT1_FTM2CH1SEL_MASK) >> SIM_FTMOPT1_FTM2CH1SEL_SHIFT)
#define SIM_BRD_FTMOPT1_FTM2CH1SEL(base) (BITBAND_ACCESS32(&SIM_FTMOPT1_REG(base), SIM_FTMOPT1_FTM2CH1SEL_SHIFT))

