nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the FTM2CH1SEL field to a new value. */
#define SIM_WR_FTMOPT1_FTM2CH1SEL(base, value) (SIM_RMW_FTMOPT1(base, SIM_FTMOPT1_FTM2CH1SEL_MASK, SIM_FTMOPT1_FTM2CH1SEL(value)))
#define SIM_BWR_FTMOPT1_FTM2CH1SEL(base, value) (BITBAND_ACCESS32(&SIM_FTMOPT1_REG(base), SIM_FTMOPT1_FTM2CH1SEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT1, field FTM0_OUTSEL[23:16] (RW)
 *
 * Bit 7 to 0 are for channel 7 to 0 respectively.
 *
 * Values:
 * - 0b00000000 - No modulation with FTM1_CH1
 * - 0b00000001 - Modulation with FTM1_CH1
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT1_FTM0_OUTSEL field. */
#define SIM_RD_FTMOPT1_FTM0_OUTSEL(base) ((SIM_FTMOPT1_REG(base) & SIM_FTMOPT1_FTM0_OUTSEL_MASK) >> SIM_FTMOPT1_FTM0_OUTSEL_SHIFT)
#define SIM_BRD_FTMOPT1_FTM0_OUTSEL(base) (SIM_RD_FTMOPT1_FTM0_OUTSEL(base))

/*! @brief Set the FTM0_OUTSEL field to a new value. */
#define SIM_WR_FTMOPT1_FTM0_OUTSEL(base, value) (SIM_RMW_FTMOPT1(base, SIM_FTMOPT1_FTM0_OUTSEL_MASK, SIM_FTMOPT1_FTM0_OUTSEL(value)))
#define SIM_BWR_FTMOPT1_FTM0_OUTSEL(base, value) (SIM_WR_FTMOPT1_FTM0_OUTSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_FTMOPT1, field FTM3_OUTSEL[31:24] (RW)
 *
 * Bit 7 to 0 are for channel 7 to 0 respectively.
 *
 * Values:
 * - 0b00000000 - No modulation with FTM2_CH1
 * - 0b00000001 - Modulation with FTM2_CH1
 */
/*@{*/
/*! @brief Read current value of the SIM_FTMOPT1_FTM3_OUTSEL field. */
#define SIM_RD_FTMOPT1_FTM3_OUTSEL(base) ((SIM_FTMOPT1_REG(base) & SIM_FTMOPT1_FTM3_OUTSEL_MASK) >> SIM_FTMOPT1_FTM3_OUTSEL_SHIFT)
#define SIM_BRD_FTMOPT1_FTM3_OUTSEL(base) (SIM_RD_FTMOPT1_FTM3_OUTSEL(base))

/*! @brief Set the FTM3_OUTSEL field to a new value. */
#define SIM_WR_FTMOPT1_FTM3_OUTSEL(base, value) (SIM_RMW_FTMOPT1(base, SIM_FTMOPT1_FTM3_OUTSEL_MASK, SIM_FTMOPT1_FTM3_OUTSEL(value)))
#define SIM_BWR_FTMOPT1_FTM3_OUTSEL(base, value) (SIM_WR_FTMOPT1_FTM3_OUTSEL(base, value))
/*@}*/

/*******************************************************************************
 * SIM_SDID - System Device Identification Register
 ******************************************************************************/

/*!
 * @brief SIM_SDID - System Device Identification Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * Reset value loaded during System Reset from Flash IFR.
 */
/*!
 * @name Constants and macros for entire SIM_SDID register
 */
/*@{*/
#define SIM_RD_SDID(base)        (SIM_SDID_REG(base))
/*@}*/

/*
 * Constants & macros for individual SIM_SDID bitfields
 */

/*!
 * @name Register SIM_SDID, field PINID[6:0] (RO)
 *
 * Specifies the pin count of the device.
 *
 * Values:
 * - 0b0000111 - 64-pin
 * - 0b0001000 - 80-pin
 * - 0b0001010 - 100-pin
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_PINID field. */
#define SIM_RD_SDID_PINID(base) ((SIM_SDID_REG(base) & SIM_SDID_PINID_MASK) >> SIM_SDID_PINID_SHIFT)
#define SIM_BRD_SDID_PINID(base) (SIM_RD_SDID_PINID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field PROJECTID[11:7] (RO)
 *
 * Specifies the silicon feature set identication number for the device. 00000
 * by default ?
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_PROJECTID field. */
#define SIM_RD_SDID_PROJECTID(base) ((SIM_SDID_REG(base) & SIM_SDID_PROJECTID_MASK) >> SIM_SDID_PROJECTID_SHIFT)
#define SIM_BRD_SDID_PROJECTID(base) (SIM_RD_SDID_PROJECTID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field REVID[15:12] (RO)
 *
 * Specifies the silicon implementation number for the device.
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_REVID field. */
#define SIM_RD_SDID_REVID(base) ((SIM_SDID_REG(base) & SIM_SDID_REVID_MASK) >> SIM_SDID_REVID_SHIFT)
#define SIM_BRD_SDID_REVID(base) (SIM_RD_SDID_REVID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field RAMSIZE[19:16] (RO)
 *
 * This field specifies the amount of system RAM available on the device.
 *
 * Values:
 * - 0b0101 - 16 KB
 * - 0b0110 - 32 KB
 * - 0b0111 - 64 KB
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_RAMSIZE field. */
#define SIM_RD_SDID_RAMSIZE(base) ((SIM_SDID_REG(base) & SIM_SDID_RAMSIZE_MASK) >> SIM_SDID_RAMSIZE_SHIFT)
#define SIM_BRD_SDID_RAMSIZE(base) (SIM_RD_SDID_RAMSIZE(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field SERIESID[23:20] (RO)
 *
 * Specifies the Kinetis series of the device.
 *
 * Values:
 * - 0b0010 - Kinetis E+ series
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_SERIESID field. */
#define SIM_RD_SDID_SERIESID(base) ((SIM_SDID_REG(base) & SIM_SDID_SERIESID_MASK) >> SIM_SDID_SERIESID_SHIFT)
#define SIM_BRD_SDID_SERIESID(base) (SIM_RD_SDID_SERIESID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field SUBFAMID[27:24] (RO)
 *
 * Specifies the Kinetis E-series sub-family of the device.
 *
 * Values:
 * - 0b0010 - KEx2 Sub-family (with EEPROM)
 * - 0b0100 - KEx4 Sub-family (Basic)
 * - 0b0101 - KEx5 Sub-family (with TSI)
 * - 0b0110 - KEx6 Sub-family (with CAN)
 * - 0b0111 - KEx7 Sub-family (with CAN and TSI)
 * - 0b1000 - KEx8 Sub-family (with dual CAN)
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_SUBFAMID field. */
#define SIM_RD_SDID_SUBFAMID(base) ((SIM_SDID_REG(base) & SIM_SDID_SUBFAMID_MASK) >> SIM_SDID_SUBFAMID_SHIFT)
#define SIM_BRD_SDID_SUBFAMID(base) (SIM_RD_SDID_SUBFAMID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field FAMILYID[31:28] (RO)
 *
 * Specifies the Kinetis E-series family of the device.
 *
 * Values:
 * - 0b0000 - KE0x Family (Entry level)
 * - 0b0001 - KE1x Family (Enhanced features)
 * - 0b0011 - KE3x Family (with SLCD)
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_FAMILYID field. */
#define SIM_RD_SDID_FAMILYID(base) ((SIM_SDID_REG(base) & SIM_SDID_FAMILYID_MASK) >> SIM_SDID_FAMILYID_SHIFT)
#define SIM_BRD_SDID_FAMILYID(base) (SIM_RD_SDID_FAMILYID(base))
/*@}*/

/*******************************************************************************
 * SIM_PLATCGC - Platform Clock Gating Control Register
 ******************************************************************************/

/*!
 * @brief SIM_PLATCGC - Platform Clock Gating Control Register (RW)
 *
 * Reset value: 0x00000007U
 */
/*!
 * @name Constants and macros for entire SIM_PLATCGC register
 */
/*@{*/
#define SIM_RD_PLATCGC(base)     (SIM_PLATCGC_REG(base))
#define SIM_WR_PLATCGC(base, value) (SIM_PLATCGC_REG(base) = (value))
#define SIM_RMW_PLATCGC(base, mask, value) (SIM_WR_PLATCGC(base, (SIM_RD_PLATCGC(base) & ~(mask)) | (value)))
#define SIM_SET_PLATCGC(base, value) (SIM_WR_PLATCGC(base, SIM_RD_PLATCGC(base) |  (value)))
#define SIM_CLR_PLATCGC(base, value) (SIM_WR_PLATCGC(base, SIM_RD_PLATCGC(base) & ~(value)))
#define SIM_TOG_PLATCGC(base, value) (SIM_WR_PLATCGC(base, SIM_RD_PLATCGC(base) ^  (value)))
/*@}*/

