nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual SIM_PLATCGC bitfields
 */

/*!
 * @name Register SIM_PLATCGC, field CGCMSCM[0] (RW)
 *
 * Controls the clock gating to the MSCM module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_PLATCGC_CGCMSCM field. */
#define SIM_RD_PLATCGC_CGCMSCM(base) ((SIM_PLATCGC_REG(base) & SIM_PLATCGC_CGCMSCM_MASK) >> SIM_PLATCGC_CGCMSCM_SHIFT)
#define SIM_BRD_PLATCGC_CGCMSCM(base) (BITBAND_ACCESS32(&SIM_PLATCGC_REG(base), SIM_PLATCGC_CGCMSCM_SHIFT))

/*! @brief Set the CGCMSCM field to a new value. */
#define SIM_WR_PLATCGC_CGCMSCM(base, value) (SIM_RMW_PLATCGC(base, SIM_PLATCGC_CGCMSCM_MASK, SIM_PLATCGC_CGCMSCM(value)))
#define SIM_BWR_PLATCGC_CGCMSCM(base, value) (BITBAND_ACCESS32(&SIM_PLATCGC_REG(base), SIM_PLATCGC_CGCMSCM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_PLATCGC, field CGCMPU[1] (RW)
 *
 * Controls the clock gating to the MPU module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_PLATCGC_CGCMPU field. */
#define SIM_RD_PLATCGC_CGCMPU(base) ((SIM_PLATCGC_REG(base) & SIM_PLATCGC_CGCMPU_MASK) >> SIM_PLATCGC_CGCMPU_SHIFT)
#define SIM_BRD_PLATCGC_CGCMPU(base) (BITBAND_ACCESS32(&SIM_PLATCGC_REG(base), SIM_PLATCGC_CGCMPU_SHIFT))

/*! @brief Set the CGCMPU field to a new value. */
#define SIM_WR_PLATCGC_CGCMPU(base, value) (SIM_RMW_PLATCGC(base, SIM_PLATCGC_CGCMPU_MASK, SIM_PLATCGC_CGCMPU(value)))
#define SIM_BWR_PLATCGC_CGCMPU(base, value) (BITBAND_ACCESS32(&SIM_PLATCGC_REG(base), SIM_PLATCGC_CGCMPU_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_PLATCGC, field CGCDMA[2] (RW)
 *
 * Controls the clock gating to the DMA module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_PLATCGC_CGCDMA field. */
#define SIM_RD_PLATCGC_CGCDMA(base) ((SIM_PLATCGC_REG(base) & SIM_PLATCGC_CGCDMA_MASK) >> SIM_PLATCGC_CGCDMA_SHIFT)
#define SIM_BRD_PLATCGC_CGCDMA(base) (BITBAND_ACCESS32(&SIM_PLATCGC_REG(base), SIM_PLATCGC_CGCDMA_SHIFT))

/*! @brief Set the CGCDMA field to a new value. */
#define SIM_WR_PLATCGC_CGCDMA(base, value) (SIM_RMW_PLATCGC(base, SIM_PLATCGC_CGCDMA_MASK, SIM_PLATCGC_CGCDMA(value)))
#define SIM_BWR_PLATCGC_CGCDMA(base, value) (BITBAND_ACCESS32(&SIM_PLATCGC_REG(base), SIM_PLATCGC_CGCDMA_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SIM_FCFG1 - Flash Configuration Register 1
 ******************************************************************************/

/*!
 * @brief SIM_FCFG1 - Flash Configuration Register 1 (RW)
 *
 * Reset value: 0x00000000U
 *
 * Reset value of NVMSIZE, PFSIZE, EEERAM_SIZE, DEPART loaded during System
 * Reset from Flash IFR.
 */
/*!
 * @name Constants and macros for entire SIM_FCFG1 register
 */
/*@{*/
#define SIM_RD_FCFG1(base)       (SIM_FCFG1_REG(base))
#define SIM_WR_FCFG1(base, value) (SIM_FCFG1_REG(base) = (value))
#define SIM_RMW_FCFG1(base, mask, value) (SIM_WR_FCFG1(base, (SIM_RD_FCFG1(base) & ~(mask)) | (value)))
#define SIM_SET_FCFG1(base, value) (SIM_WR_FCFG1(base, SIM_RD_FCFG1(base) |  (value)))
#define SIM_CLR_FCFG1(base, value) (SIM_WR_FCFG1(base, SIM_RD_FCFG1(base) & ~(value)))
#define SIM_TOG_FCFG1(base, value) (SIM_WR_FCFG1(base, SIM_RD_FCFG1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_FCFG1 bitfields
 */

/*!
 * @name Register SIM_FCFG1, field FLASHDIS[0] (RW)
 *
 * Flash accesses are disabled (and generate a bus error) and the Flash memory
 * is placed in a low power state. This bit should not be changed during VLP
 * modes. Relocate the interrupt vectors out of Flash memory before disabling the
 * Flash.
 *
 * Values:
 * - 0b0 - Flash is enabled
 * - 0b1 - Flash is disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_FLASHDIS field. */
#define SIM_RD_FCFG1_FLASHDIS(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_FLASHDIS_MASK) >> SIM_FCFG1_FLASHDIS_SHIFT)
#define SIM_BRD_FCFG1_FLASHDIS(base) (BITBAND_ACCESS32(&SIM_FCFG1_REG(base), SIM_FCFG1_FLASHDIS_SHIFT))

/*! @brief Set the FLASHDIS field to a new value. */
#define SIM_WR_FCFG1_FLASHDIS(base, value) (SIM_RMW_FCFG1(base, SIM_FCFG1_FLASHDIS_MASK, SIM_FCFG1_FLASHDIS(value)))
#define SIM_BWR_FCFG1_FLASHDIS(base, value) (BITBAND_ACCESS32(&SIM_FCFG1_REG(base), SIM_FCFG1_FLASHDIS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field FLASHDOZE[1] (RW)
 *
 * When set, Flash memory is disabled for the duration of Wait mode. An attempt
 * by the DMA or other bus master to access the Flash when the Flash is disabled
 * will result in a bus error. This bit should be clear during VLP modes. The
 * Flash will be automatically enabled again at the end of Wait mode so interrupt
 * vectors do not need to be relocated out of Flash memory. The wakeup time from
 * Wait mode is extended when this bit is set.
 *
 * Values:
 * - 0b0 - Flash remains enabled during Wait mode
 * - 0b1 - Flash is disabled for the duration of Wait mode
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_FLASHDOZE field. */
#define SIM_RD_FCFG1_FLASHDOZE(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_FLASHDOZE_MASK) >> SIM_FCFG1_FLASHDOZE_SHIFT)
#define SIM_BRD_FCFG1_FLASHDOZE(base) (BITBAND_ACCESS32(&SIM_FCFG1_REG(base), SIM_FCFG1_FLASHDOZE_SHIFT))

/*! @brief Set the FLASHDOZE field to a new value. */
#define SIM_WR_FCFG1_FLASHDOZE(base, value) (SIM_RMW_FCFG1(base, SIM_FCFG1_FLASHDOZE_MASK, SIM_FCFG1_FLASHDOZE(value)))
#define SIM_BWR_FCFG1_FLASHDOZE(base, value) (BITBAND_ACCESS32(&SIM_FCFG1_REG(base), SIM_FCFG1_FLASHDOZE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field DEPART[15:12] (RO)
 *
 * Data flash / EEPROM backup split . See DEPART bit description in FTFE chapter.
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_DEPART field. */
#define SIM_RD_FCFG1_DEPART(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_DEPART_MASK) >> SIM_FCFG1_DEPART_SHIFT)
#define SIM_BRD_FCFG1_DEPART(base) (SIM_RD_FCFG1_DEPART(base))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field EEERAMSIZE[19:16] (RO)
 *
 * EEE SRAM data size .
 *
 * Values:
 * - 0b0000 - Reserved
 * - 0b0001 - Reserved
 * - 0b0010 - 4 KB
 * - 0b0011 - 2 KB
 * - 0b0100 - 1 KB
 * - 0b0101 - 512 Bytes
 * - 0b0110 - 256 Bytes
 * - 0b0111 - 128 Bytes
 * - 0b1000 - 64 Bytes
 * - 0b1001 - 32 Bytes
 * - 0b1111 - 0 Bytes
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_EEERAMSIZE field. */
#define SIM_RD_FCFG1_EEERAMSIZE(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_EEERAMSIZE_MASK) >> SIM_FCFG1_EEERAMSIZE_SHIFT)
#define SIM_BRD_FCFG1_EEERAMSIZE(base) (SIM_RD_FCFG1_EEERAMSIZE(base))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field PFSIZE[27:24] (RO)
 *
 * This field specifies the amount of program flash memory available on the
 * device . Undefined values are reserved.
 *
 * Values:
 * - 0b0000 - 8 KB of program flash memory, 0.25 KB protection region
 * - 0b0001 - 16 KB of program flash memory, 0.5 KB protection region
 * - 0b0011 - 32 KB of program flash memory, 1 KB protection region
 * - 0b0101 - 64 KB of program flash memory, 2 KB protection region
 * - 0b0111 - 128 KB of program flash memory, 4 KB protection region
 * - 0b1001 - 256 KB of program flash memory, 8 KB protection region
 * - 0b1111 - 512 KB of program flash memory, 16 KB protection region
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_PFSIZE field. */
#define SIM_RD_FCFG1_PFSIZE(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_PFSIZE_MASK) >> SIM_FCFG1_PFSIZE_SHIFT)
#define SIM_BRD_FCFG1_PFSIZE(base) (SIM_RD_FCFG1_PFSIZE(base))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field NVMSIZE[31:28] (RO)
 *
 * This field specifies the amount of FlexNVM memory available on the device.
 * Undefined values are reserved.
 *
 * Values:
 * - 0b0000 - 0 KB of FlexNVM
 * - 0b0011 - 32 KB of FlexNVM
 * - 0b0101 - 64 KB of FlexNVM
 * - 0b0111 - 128 KB of FlexNVM
 * - 0b1001 - 256 KB of FlexNVM
 * - 0b1111 - 512 KB of FlexNVM
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_NVMSIZE field. */
#define SIM_RD_FCFG1_NVMSIZE(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_NVMSIZE_MASK) >> SIM_FCFG1_NVMSIZE_SHIFT)
#define SIM_BRD_FCFG1_NVMSIZE(base) (SIM_RD_FCFG1_NVMSIZE(base))
/*@}*/

