nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the TRACEFRAC field to a new value. */
#define SIM_WR_CLKDIV4_TRACEFRAC(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_TRACEFRAC_MASK, SIM_CLKDIV4_TRACEFRAC(value)))
#define SIM_BWR_CLKDIV4_TRACEFRAC(base, value) (BITBAND_ACCESS32(&SIM_CLKDIV4_REG(base), SIM_CLKDIV4_TRACEFRAC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV4, field TRACEDIV[3:1] (RW)
 *
 * This field sets the divide value for the fractional clock divider used as a
 * source for trace clock. The source clock for the trace clock is set by the
 * SIM_CHIPCTRL[TRACECLK_SEL]. Divider output clock = Divider input clock *
 * [(TRACEFRAC+1)/(TRACEDIV+1)].
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV4_TRACEDIV field. */
#define SIM_RD_CLKDIV4_TRACEDIV(base) ((SIM_CLKDIV4_REG(base) & SIM_CLKDIV4_TRACEDIV_MASK) >> SIM_CLKDIV4_TRACEDIV_SHIFT)
#define SIM_BRD_CLKDIV4_TRACEDIV(base) (SIM_RD_CLKDIV4_TRACEDIV(base))

/*! @brief Set the TRACEDIV field to a new value. */
#define SIM_WR_CLKDIV4_TRACEDIV(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_TRACEDIV_MASK, SIM_CLKDIV4_TRACEDIV(value)))
#define SIM_BWR_CLKDIV4_TRACEDIV(base, value) (SIM_WR_CLKDIV4_TRACEDIV(base, value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV4, field TRACEDIVEN[28] (RW)
 *
 * This bit controls the Debug Trace Divider.
 *
 * Values:
 * - 0b0 - Debug trace divider disabled
 * - 0b1 - Debug trace divider enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV4_TRACEDIVEN field. */
#define SIM_RD_CLKDIV4_TRACEDIVEN(base) ((SIM_CLKDIV4_REG(base) & SIM_CLKDIV4_TRACEDIVEN_MASK) >> SIM_CLKDIV4_TRACEDIVEN_SHIFT)
#define SIM_BRD_CLKDIV4_TRACEDIVEN(base) (BITBAND_ACCESS32(&SIM_CLKDIV4_REG(base), SIM_CLKDIV4_TRACEDIVEN_SHIFT))

/*! @brief Set the TRACEDIVEN field to a new value. */
#define SIM_WR_CLKDIV4_TRACEDIVEN(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_TRACEDIVEN_MASK, SIM_CLKDIV4_TRACEDIVEN(value)))
#define SIM_BWR_CLKDIV4_TRACEDIVEN(base, value) (BITBAND_ACCESS32(&SIM_CLKDIV4_REG(base), SIM_CLKDIV4_TRACEDIVEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SIM_MISCTRL - Miscellaneous Control register
 ******************************************************************************/

/*!
 * @brief SIM_MISCTRL - Miscellaneous Control register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_MISCTRL register
 */
/*@{*/
#define SIM_RD_MISCTRL(base)     (SIM_MISCTRL_REG(base))
#define SIM_WR_MISCTRL(base, value) (SIM_MISCTRL_REG(base) = (value))
#define SIM_RMW_MISCTRL(base, mask, value) (SIM_WR_MISCTRL(base, (SIM_RD_MISCTRL(base) & ~(mask)) | (value)))
#define SIM_SET_MISCTRL(base, value) (SIM_WR_MISCTRL(base, SIM_RD_MISCTRL(base) |  (value)))
#define SIM_CLR_MISCTRL(base, value) (SIM_WR_MISCTRL(base, SIM_RD_MISCTRL(base) & ~(value)))
#define SIM_TOG_MISCTRL(base, value) (SIM_WR_MISCTRL(base, SIM_RD_MISCTRL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_MISCTRL bitfields
 */

/*!
 * @name Register SIM_MISCTRL, field SW_TRG[0] (RW)
 *
 * ??TBD??
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL_SW_TRG field. */
#define SIM_RD_MISCTRL_SW_TRG(base) ((SIM_MISCTRL_REG(base) & SIM_MISCTRL_SW_TRG_MASK) >> SIM_MISCTRL_SW_TRG_SHIFT)
#define SIM_BRD_MISCTRL_SW_TRG(base) (BITBAND_ACCESS32(&SIM_MISCTRL_REG(base), SIM_MISCTRL_SW_TRG_SHIFT))

/*! @brief Set the SW_TRG field to a new value. */
#define SIM_WR_MISCTRL_SW_TRG(base, value) (SIM_RMW_MISCTRL(base, SIM_MISCTRL_SW_TRG_MASK, SIM_MISCTRL_SW_TRG(value)))
#define SIM_BWR_MISCTRL_SW_TRG(base, value) (BITBAND_ACCESS32(&SIM_MISCTRL_REG(base), SIM_MISCTRL_SW_TRG_SHIFT) = (value))
/*@}*/

/*
 * S32K144 SMC
 *
 * System Mode Controller
 *
 * Registers defined in this header file:
 * - SMC_VERID - SMC Version ID Register
 * - SMC_PARAM - SMC Parameter Register
 * - SMC_PMPROT - Power Mode Protection register
 * - SMC_PMCTRL - Power Mode Control register
 * - SMC_STOPCTRL - Stop Control Register
 * - SMC_PMSTAT - Power Mode Status register
 */

#define SMC_INSTANCE_COUNT (1U) /*!< Number of instances of the SMC module. */
#define SMC_IDX (0U) /*!< Instance number for SMC. */

/*******************************************************************************
 * SMC_VERID - SMC Version ID Register
 ******************************************************************************/

/*!
 * @brief SMC_VERID - SMC Version ID Register (RO)
 *
 * Reset value: 0x01000000U
 */
/*!
 * @name Constants and macros for entire SMC_VERID register
 */
/*@{*/
#define SMC_RD_VERID(base)       (SMC_VERID_REG(base))
/*@}*/

/*
 * Constants & macros for individual SMC_VERID bitfields
 */

/*!
 * @name Register SMC_VERID, field FEATURE[15:0] (RO)
 *
 * This read only field returns the feature set number.
 *
 * Values:
 * - 0b0000000000000000 - Standard features implemented
 */
/*@{*/
/*! @brief Read current value of the SMC_VERID_FEATURE field. */
#define SMC_RD_VERID_FEATURE(base) ((SMC_VERID_REG(base) & SMC_VERID_FEATURE_MASK) >> SMC_VERID_FEATURE_SHIFT)
#define SMC_BRD_VERID_FEATURE(base) (SMC_RD_VERID_FEATURE(base))
/*@}*/

/*!
 * @name Register SMC_VERID, field MINOR[23:16] (RO)
 *
 * This read only field returns the minor version number for the module
 * specification.
 */
/*@{*/
/*! @brief Read current value of the SMC_VERID_MINOR field. */
#define SMC_RD_VERID_MINOR(base) ((SMC_VERID_REG(base) & SMC_VERID_MINOR_MASK) >> SMC_VERID_MINOR_SHIFT)
#define SMC_BRD_VERID_MINOR(base) (SMC_RD_VERID_MINOR(base))
/*@}*/

/*!
 * @name Register SMC_VERID, field MAJOR[31:24] (RO)
 *
 * This read only field returns the major version number for the module
 * specification.
 */
/*@{*/
/*! @brief Read current value of the SMC_VERID_MAJOR field. */
#define SMC_RD_VERID_MAJOR(base) ((SMC_VERID_REG(base) & SMC_VERID_MAJOR_MASK) >> SMC_VERID_MAJOR_SHIFT)
#define SMC_BRD_VERID_MAJOR(base) (SMC_RD_VERID_MAJOR(base))
/*@}*/

