nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * SMC_PARAM - SMC Parameter Register
 ******************************************************************************/

/*!
 * @brief SMC_PARAM - SMC Parameter Register (RO)
 *
 * Reset value: 0x00000001U
 */
/*!
 * @name Constants and macros for entire SMC_PARAM register
 */
/*@{*/
#define SMC_RD_PARAM(base)       (SMC_PARAM_REG(base))
/*@}*/

/*
 * Constants & macros for individual SMC_PARAM bitfields
 */

/*!
 * @name Register SMC_PARAM, field EHSRUN[0] (RO)
 *
 * HSRUN mode enabled
 */
/*@{*/
/*! @brief Read current value of the SMC_PARAM_EHSRUN field. */
#define SMC_RD_PARAM_EHSRUN(base) ((SMC_PARAM_REG(base) & SMC_PARAM_EHSRUN_MASK) >> SMC_PARAM_EHSRUN_SHIFT)
#define SMC_BRD_PARAM_EHSRUN(base) (BITBAND_ACCESS32(&SMC_PARAM_REG(base), SMC_PARAM_EHSRUN_SHIFT))
/*@}*/

/*!
 * @name Register SMC_PARAM, field ELLS[3] (RO)
 *
 * LLS mode enabled
 */
/*@{*/
/*! @brief Read current value of the SMC_PARAM_ELLS field. */
#define SMC_RD_PARAM_ELLS(base) ((SMC_PARAM_REG(base) & SMC_PARAM_ELLS_MASK) >> SMC_PARAM_ELLS_SHIFT)
#define SMC_BRD_PARAM_ELLS(base) (BITBAND_ACCESS32(&SMC_PARAM_REG(base), SMC_PARAM_ELLS_SHIFT))
/*@}*/

/*!
 * @name Register SMC_PARAM, field ELLS2[5] (RO)
 *
 * LLS2 mode enabled
 */
/*@{*/
/*! @brief Read current value of the SMC_PARAM_ELLS2 field. */
#define SMC_RD_PARAM_ELLS2(base) ((SMC_PARAM_REG(base) & SMC_PARAM_ELLS2_MASK) >> SMC_PARAM_ELLS2_SHIFT)
#define SMC_BRD_PARAM_ELLS2(base) (BITBAND_ACCESS32(&SMC_PARAM_REG(base), SMC_PARAM_ELLS2_SHIFT))
/*@}*/

/*!
 * @name Register SMC_PARAM, field EVLLS0[6] (RO)
 *
 * VLLS0 mode enabled
 */
/*@{*/
/*! @brief Read current value of the SMC_PARAM_EVLLS0 field. */
#define SMC_RD_PARAM_EVLLS0(base) ((SMC_PARAM_REG(base) & SMC_PARAM_EVLLS0_MASK) >> SMC_PARAM_EVLLS0_SHIFT)
#define SMC_BRD_PARAM_EVLLS0(base) (BITBAND_ACCESS32(&SMC_PARAM_REG(base), SMC_PARAM_EVLLS0_SHIFT))
/*@}*/

/*******************************************************************************
 * SMC_PMPROT - Power Mode Protection register
 ******************************************************************************/

/*!
 * @brief SMC_PMPROT - Power Mode Protection register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register provides protection for entry into any low-power run or stop
 * mode. The enabling of the low-power run or stop mode occurs by configuring the
 * Power Mode Control register (PMCTRL). The PMPROT register can be written only
 * once after any system reset. If the MCU is configured for a disallowed or
 * reserved power mode, the MCU remains in its current power mode. For example, if the
 * MCU is in normal RUN mode and AVLP is 0, an attempt to enter VLPR mode using
 * PMCTRL[RUNM] is blocked and PMCTRL[RUNM] remains 00b, indicating the MCU is
 * still in Normal Run mode. This register is reset on Chip Reset not VLLS and by
 * reset types that trigger Chip Reset not VLLS. It is unaffected by reset types
 * that do not trigger Chip Reset not VLLS. See the Reset section details for more
 * information.
 */
/*!
 * @name Constants and macros for entire SMC_PMPROT register
 */
/*@{*/
#define SMC_RD_PMPROT(base)      (SMC_PMPROT_REG(base))
#define SMC_WR_PMPROT(base, value) (SMC_PMPROT_REG(base) = (value))
#define SMC_RMW_PMPROT(base, mask, value) (SMC_WR_PMPROT(base, (SMC_RD_PMPROT(base) & ~(mask)) | (value)))
#define SMC_SET_PMPROT(base, value) (SMC_WR_PMPROT(base, SMC_RD_PMPROT(base) |  (value)))
#define SMC_CLR_PMPROT(base, value) (SMC_WR_PMPROT(base, SMC_RD_PMPROT(base) & ~(value)))
#define SMC_TOG_PMPROT(base, value) (SMC_WR_PMPROT(base, SMC_RD_PMPROT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SMC_PMPROT bitfields
 */

/*!
 * @name Register SMC_PMPROT, field AVLP[5] (RW)
 *
 * Provided the appropriate control bits are set up in PMCTRL, this write-once
 * field allows the MCU to enter any very-low-power mode (VLPR, VLPW, and VLPS).
 *
 * Values:
 * - 0b0 - VLPR, VLPW, and VLPS are not allowed.
 * - 0b1 - VLPR, VLPW, and VLPS are allowed.
 */
/*@{*/
/*! @brief Read current value of the SMC_PMPROT_AVLP field. */
#define SMC_RD_PMPROT_AVLP(base) ((SMC_PMPROT_REG(base) & SMC_PMPROT_AVLP_MASK) >> SMC_PMPROT_AVLP_SHIFT)
#define SMC_BRD_PMPROT_AVLP(base) (BITBAND_ACCESS32(&SMC_PMPROT_REG(base), SMC_PMPROT_AVLP_SHIFT))

/*! @brief Set the AVLP field to a new value. */
#define SMC_WR_PMPROT_AVLP(base, value) (SMC_RMW_PMPROT(base, SMC_PMPROT_AVLP_MASK, SMC_PMPROT_AVLP(value)))
#define SMC_BWR_PMPROT_AVLP(base, value) (BITBAND_ACCESS32(&SMC_PMPROT_REG(base), SMC_PMPROT_AVLP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SMC_PMPROT, field AHSRUN[7] (RW)
 *
 * Provided the appropriate control bits are set up in PMCTRL, this write-once
 * field allows the MCU to enter High Speed Run mode (HSRUN).
 *
 * Values:
 * - 0b0 - HSRUN is not allowed
 * - 0b1 - HSRUN is allowed
 */
/*@{*/
/*! @brief Read current value of the SMC_PMPROT_AHSRUN field. */
#define SMC_RD_PMPROT_AHSRUN(base) ((SMC_PMPROT_REG(base) & SMC_PMPROT_AHSRUN_MASK) >> SMC_PMPROT_AHSRUN_SHIFT)
#define SMC_BRD_PMPROT_AHSRUN(base) (BITBAND_ACCESS32(&SMC_PMPROT_REG(base), SMC_PMPROT_AHSRUN_SHIFT))

/*! @brief Set the AHSRUN field to a new value. */
#define SMC_WR_PMPROT_AHSRUN(base, value) (SMC_RMW_PMPROT(base, SMC_PMPROT_AHSRUN_MASK, SMC_PMPROT_AHSRUN(value)))
#define SMC_BWR_PMPROT_AHSRUN(base, value) (BITBAND_ACCESS32(&SMC_PMPROT_REG(base), SMC_PMPROT_AHSRUN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SMC_PMCTRL - Power Mode Control register
 ******************************************************************************/

/*!
 * @brief SMC_PMCTRL - Power Mode Control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The PMCTRL register controls entry into low-power Run and Stop modes,
 * provided that the selected power mode is allowed via an appropriate setting of the
 * protection (PMPROT) register. This register is reset on Chip POR not VLLS and by
 * reset types that trigger Chip POR not VLLS. It is unaffected by reset types
 * that do not trigger Chip POR not VLLS. See the Reset section details for more
 * information.
 */
/*!
 * @name Constants and macros for entire SMC_PMCTRL register
 */
/*@{*/
#define SMC_RD_PMCTRL(base)      (SMC_PMCTRL_REG(base))
#define SMC_WR_PMCTRL(base, value) (SMC_PMCTRL_REG(base) = (value))
#define SMC_RMW_PMCTRL(base, mask, value) (SMC_WR_PMCTRL(base, (SMC_RD_PMCTRL(base) & ~(mask)) | (value)))
#define SMC_SET_PMCTRL(base, value) (SMC_WR_PMCTRL(base, SMC_RD_PMCTRL(base) |  (value)))
#define SMC_CLR_PMCTRL(base, value) (SMC_WR_PMCTRL(base, SMC_RD_PMCTRL(base) & ~(value)))
#define SMC_TOG_PMCTRL(base, value) (SMC_WR_PMCTRL(base, SMC_RD_PMCTRL(base) ^  (value)))
/*@}*/

