nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * SMC_PMSTAT - Power Mode Status register
 ******************************************************************************/

/*!
 * @brief SMC_PMSTAT - Power Mode Status register (RO)
 *
 * Reset value: 0x00000001U
 *
 * PMSTAT is a read-only, one-hot register which indicates the current power
 * mode of the system. This register is reset on Chip POR not VLLS and by reset
 * types that trigger Chip POR not VLLS. It is unaffected by reset types that do not
 * trigger Chip POR not VLLS. See the Reset section details for more information.
 */
/*!
 * @name Constants and macros for entire SMC_PMSTAT register
 */
/*@{*/
#define SMC_RD_PMSTAT(base)      (SMC_PMSTAT_REG(base))
/*@}*/

/*
 * Constants & macros for individual SMC_PMSTAT bitfields
 */

/*!
 * @name Register SMC_PMSTAT, field PMSTAT[7:0] (RO)
 *
 * When debug is enabled, the PMSTAT will not update to STOP or VLPS When a
 * PSTOP mode is enabled, the PMSTAT will not update to STOP or VLPS
 */
/*@{*/
/*! @brief Read current value of the SMC_PMSTAT_PMSTAT field. */
#define SMC_RD_PMSTAT_PMSTAT(base) ((SMC_PMSTAT_REG(base) & SMC_PMSTAT_PMSTAT_MASK) >> SMC_PMSTAT_PMSTAT_SHIFT)
#define SMC_BRD_PMSTAT_PMSTAT(base) (SMC_RD_PMSTAT_PMSTAT(base))
/*@}*/

/*
 * S32K144 TRGMUX
 *
 * TRGMUX
 *
 * Registers defined in this header file:
 * - TRGMUX_DMAMUX_CH0 - TRGMUX DMAMUX_CH0 Register
 * - TRGMUX_XB_OUT0_3 - TRGMUX XB_OUT0_3 Register
 * - TRGMUX_XB_OUT4_7 - TRGMUX XB_OUT4_7 Register
 * - TRGMUX_ADC0 - TRGMUX ADC0 Register
 * - TRGMUX_ADC1 - TRGMUX ADC1 Register
 * - TRGMUX_DUMMY5 - TRGMUX DUMMY5 Register
 * - TRGMUX_DUMMY6 - TRGMUX DUMMY6 Register
 * - TRGMUX_CMP0 - TRGMUX CMP0 Register
 * - TRGMUX_DUMMY8 - TRGMUX DUMMY8 Register
 * - TRGMUX_DUMMY9 - TRGMUX DUMMY9 Register
 * - TRGMUX_FTM0 - TRGMUX FTM0 Register
 * - TRGMUX_FTM1 - TRGMUX FTM1 Register
 * - TRGMUX_FTM2 - TRGMUX FTM2 Register
 * - TRGMUX_FTM3 - TRGMUX FTM3 Register
 * - TRGMUX_PDB0 - TRGMUX PDB0 Register
 * - TRGMUX_PDB1 - TRGMUX PDB1 Register
 * - TRGMUX_DUMMY16 - TRGMUX DUMMY16 Register
 * - TRGMUX_FLEXIO - TRGMUX FLEXIO Register
 * - TRGMUX_LPIT - TRGMUX LPIT Register
 * - TRGMUX_LPUART0 - TRGMUX LPUART0 Register
 * - TRGMUX_LPUART1 - TRGMUX LPUART1 Register
 * - TRGMUX_LPI2C0 - TRGMUX LPI2C0 Register
 * - TRGMUX_LPI2C1 - TRGMUX LPI2C1 Register
 * - TRGMUX_LPSPI0 - TRGMUX LPSPI0 Register
 * - TRGMUX_LPSPI1 - TRGMUX LPSPI1 Register
 * - TRGMUX_LPTMR0 - TRGMUX LPTMR0 Register
 */

#define TRGMUX_INSTANCE_COUNT (1U) /*!< Number of instances of the TRGMUX module. */
#define TRGMUX_IDX (0U) /*!< Instance number for TRGMUX. */

/*******************************************************************************
 * TRGMUX_DMAMUX_CH0 - TRGMUX DMAMUX_CH0 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_DMAMUX_CH0 - TRGMUX DMAMUX_CH0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_DMAMUX_CH0 register
 */
/*@{*/
#define TRGMUX_RD_DMAMUX_CH0(base) (TRGMUX_DMAMUX_CH0_REG(base))
#define TRGMUX_WR_DMAMUX_CH0(base, value) (TRGMUX_DMAMUX_CH0_REG(base) = (value))
#define TRGMUX_RMW_DMAMUX_CH0(base, mask, value) (TRGMUX_WR_DMAMUX_CH0(base, (TRGMUX_RD_DMAMUX_CH0(base) & ~(mask)) | (value)))
#define TRGMUX_SET_DMAMUX_CH0(base, value) (TRGMUX_WR_DMAMUX_CH0(base, TRGMUX_RD_DMAMUX_CH0(base) |  (value)))
#define TRGMUX_CLR_DMAMUX_CH0(base, value) (TRGMUX_WR_DMAMUX_CH0(base, TRGMUX_RD_DMAMUX_CH0(base) & ~(value)))
#define TRGMUX_TOG_DMAMUX_CH0(base, value) (TRGMUX_WR_DMAMUX_CH0(base, TRGMUX_RD_DMAMUX_CH0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_DMAMUX_CH0 bitfields
 */

/*!
 * @name Register TRGMUX_DMAMUX_CH0, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DMAMUX_CH0_SEL0 field. */
#define TRGMUX_RD_DMAMUX_CH0_SEL0(base) ((TRGMUX_DMAMUX_CH0_REG(base) & TRGMUX_DMAMUX_CH0_SEL0_MASK) >> TRGMUX_DMAMUX_CH0_SEL0_SHIFT)
#define TRGMUX_BRD_DMAMUX_CH0_SEL0(base) (TRGMUX_RD_DMAMUX_CH0_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_DMAMUX_CH0_SEL0(base, value) (TRGMUX_RMW_DMAMUX_CH0(base, TRGMUX_DMAMUX_CH0_SEL0_MASK, TRGMUX_DMAMUX_CH0_SEL0(value)))
#define TRGMUX_BWR_DMAMUX_CH0_SEL0(base, value) (TRGMUX_WR_DMAMUX_CH0_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_DMAMUX_CH0, field SEL1[13:8] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 1. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DMAMUX_CH0_SEL1 field. */
#define TRGMUX_RD_DMAMUX_CH0_SEL1(base) ((TRGMUX_DMAMUX_CH0_REG(base) & TRGMUX_DMAMUX_CH0_SEL1_MASK) >> TRGMUX_DMAMUX_CH0_SEL1_SHIFT)
#define TRGMUX_BRD_DMAMUX_CH0_SEL1(base) (TRGMUX_RD_DMAMUX_CH0_SEL1(base))

/*! @brief Set the SEL1 field to a new value. */
#define TRGMUX_WR_DMAMUX_CH0_SEL1(base, value) (TRGMUX_RMW_DMAMUX_CH0(base, TRGMUX_DMAMUX_CH0_SEL1_MASK, TRGMUX_DMAMUX_CH0_SEL1(value)))
#define TRGMUX_BWR_DMAMUX_CH0_SEL1(base, value) (TRGMUX_WR_DMAMUX_CH0_SEL1(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_DMAMUX_CH0, field SEL2[21:16] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 2. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DMAMUX_CH0_SEL2 field. */
#define TRGMUX_RD_DMAMUX_CH0_SEL2(base) ((TRGMUX_DMAMUX_CH0_REG(base) & TRGMUX_DMAMUX_CH0_SEL2_MASK) >> TRGMUX_DMAMUX_CH0_SEL2_SHIFT)
#define TRGMUX_BRD_DMAMUX_CH0_SEL2(base) (TRGMUX_RD_DMAMUX_CH0_SEL2(base))

/*! @brief Set the SEL2 field to a new value. */
#define TRGMUX_WR_DMAMUX_CH0_SEL2(base, value) (TRGMUX_RMW_DMAMUX_CH0(base, TRGMUX_DMAMUX_CH0_SEL2_MASK, TRGMUX_DMAMUX_CH0_SEL2(value)))
#define TRGMUX_BWR_DMAMUX_CH0_SEL2(base, value) (TRGMUX_WR_DMAMUX_CH0_SEL2(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_DMAMUX_CH0, field SEL3[29:24] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 3. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DMAMUX_CH0_SEL3 field. */
#define TRGMUX_RD_DMAMUX_CH0_SEL3(base) ((TRGMUX_DMAMUX_CH0_REG(base) & TRGMUX_DMAMUX_CH0_SEL3_MASK) >> TRGMUX_DMAMUX_CH0_SEL3_SHIFT)
#define TRGMUX_BRD_DMAMUX_CH0_SEL3(base) (TRGMUX_RD_DMAMUX_CH0_SEL3(base))

/*! @brief Set the SEL3 field to a new value. */
#define TRGMUX_WR_DMAMUX_CH0_SEL3(base, value) (TRGMUX_RMW_DMAMUX_CH0(base, TRGMUX_DMAMUX_CH0_SEL3_MASK, TRGMUX_DMAMUX_CH0_SEL3(value)))
#define TRGMUX_BWR_DMAMUX_CH0_SEL3(base, value) (TRGMUX_WR_DMAMUX_CH0_SEL3(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_DMAMUX_CH0, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DMAMUX_CH0_LK field. */
#define TRGMUX_RD_DMAMUX_CH0_LK(base) ((TRGMUX_DMAMUX_CH0_REG(base) & TRGMUX_DMAMUX_CH0_LK_MASK) >> TRGMUX_DMAMUX_CH0_LK_SHIFT)
#define TRGMUX_BRD_DMAMUX_CH0_LK(base) (BITBAND_ACCESS32(&TRGMUX_DMAMUX_CH0_REG(base), TRGMUX_DMAMUX_CH0_LK_SHIFT))
/*@}*/

