nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * TRGMUX_XB_OUT0_3 - TRGMUX XB_OUT0_3 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_XB_OUT0_3 - TRGMUX XB_OUT0_3 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_XB_OUT0_3 register
 */
/*@{*/
#define TRGMUX_RD_XB_OUT0_3(base) (TRGMUX_XB_OUT0_3_REG(base))
#define TRGMUX_WR_XB_OUT0_3(base, value) (TRGMUX_XB_OUT0_3_REG(base) = (value))
#define TRGMUX_RMW_XB_OUT0_3(base, mask, value) (TRGMUX_WR_XB_OUT0_3(base, (TRGMUX_RD_XB_OUT0_3(base) & ~(mask)) | (value)))
#define TRGMUX_SET_XB_OUT0_3(base, value) (TRGMUX_WR_XB_OUT0_3(base, TRGMUX_RD_XB_OUT0_3(base) |  (value)))
#define TRGMUX_CLR_XB_OUT0_3(base, value) (TRGMUX_WR_XB_OUT0_3(base, TRGMUX_RD_XB_OUT0_3(base) & ~(value)))
#define TRGMUX_TOG_XB_OUT0_3(base, value) (TRGMUX_WR_XB_OUT0_3(base, TRGMUX_RD_XB_OUT0_3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_XB_OUT0_3 bitfields
 */

/*!
 * @name Register TRGMUX_XB_OUT0_3, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_XB_OUT0_3_SEL0 field. */
#define TRGMUX_RD_XB_OUT0_3_SEL0(base) ((TRGMUX_XB_OUT0_3_REG(base) & TRGMUX_XB_OUT0_3_SEL0_MASK) >> TRGMUX_XB_OUT0_3_SEL0_SHIFT)
#define TRGMUX_BRD_XB_OUT0_3_SEL0(base) (TRGMUX_RD_XB_OUT0_3_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_XB_OUT0_3_SEL0(base, value) (TRGMUX_RMW_XB_OUT0_3(base, TRGMUX_XB_OUT0_3_SEL0_MASK, TRGMUX_XB_OUT0_3_SEL0(value)))
#define TRGMUX_BWR_XB_OUT0_3_SEL0(base, value) (TRGMUX_WR_XB_OUT0_3_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_XB_OUT0_3, field SEL1[13:8] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 1. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_XB_OUT0_3_SEL1 field. */
#define TRGMUX_RD_XB_OUT0_3_SEL1(base) ((TRGMUX_XB_OUT0_3_REG(base) & TRGMUX_XB_OUT0_3_SEL1_MASK) >> TRGMUX_XB_OUT0_3_SEL1_SHIFT)
#define TRGMUX_BRD_XB_OUT0_3_SEL1(base) (TRGMUX_RD_XB_OUT0_3_SEL1(base))

/*! @brief Set the SEL1 field to a new value. */
#define TRGMUX_WR_XB_OUT0_3_SEL1(base, value) (TRGMUX_RMW_XB_OUT0_3(base, TRGMUX_XB_OUT0_3_SEL1_MASK, TRGMUX_XB_OUT0_3_SEL1(value)))
#define TRGMUX_BWR_XB_OUT0_3_SEL1(base, value) (TRGMUX_WR_XB_OUT0_3_SEL1(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_XB_OUT0_3, field SEL2[21:16] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 2. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_XB_OUT0_3_SEL2 field. */
#define TRGMUX_RD_XB_OUT0_3_SEL2(base) ((TRGMUX_XB_OUT0_3_REG(base) & TRGMUX_XB_OUT0_3_SEL2_MASK) >> TRGMUX_XB_OUT0_3_SEL2_SHIFT)
#define TRGMUX_BRD_XB_OUT0_3_SEL2(base) (TRGMUX_RD_XB_OUT0_3_SEL2(base))

/*! @brief Set the SEL2 field to a new value. */
#define TRGMUX_WR_XB_OUT0_3_SEL2(base, value) (TRGMUX_RMW_XB_OUT0_3(base, TRGMUX_XB_OUT0_3_SEL2_MASK, TRGMUX_XB_OUT0_3_SEL2(value)))
#define TRGMUX_BWR_XB_OUT0_3_SEL2(base, value) (TRGMUX_WR_XB_OUT0_3_SEL2(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_XB_OUT0_3, field SEL3[29:24] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 3. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_XB_OUT0_3_SEL3 field. */
#define TRGMUX_RD_XB_OUT0_3_SEL3(base) ((TRGMUX_XB_OUT0_3_REG(base) & TRGMUX_XB_OUT0_3_SEL3_MASK) >> TRGMUX_XB_OUT0_3_SEL3_SHIFT)
#define TRGMUX_BRD_XB_OUT0_3_SEL3(base) (TRGMUX_RD_XB_OUT0_3_SEL3(base))

/*! @brief Set the SEL3 field to a new value. */
#define TRGMUX_WR_XB_OUT0_3_SEL3(base, value) (TRGMUX_RMW_XB_OUT0_3(base, TRGMUX_XB_OUT0_3_SEL3_MASK, TRGMUX_XB_OUT0_3_SEL3(value)))
#define TRGMUX_BWR_XB_OUT0_3_SEL3(base, value) (TRGMUX_WR_XB_OUT0_3_SEL3(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_XB_OUT0_3, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_XB_OUT0_3_LK field. */
#define TRGMUX_RD_XB_OUT0_3_LK(base) ((TRGMUX_XB_OUT0_3_REG(base) & TRGMUX_XB_OUT0_3_LK_MASK) >> TRGMUX_XB_OUT0_3_LK_SHIFT)
#define TRGMUX_BRD_XB_OUT0_3_LK(base) (BITBAND_ACCESS32(&TRGMUX_XB_OUT0_3_REG(base), TRGMUX_XB_OUT0_3_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_XB_OUT4_7 - TRGMUX XB_OUT4_7 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_XB_OUT4_7 - TRGMUX XB_OUT4_7 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_XB_OUT4_7 register
 */
/*@{*/
#define TRGMUX_RD_XB_OUT4_7(base) (TRGMUX_XB_OUT4_7_REG(base))
#define TRGMUX_WR_XB_OUT4_7(base, value) (TRGMUX_XB_OUT4_7_REG(base) = (value))
#define TRGMUX_RMW_XB_OUT4_7(base, mask, value) (TRGMUX_WR_XB_OUT4_7(base, (TRGMUX_RD_XB_OUT4_7(base) & ~(mask)) | (value)))
#define TRGMUX_SET_XB_OUT4_7(base, value) (TRGMUX_WR_XB_OUT4_7(base, TRGMUX_RD_XB_OUT4_7(base) |  (value)))
#define TRGMUX_CLR_XB_OUT4_7(base, value) (TRGMUX_WR_XB_OUT4_7(base, TRGMUX_RD_XB_OUT4_7(base) & ~(value)))
#define TRGMUX_TOG_XB_OUT4_7(base, value) (TRGMUX_WR_XB_OUT4_7(base, TRGMUX_RD_XB_OUT4_7(base) ^  (value)))
/*@}*/

