nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*
 * Constants & macros for individual TRGMUX_XB_OUT4_7 bitfields
 */

/*!
 * @name Register TRGMUX_XB_OUT4_7, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_XB_OUT4_7_SEL0 field. */
#define TRGMUX_RD_XB_OUT4_7_SEL0(base) ((TRGMUX_XB_OUT4_7_REG(base) & TRGMUX_XB_OUT4_7_SEL0_MASK) >> TRGMUX_XB_OUT4_7_SEL0_SHIFT)
#define TRGMUX_BRD_XB_OUT4_7_SEL0(base) (TRGMUX_RD_XB_OUT4_7_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_XB_OUT4_7_SEL0(base, value) (TRGMUX_RMW_XB_OUT4_7(base, TRGMUX_XB_OUT4_7_SEL0_MASK, TRGMUX_XB_OUT4_7_SEL0(value)))
#define TRGMUX_BWR_XB_OUT4_7_SEL0(base, value) (TRGMUX_WR_XB_OUT4_7_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_XB_OUT4_7, field SEL1[13:8] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 1. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_XB_OUT4_7_SEL1 field. */
#define TRGMUX_RD_XB_OUT4_7_SEL1(base) ((TRGMUX_XB_OUT4_7_REG(base) & TRGMUX_XB_OUT4_7_SEL1_MASK) >> TRGMUX_XB_OUT4_7_SEL1_SHIFT)
#define TRGMUX_BRD_XB_OUT4_7_SEL1(base) (TRGMUX_RD_XB_OUT4_7_SEL1(base))

/*! @brief Set the SEL1 field to a new value. */
#define TRGMUX_WR_XB_OUT4_7_SEL1(base, value) (TRGMUX_RMW_XB_OUT4_7(base, TRGMUX_XB_OUT4_7_SEL1_MASK, TRGMUX_XB_OUT4_7_SEL1(value)))
#define TRGMUX_BWR_XB_OUT4_7_SEL1(base, value) (TRGMUX_WR_XB_OUT4_7_SEL1(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_XB_OUT4_7, field SEL2[21:16] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 2. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_XB_OUT4_7_SEL2 field. */
#define TRGMUX_RD_XB_OUT4_7_SEL2(base) ((TRGMUX_XB_OUT4_7_REG(base) & TRGMUX_XB_OUT4_7_SEL2_MASK) >> TRGMUX_XB_OUT4_7_SEL2_SHIFT)
#define TRGMUX_BRD_XB_OUT4_7_SEL2(base) (TRGMUX_RD_XB_OUT4_7_SEL2(base))

/*! @brief Set the SEL2 field to a new value. */
#define TRGMUX_WR_XB_OUT4_7_SEL2(base, value) (TRGMUX_RMW_XB_OUT4_7(base, TRGMUX_XB_OUT4_7_SEL2_MASK, TRGMUX_XB_OUT4_7_SEL2(value)))
#define TRGMUX_BWR_XB_OUT4_7_SEL2(base, value) (TRGMUX_WR_XB_OUT4_7_SEL2(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_XB_OUT4_7, field SEL3[29:24] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 3. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_XB_OUT4_7_SEL3 field. */
#define TRGMUX_RD_XB_OUT4_7_SEL3(base) ((TRGMUX_XB_OUT4_7_REG(base) & TRGMUX_XB_OUT4_7_SEL3_MASK) >> TRGMUX_XB_OUT4_7_SEL3_SHIFT)
#define TRGMUX_BRD_XB_OUT4_7_SEL3(base) (TRGMUX_RD_XB_OUT4_7_SEL3(base))

/*! @brief Set the SEL3 field to a new value. */
#define TRGMUX_WR_XB_OUT4_7_SEL3(base, value) (TRGMUX_RMW_XB_OUT4_7(base, TRGMUX_XB_OUT4_7_SEL3_MASK, TRGMUX_XB_OUT4_7_SEL3(value)))
#define TRGMUX_BWR_XB_OUT4_7_SEL3(base, value) (TRGMUX_WR_XB_OUT4_7_SEL3(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_XB_OUT4_7, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_XB_OUT4_7_LK field. */
#define TRGMUX_RD_XB_OUT4_7_LK(base) ((TRGMUX_XB_OUT4_7_REG(base) & TRGMUX_XB_OUT4_7_LK_MASK) >> TRGMUX_XB_OUT4_7_LK_SHIFT)
#define TRGMUX_BRD_XB_OUT4_7_LK(base) (BITBAND_ACCESS32(&TRGMUX_XB_OUT4_7_REG(base), TRGMUX_XB_OUT4_7_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_ADC0 - TRGMUX ADC0 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_ADC0 - TRGMUX ADC0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_ADC0 register
 */
/*@{*/
#define TRGMUX_RD_ADC0(base)     (TRGMUX_ADC0_REG(base))
#define TRGMUX_WR_ADC0(base, value) (TRGMUX_ADC0_REG(base) = (value))
#define TRGMUX_RMW_ADC0(base, mask, value) (TRGMUX_WR_ADC0(base, (TRGMUX_RD_ADC0(base) & ~(mask)) | (value)))
#define TRGMUX_SET_ADC0(base, value) (TRGMUX_WR_ADC0(base, TRGMUX_RD_ADC0(base) |  (value)))
#define TRGMUX_CLR_ADC0(base, value) (TRGMUX_WR_ADC0(base, TRGMUX_RD_ADC0(base) & ~(value)))
#define TRGMUX_TOG_ADC0(base, value) (TRGMUX_WR_ADC0(base, TRGMUX_RD_ADC0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_ADC0 bitfields
 */

/*!
 * @name Register TRGMUX_ADC0, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_ADC0_SEL0 field. */
#define TRGMUX_RD_ADC0_SEL0(base) ((TRGMUX_ADC0_REG(base) & TRGMUX_ADC0_SEL0_MASK) >> TRGMUX_ADC0_SEL0_SHIFT)
#define TRGMUX_BRD_ADC0_SEL0(base) (TRGMUX_RD_ADC0_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_ADC0_SEL0(base, value) (TRGMUX_RMW_ADC0(base, TRGMUX_ADC0_SEL0_MASK, TRGMUX_ADC0_SEL0(value)))
#define TRGMUX_BWR_ADC0_SEL0(base, value) (TRGMUX_WR_ADC0_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_ADC0, field SEL1[13:8] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 1. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_ADC0_SEL1 field. */
#define TRGMUX_RD_ADC0_SEL1(base) ((TRGMUX_ADC0_REG(base) & TRGMUX_ADC0_SEL1_MASK) >> TRGMUX_ADC0_SEL1_SHIFT)
#define TRGMUX_BRD_ADC0_SEL1(base) (TRGMUX_RD_ADC0_SEL1(base))

/*! @brief Set the SEL1 field to a new value. */
#define TRGMUX_WR_ADC0_SEL1(base, value) (TRGMUX_RMW_ADC0(base, TRGMUX_ADC0_SEL1_MASK, TRGMUX_ADC0_SEL1(value)))
#define TRGMUX_BWR_ADC0_SEL1(base, value) (TRGMUX_WR_ADC0_SEL1(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_ADC0, field SEL2[21:16] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 2. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_ADC0_SEL2 field. */
#define TRGMUX_RD_ADC0_SEL2(base) ((TRGMUX_ADC0_REG(base) & TRGMUX_ADC0_SEL2_MASK) >> TRGMUX_ADC0_SEL2_SHIFT)
#define TRGMUX_BRD_ADC0_SEL2(base) (TRGMUX_RD_ADC0_SEL2(base))

/*! @brief Set the SEL2 field to a new value. */
#define TRGMUX_WR_ADC0_SEL2(base, value) (TRGMUX_RMW_ADC0(base, TRGMUX_ADC0_SEL2_MASK, TRGMUX_ADC0_SEL2(value)))
#define TRGMUX_BWR_ADC0_SEL2(base, value) (TRGMUX_WR_ADC0_SEL2(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_ADC0, field SEL3[29:24] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 3. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_ADC0_SEL3 field. */
#define TRGMUX_RD_ADC0_SEL3(base) ((TRGMUX_ADC0_REG(base) & TRGMUX_ADC0_SEL3_MASK) >> TRGMUX_ADC0_SEL3_SHIFT)
#define TRGMUX_BRD_ADC0_SEL3(base) (TRGMUX_RD_ADC0_SEL3(base))

/*! @brief Set the SEL3 field to a new value. */
#define TRGMUX_WR_ADC0_SEL3(base, value) (TRGMUX_RMW_ADC0(base, TRGMUX_ADC0_SEL3_MASK, TRGMUX_ADC0_SEL3(value)))
#define TRGMUX_BWR_ADC0_SEL3(base, value) (TRGMUX_WR_ADC0_SEL3(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_ADC0, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_ADC0_LK field. */
#define TRGMUX_RD_ADC0_LK(base) ((TRGMUX_ADC0_REG(base) & TRGMUX_ADC0_LK_MASK) >> TRGMUX_ADC0_LK_SHIFT)
#define TRGMUX_BRD_ADC0_LK(base) (BITBAND_ACCESS32(&TRGMUX_ADC0_REG(base), TRGMUX_ADC0_LK_SHIFT))
/*@}*/

