nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * TRGMUX_ADC1 - TRGMUX ADC1 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_ADC1 - TRGMUX ADC1 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_ADC1 register
 */
/*@{*/
#define TRGMUX_RD_ADC1(base)     (TRGMUX_ADC1_REG(base))
#define TRGMUX_WR_ADC1(base, value) (TRGMUX_ADC1_REG(base) = (value))
#define TRGMUX_RMW_ADC1(base, mask, value) (TRGMUX_WR_ADC1(base, (TRGMUX_RD_ADC1(base) & ~(mask)) | (value)))
#define TRGMUX_SET_ADC1(base, value) (TRGMUX_WR_ADC1(base, TRGMUX_RD_ADC1(base) |  (value)))
#define TRGMUX_CLR_ADC1(base, value) (TRGMUX_WR_ADC1(base, TRGMUX_RD_ADC1(base) & ~(value)))
#define TRGMUX_TOG_ADC1(base, value) (TRGMUX_WR_ADC1(base, TRGMUX_RD_ADC1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_ADC1 bitfields
 */

/*!
 * @name Register TRGMUX_ADC1, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_ADC1_SEL0 field. */
#define TRGMUX_RD_ADC1_SEL0(base) ((TRGMUX_ADC1_REG(base) & TRGMUX_ADC1_SEL0_MASK) >> TRGMUX_ADC1_SEL0_SHIFT)
#define TRGMUX_BRD_ADC1_SEL0(base) (TRGMUX_RD_ADC1_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_ADC1_SEL0(base, value) (TRGMUX_RMW_ADC1(base, TRGMUX_ADC1_SEL0_MASK, TRGMUX_ADC1_SEL0(value)))
#define TRGMUX_BWR_ADC1_SEL0(base, value) (TRGMUX_WR_ADC1_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_ADC1, field SEL1[13:8] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 1. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_ADC1_SEL1 field. */
#define TRGMUX_RD_ADC1_SEL1(base) ((TRGMUX_ADC1_REG(base) & TRGMUX_ADC1_SEL1_MASK) >> TRGMUX_ADC1_SEL1_SHIFT)
#define TRGMUX_BRD_ADC1_SEL1(base) (TRGMUX_RD_ADC1_SEL1(base))

/*! @brief Set the SEL1 field to a new value. */
#define TRGMUX_WR_ADC1_SEL1(base, value) (TRGMUX_RMW_ADC1(base, TRGMUX_ADC1_SEL1_MASK, TRGMUX_ADC1_SEL1(value)))
#define TRGMUX_BWR_ADC1_SEL1(base, value) (TRGMUX_WR_ADC1_SEL1(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_ADC1, field SEL2[21:16] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 2. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_ADC1_SEL2 field. */
#define TRGMUX_RD_ADC1_SEL2(base) ((TRGMUX_ADC1_REG(base) & TRGMUX_ADC1_SEL2_MASK) >> TRGMUX_ADC1_SEL2_SHIFT)
#define TRGMUX_BRD_ADC1_SEL2(base) (TRGMUX_RD_ADC1_SEL2(base))

/*! @brief Set the SEL2 field to a new value. */
#define TRGMUX_WR_ADC1_SEL2(base, value) (TRGMUX_RMW_ADC1(base, TRGMUX_ADC1_SEL2_MASK, TRGMUX_ADC1_SEL2(value)))
#define TRGMUX_BWR_ADC1_SEL2(base, value) (TRGMUX_WR_ADC1_SEL2(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_ADC1, field SEL3[29:24] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 3. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_ADC1_SEL3 field. */
#define TRGMUX_RD_ADC1_SEL3(base) ((TRGMUX_ADC1_REG(base) & TRGMUX_ADC1_SEL3_MASK) >> TRGMUX_ADC1_SEL3_SHIFT)
#define TRGMUX_BRD_ADC1_SEL3(base) (TRGMUX_RD_ADC1_SEL3(base))

/*! @brief Set the SEL3 field to a new value. */
#define TRGMUX_WR_ADC1_SEL3(base, value) (TRGMUX_RMW_ADC1(base, TRGMUX_ADC1_SEL3_MASK, TRGMUX_ADC1_SEL3(value)))
#define TRGMUX_BWR_ADC1_SEL3(base, value) (TRGMUX_WR_ADC1_SEL3(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_ADC1, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_ADC1_LK field. */
#define TRGMUX_RD_ADC1_LK(base) ((TRGMUX_ADC1_REG(base) & TRGMUX_ADC1_LK_MASK) >> TRGMUX_ADC1_LK_SHIFT)
#define TRGMUX_BRD_ADC1_LK(base) (BITBAND_ACCESS32(&TRGMUX_ADC1_REG(base), TRGMUX_ADC1_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_DUMMY5 - TRGMUX DUMMY5 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_DUMMY5 - TRGMUX DUMMY5 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_DUMMY5 register
 */
/*@{*/
#define TRGMUX_RD_DUMMY5(base)   (TRGMUX_DUMMY5_REG(base))
#define TRGMUX_WR_DUMMY5(base, value) (TRGMUX_DUMMY5_REG(base) = (value))
#define TRGMUX_RMW_DUMMY5(base, mask, value) (TRGMUX_WR_DUMMY5(base, (TRGMUX_RD_DUMMY5(base) & ~(mask)) | (value)))
#define TRGMUX_SET_DUMMY5(base, value) (TRGMUX_WR_DUMMY5(base, TRGMUX_RD_DUMMY5(base) |  (value)))
#define TRGMUX_CLR_DUMMY5(base, value) (TRGMUX_WR_DUMMY5(base, TRGMUX_RD_DUMMY5(base) & ~(value)))
#define TRGMUX_TOG_DUMMY5(base, value) (TRGMUX_WR_DUMMY5(base, TRGMUX_RD_DUMMY5(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_DUMMY5 bitfields
 */

/*!
 * @name Register TRGMUX_DUMMY5, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DUMMY5_SEL0 field. */
#define TRGMUX_RD_DUMMY5_SEL0(base) ((TRGMUX_DUMMY5_REG(base) & TRGMUX_DUMMY5_SEL0_MASK) >> TRGMUX_DUMMY5_SEL0_SHIFT)
#define TRGMUX_BRD_DUMMY5_SEL0(base) (TRGMUX_RD_DUMMY5_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_DUMMY5_SEL0(base, value) (TRGMUX_RMW_DUMMY5(base, TRGMUX_DUMMY5_SEL0_MASK, TRGMUX_DUMMY5_SEL0(value)))
#define TRGMUX_BWR_DUMMY5_SEL0(base, value) (TRGMUX_WR_DUMMY5_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_DUMMY5, field SEL1[13:8] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 1. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DUMMY5_SEL1 field. */
#define TRGMUX_RD_DUMMY5_SEL1(base) ((TRGMUX_DUMMY5_REG(base) & TRGMUX_DUMMY5_SEL1_MASK) >> TRGMUX_DUMMY5_SEL1_SHIFT)
#define TRGMUX_BRD_DUMMY5_SEL1(base) (TRGMUX_RD_DUMMY5_SEL1(base))

/*! @brief Set the SEL1 field to a new value. */
#define TRGMUX_WR_DUMMY5_SEL1(base, value) (TRGMUX_RMW_DUMMY5(base, TRGMUX_DUMMY5_SEL1_MASK, TRGMUX_DUMMY5_SEL1(value)))
#define TRGMUX_BWR_DUMMY5_SEL1(base, value) (TRGMUX_WR_DUMMY5_SEL1(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_DUMMY5, field SEL2[21:16] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 2. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DUMMY5_SEL2 field. */
#define TRGMUX_RD_DUMMY5_SEL2(base) ((TRGMUX_DUMMY5_REG(base) & TRGMUX_DUMMY5_SEL2_MASK) >> TRGMUX_DUMMY5_SEL2_SHIFT)
#define TRGMUX_BRD_DUMMY5_SEL2(base) (TRGMUX_RD_DUMMY5_SEL2(base))

/*! @brief Set the SEL2 field to a new value. */
#define TRGMUX_WR_DUMMY5_SEL2(base, value) (TRGMUX_RMW_DUMMY5(base, TRGMUX_DUMMY5_SEL2_MASK, TRGMUX_DUMMY5_SEL2(value)))
#define TRGMUX_BWR_DUMMY5_SEL2(base, value) (TRGMUX_WR_DUMMY5_SEL2(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_DUMMY5, field SEL3[29:24] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 3. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DUMMY5_SEL3 field. */
#define TRGMUX_RD_DUMMY5_SEL3(base) ((TRGMUX_DUMMY5_REG(base) & TRGMUX_DUMMY5_SEL3_MASK) >> TRGMUX_DUMMY5_SEL3_SHIFT)
#define TRGMUX_BRD_DUMMY5_SEL3(base) (TRGMUX_RD_DUMMY5_SEL3(base))

/*! @brief Set the SEL3 field to a new value. */
#define TRGMUX_WR_DUMMY5_SEL3(base, value) (TRGMUX_RMW_DUMMY5(base, TRGMUX_DUMMY5_SEL3_MASK, TRGMUX_DUMMY5_SEL3(value)))
#define TRGMUX_BWR_DUMMY5_SEL3(base, value) (TRGMUX_WR_DUMMY5_SEL3(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_DUMMY5, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DUMMY5_LK field. */
#define TRGMUX_RD_DUMMY5_LK(base) ((TRGMUX_DUMMY5_REG(base) & TRGMUX_DUMMY5_LK_MASK) >> TRGMUX_DUMMY5_LK_SHIFT)
#define TRGMUX_BRD_DUMMY5_LK(base) (BITBAND_ACCESS32(&TRGMUX_DUMMY5_REG(base), TRGMUX_DUMMY5_LK_SHIFT))
/*@}*/

