nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * TRGMUX_DUMMY6 - TRGMUX DUMMY6 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_DUMMY6 - TRGMUX DUMMY6 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_DUMMY6 register
 */
/*@{*/
#define TRGMUX_RD_DUMMY6(base)   (TRGMUX_DUMMY6_REG(base))
#define TRGMUX_WR_DUMMY6(base, value) (TRGMUX_DUMMY6_REG(base) = (value))
#define TRGMUX_RMW_DUMMY6(base, mask, value) (TRGMUX_WR_DUMMY6(base, (TRGMUX_RD_DUMMY6(base) & ~(mask)) | (value)))
#define TRGMUX_SET_DUMMY6(base, value) (TRGMUX_WR_DUMMY6(base, TRGMUX_RD_DUMMY6(base) |  (value)))
#define TRGMUX_CLR_DUMMY6(base, value) (TRGMUX_WR_DUMMY6(base, TRGMUX_RD_DUMMY6(base) & ~(value)))
#define TRGMUX_TOG_DUMMY6(base, value) (TRGMUX_WR_DUMMY6(base, TRGMUX_RD_DUMMY6(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_DUMMY6 bitfields
 */

/*!
 * @name Register TRGMUX_DUMMY6, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DUMMY6_SEL0 field. */
#define TRGMUX_RD_DUMMY6_SEL0(base) ((TRGMUX_DUMMY6_REG(base) & TRGMUX_DUMMY6_SEL0_MASK) >> TRGMUX_DUMMY6_SEL0_SHIFT)
#define TRGMUX_BRD_DUMMY6_SEL0(base) (TRGMUX_RD_DUMMY6_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_DUMMY6_SEL0(base, value) (TRGMUX_RMW_DUMMY6(base, TRGMUX_DUMMY6_SEL0_MASK, TRGMUX_DUMMY6_SEL0(value)))
#define TRGMUX_BWR_DUMMY6_SEL0(base, value) (TRGMUX_WR_DUMMY6_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_DUMMY6, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DUMMY6_LK field. */
#define TRGMUX_RD_DUMMY6_LK(base) ((TRGMUX_DUMMY6_REG(base) & TRGMUX_DUMMY6_LK_MASK) >> TRGMUX_DUMMY6_LK_SHIFT)
#define TRGMUX_BRD_DUMMY6_LK(base) (BITBAND_ACCESS32(&TRGMUX_DUMMY6_REG(base), TRGMUX_DUMMY6_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_CMP0 - TRGMUX CMP0 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_CMP0 - TRGMUX CMP0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_CMP0 register
 */
/*@{*/
#define TRGMUX_RD_CMP0(base)     (TRGMUX_CMP0_REG(base))
#define TRGMUX_WR_CMP0(base, value) (TRGMUX_CMP0_REG(base) = (value))
#define TRGMUX_RMW_CMP0(base, mask, value) (TRGMUX_WR_CMP0(base, (TRGMUX_RD_CMP0(base) & ~(mask)) | (value)))
#define TRGMUX_SET_CMP0(base, value) (TRGMUX_WR_CMP0(base, TRGMUX_RD_CMP0(base) |  (value)))
#define TRGMUX_CLR_CMP0(base, value) (TRGMUX_WR_CMP0(base, TRGMUX_RD_CMP0(base) & ~(value)))
#define TRGMUX_TOG_CMP0(base, value) (TRGMUX_WR_CMP0(base, TRGMUX_RD_CMP0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_CMP0 bitfields
 */

/*!
 * @name Register TRGMUX_CMP0, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_CMP0_SEL0 field. */
#define TRGMUX_RD_CMP0_SEL0(base) ((TRGMUX_CMP0_REG(base) & TRGMUX_CMP0_SEL0_MASK) >> TRGMUX_CMP0_SEL0_SHIFT)
#define TRGMUX_BRD_CMP0_SEL0(base) (TRGMUX_RD_CMP0_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_CMP0_SEL0(base, value) (TRGMUX_RMW_CMP0(base, TRGMUX_CMP0_SEL0_MASK, TRGMUX_CMP0_SEL0(value)))
#define TRGMUX_BWR_CMP0_SEL0(base, value) (TRGMUX_WR_CMP0_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_CMP0, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_CMP0_LK field. */
#define TRGMUX_RD_CMP0_LK(base) ((TRGMUX_CMP0_REG(base) & TRGMUX_CMP0_LK_MASK) >> TRGMUX_CMP0_LK_SHIFT)
#define TRGMUX_BRD_CMP0_LK(base) (BITBAND_ACCESS32(&TRGMUX_CMP0_REG(base), TRGMUX_CMP0_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_DUMMY8 - TRGMUX DUMMY8 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_DUMMY8 - TRGMUX DUMMY8 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_DUMMY8 register
 */
/*@{*/
#define TRGMUX_RD_DUMMY8(base)   (TRGMUX_DUMMY8_REG(base))
#define TRGMUX_WR_DUMMY8(base, value) (TRGMUX_DUMMY8_REG(base) = (value))
#define TRGMUX_RMW_DUMMY8(base, mask, value) (TRGMUX_WR_DUMMY8(base, (TRGMUX_RD_DUMMY8(base) & ~(mask)) | (value)))
#define TRGMUX_SET_DUMMY8(base, value) (TRGMUX_WR_DUMMY8(base, TRGMUX_RD_DUMMY8(base) |  (value)))
#define TRGMUX_CLR_DUMMY8(base, value) (TRGMUX_WR_DUMMY8(base, TRGMUX_RD_DUMMY8(base) & ~(value)))
#define TRGMUX_TOG_DUMMY8(base, value) (TRGMUX_WR_DUMMY8(base, TRGMUX_RD_DUMMY8(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_DUMMY8 bitfields
 */

/*!
 * @name Register TRGMUX_DUMMY8, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DUMMY8_SEL0 field. */
#define TRGMUX_RD_DUMMY8_SEL0(base) ((TRGMUX_DUMMY8_REG(base) & TRGMUX_DUMMY8_SEL0_MASK) >> TRGMUX_DUMMY8_SEL0_SHIFT)
#define TRGMUX_BRD_DUMMY8_SEL0(base) (TRGMUX_RD_DUMMY8_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_DUMMY8_SEL0(base, value) (TRGMUX_RMW_DUMMY8(base, TRGMUX_DUMMY8_SEL0_MASK, TRGMUX_DUMMY8_SEL0(value)))
#define TRGMUX_BWR_DUMMY8_SEL0(base, value) (TRGMUX_WR_DUMMY8_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_DUMMY8, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DUMMY8_LK field. */
#define TRGMUX_RD_DUMMY8_LK(base) ((TRGMUX_DUMMY8_REG(base) & TRGMUX_DUMMY8_LK_MASK) >> TRGMUX_DUMMY8_LK_SHIFT)
#define TRGMUX_BRD_DUMMY8_LK(base) (BITBAND_ACCESS32(&TRGMUX_DUMMY8_REG(base), TRGMUX_DUMMY8_LK_SHIFT))
/*@}*/

