nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * TRGMUX_FTM1 - TRGMUX FTM1 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_FTM1 - TRGMUX FTM1 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_FTM1 register
 */
/*@{*/
#define TRGMUX_RD_FTM1(base)     (TRGMUX_FTM1_REG(base))
#define TRGMUX_WR_FTM1(base, value) (TRGMUX_FTM1_REG(base) = (value))
#define TRGMUX_RMW_FTM1(base, mask, value) (TRGMUX_WR_FTM1(base, (TRGMUX_RD_FTM1(base) & ~(mask)) | (value)))
#define TRGMUX_SET_FTM1(base, value) (TRGMUX_WR_FTM1(base, TRGMUX_RD_FTM1(base) |  (value)))
#define TRGMUX_CLR_FTM1(base, value) (TRGMUX_WR_FTM1(base, TRGMUX_RD_FTM1(base) & ~(value)))
#define TRGMUX_TOG_FTM1(base, value) (TRGMUX_WR_FTM1(base, TRGMUX_RD_FTM1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_FTM1 bitfields
 */

/*!
 * @name Register TRGMUX_FTM1, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FTM1_SEL0 field. */
#define TRGMUX_RD_FTM1_SEL0(base) ((TRGMUX_FTM1_REG(base) & TRGMUX_FTM1_SEL0_MASK) >> TRGMUX_FTM1_SEL0_SHIFT)
#define TRGMUX_BRD_FTM1_SEL0(base) (TRGMUX_RD_FTM1_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_FTM1_SEL0(base, value) (TRGMUX_RMW_FTM1(base, TRGMUX_FTM1_SEL0_MASK, TRGMUX_FTM1_SEL0(value)))
#define TRGMUX_BWR_FTM1_SEL0(base, value) (TRGMUX_WR_FTM1_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_FTM1, field SEL1[13:8] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 1. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FTM1_SEL1 field. */
#define TRGMUX_RD_FTM1_SEL1(base) ((TRGMUX_FTM1_REG(base) & TRGMUX_FTM1_SEL1_MASK) >> TRGMUX_FTM1_SEL1_SHIFT)
#define TRGMUX_BRD_FTM1_SEL1(base) (TRGMUX_RD_FTM1_SEL1(base))

/*! @brief Set the SEL1 field to a new value. */
#define TRGMUX_WR_FTM1_SEL1(base, value) (TRGMUX_RMW_FTM1(base, TRGMUX_FTM1_SEL1_MASK, TRGMUX_FTM1_SEL1(value)))
#define TRGMUX_BWR_FTM1_SEL1(base, value) (TRGMUX_WR_FTM1_SEL1(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_FTM1, field SEL2[21:16] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 2. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FTM1_SEL2 field. */
#define TRGMUX_RD_FTM1_SEL2(base) ((TRGMUX_FTM1_REG(base) & TRGMUX_FTM1_SEL2_MASK) >> TRGMUX_FTM1_SEL2_SHIFT)
#define TRGMUX_BRD_FTM1_SEL2(base) (TRGMUX_RD_FTM1_SEL2(base))

/*! @brief Set the SEL2 field to a new value. */
#define TRGMUX_WR_FTM1_SEL2(base, value) (TRGMUX_RMW_FTM1(base, TRGMUX_FTM1_SEL2_MASK, TRGMUX_FTM1_SEL2(value)))
#define TRGMUX_BWR_FTM1_SEL2(base, value) (TRGMUX_WR_FTM1_SEL2(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_FTM1, field SEL3[29:24] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 3. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FTM1_SEL3 field. */
#define TRGMUX_RD_FTM1_SEL3(base) ((TRGMUX_FTM1_REG(base) & TRGMUX_FTM1_SEL3_MASK) >> TRGMUX_FTM1_SEL3_SHIFT)
#define TRGMUX_BRD_FTM1_SEL3(base) (TRGMUX_RD_FTM1_SEL3(base))

/*! @brief Set the SEL3 field to a new value. */
#define TRGMUX_WR_FTM1_SEL3(base, value) (TRGMUX_RMW_FTM1(base, TRGMUX_FTM1_SEL3_MASK, TRGMUX_FTM1_SEL3(value)))
#define TRGMUX_BWR_FTM1_SEL3(base, value) (TRGMUX_WR_FTM1_SEL3(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_FTM1, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FTM1_LK field. */
#define TRGMUX_RD_FTM1_LK(base) ((TRGMUX_FTM1_REG(base) & TRGMUX_FTM1_LK_MASK) >> TRGMUX_FTM1_LK_SHIFT)
#define TRGMUX_BRD_FTM1_LK(base) (BITBAND_ACCESS32(&TRGMUX_FTM1_REG(base), TRGMUX_FTM1_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_FTM2 - TRGMUX FTM2 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_FTM2 - TRGMUX FTM2 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_FTM2 register
 */
/*@{*/
#define TRGMUX_RD_FTM2(base)     (TRGMUX_FTM2_REG(base))
#define TRGMUX_WR_FTM2(base, value) (TRGMUX_FTM2_REG(base) = (value))
#define TRGMUX_RMW_FTM2(base, mask, value) (TRGMUX_WR_FTM2(base, (TRGMUX_RD_FTM2(base) & ~(mask)) | (value)))
#define TRGMUX_SET_FTM2(base, value) (TRGMUX_WR_FTM2(base, TRGMUX_RD_FTM2(base) |  (value)))
#define TRGMUX_CLR_FTM2(base, value) (TRGMUX_WR_FTM2(base, TRGMUX_RD_FTM2(base) & ~(value)))
#define TRGMUX_TOG_FTM2(base, value) (TRGMUX_WR_FTM2(base, TRGMUX_RD_FTM2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_FTM2 bitfields
 */

/*!
 * @name Register TRGMUX_FTM2, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FTM2_SEL0 field. */
#define TRGMUX_RD_FTM2_SEL0(base) ((TRGMUX_FTM2_REG(base) & TRGMUX_FTM2_SEL0_MASK) >> TRGMUX_FTM2_SEL0_SHIFT)
#define TRGMUX_BRD_FTM2_SEL0(base) (TRGMUX_RD_FTM2_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_FTM2_SEL0(base, value) (TRGMUX_RMW_FTM2(base, TRGMUX_FTM2_SEL0_MASK, TRGMUX_FTM2_SEL0(value)))
#define TRGMUX_BWR_FTM2_SEL0(base, value) (TRGMUX_WR_FTM2_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_FTM2, field SEL1[13:8] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 1. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FTM2_SEL1 field. */
#define TRGMUX_RD_FTM2_SEL1(base) ((TRGMUX_FTM2_REG(base) & TRGMUX_FTM2_SEL1_MASK) >> TRGMUX_FTM2_SEL1_SHIFT)
#define TRGMUX_BRD_FTM2_SEL1(base) (TRGMUX_RD_FTM2_SEL1(base))

/*! @brief Set the SEL1 field to a new value. */
#define TRGMUX_WR_FTM2_SEL1(base, value) (TRGMUX_RMW_FTM2(base, TRGMUX_FTM2_SEL1_MASK, TRGMUX_FTM2_SEL1(value)))
#define TRGMUX_BWR_FTM2_SEL1(base, value) (TRGMUX_WR_FTM2_SEL1(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_FTM2, field SEL2[21:16] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 2. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FTM2_SEL2 field. */
#define TRGMUX_RD_FTM2_SEL2(base) ((TRGMUX_FTM2_REG(base) & TRGMUX_FTM2_SEL2_MASK) >> TRGMUX_FTM2_SEL2_SHIFT)
#define TRGMUX_BRD_FTM2_SEL2(base) (TRGMUX_RD_FTM2_SEL2(base))

/*! @brief Set the SEL2 field to a new value. */
#define TRGMUX_WR_FTM2_SEL2(base, value) (TRGMUX_RMW_FTM2(base, TRGMUX_FTM2_SEL2_MASK, TRGMUX_FTM2_SEL2(value)))
#define TRGMUX_BWR_FTM2_SEL2(base, value) (TRGMUX_WR_FTM2_SEL2(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_FTM2, field SEL3[29:24] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 3. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FTM2_SEL3 field. */
#define TRGMUX_RD_FTM2_SEL3(base) ((TRGMUX_FTM2_REG(base) & TRGMUX_FTM2_SEL3_MASK) >> TRGMUX_FTM2_SEL3_SHIFT)
#define TRGMUX_BRD_FTM2_SEL3(base) (TRGMUX_RD_FTM2_SEL3(base))

/*! @brief Set the SEL3 field to a new value. */
#define TRGMUX_WR_FTM2_SEL3(base, value) (TRGMUX_RMW_FTM2(base, TRGMUX_FTM2_SEL3_MASK, TRGMUX_FTM2_SEL3(value)))
#define TRGMUX_BWR_FTM2_SEL3(base, value) (TRGMUX_WR_FTM2_SEL3(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_FTM2, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FTM2_LK field. */
#define TRGMUX_RD_FTM2_LK(base) ((TRGMUX_FTM2_REG(base) & TRGMUX_FTM2_LK_MASK) >> TRGMUX_FTM2_LK_SHIFT)
#define TRGMUX_BRD_FTM2_LK(base) (BITBAND_ACCESS32(&TRGMUX_FTM2_REG(base), TRGMUX_FTM2_LK_SHIFT))
/*@}*/

