nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * TRGMUX_PDB1 - TRGMUX PDB1 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_PDB1 - TRGMUX PDB1 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_PDB1 register
 */
/*@{*/
#define TRGMUX_RD_PDB1(base)     (TRGMUX_PDB1_REG(base))
#define TRGMUX_WR_PDB1(base, value) (TRGMUX_PDB1_REG(base) = (value))
#define TRGMUX_RMW_PDB1(base, mask, value) (TRGMUX_WR_PDB1(base, (TRGMUX_RD_PDB1(base) & ~(mask)) | (value)))
#define TRGMUX_SET_PDB1(base, value) (TRGMUX_WR_PDB1(base, TRGMUX_RD_PDB1(base) |  (value)))
#define TRGMUX_CLR_PDB1(base, value) (TRGMUX_WR_PDB1(base, TRGMUX_RD_PDB1(base) & ~(value)))
#define TRGMUX_TOG_PDB1(base, value) (TRGMUX_WR_PDB1(base, TRGMUX_RD_PDB1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_PDB1 bitfields
 */

/*!
 * @name Register TRGMUX_PDB1, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_PDB1_SEL0 field. */
#define TRGMUX_RD_PDB1_SEL0(base) ((TRGMUX_PDB1_REG(base) & TRGMUX_PDB1_SEL0_MASK) >> TRGMUX_PDB1_SEL0_SHIFT)
#define TRGMUX_BRD_PDB1_SEL0(base) (TRGMUX_RD_PDB1_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_PDB1_SEL0(base, value) (TRGMUX_RMW_PDB1(base, TRGMUX_PDB1_SEL0_MASK, TRGMUX_PDB1_SEL0(value)))
#define TRGMUX_BWR_PDB1_SEL0(base, value) (TRGMUX_WR_PDB1_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_PDB1, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_PDB1_LK field. */
#define TRGMUX_RD_PDB1_LK(base) ((TRGMUX_PDB1_REG(base) & TRGMUX_PDB1_LK_MASK) >> TRGMUX_PDB1_LK_SHIFT)
#define TRGMUX_BRD_PDB1_LK(base) (BITBAND_ACCESS32(&TRGMUX_PDB1_REG(base), TRGMUX_PDB1_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_DUMMY16 - TRGMUX DUMMY16 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_DUMMY16 - TRGMUX DUMMY16 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_DUMMY16 register
 */
/*@{*/
#define TRGMUX_RD_DUMMY16(base)  (TRGMUX_DUMMY16_REG(base))
#define TRGMUX_WR_DUMMY16(base, value) (TRGMUX_DUMMY16_REG(base) = (value))
#define TRGMUX_RMW_DUMMY16(base, mask, value) (TRGMUX_WR_DUMMY16(base, (TRGMUX_RD_DUMMY16(base) & ~(mask)) | (value)))
#define TRGMUX_SET_DUMMY16(base, value) (TRGMUX_WR_DUMMY16(base, TRGMUX_RD_DUMMY16(base) |  (value)))
#define TRGMUX_CLR_DUMMY16(base, value) (TRGMUX_WR_DUMMY16(base, TRGMUX_RD_DUMMY16(base) & ~(value)))
#define TRGMUX_TOG_DUMMY16(base, value) (TRGMUX_WR_DUMMY16(base, TRGMUX_RD_DUMMY16(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_DUMMY16 bitfields
 */

/*!
 * @name Register TRGMUX_DUMMY16, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DUMMY16_SEL0 field. */
#define TRGMUX_RD_DUMMY16_SEL0(base) ((TRGMUX_DUMMY16_REG(base) & TRGMUX_DUMMY16_SEL0_MASK) >> TRGMUX_DUMMY16_SEL0_SHIFT)
#define TRGMUX_BRD_DUMMY16_SEL0(base) (TRGMUX_RD_DUMMY16_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_DUMMY16_SEL0(base, value) (TRGMUX_RMW_DUMMY16(base, TRGMUX_DUMMY16_SEL0_MASK, TRGMUX_DUMMY16_SEL0(value)))
#define TRGMUX_BWR_DUMMY16_SEL0(base, value) (TRGMUX_WR_DUMMY16_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_DUMMY16, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_DUMMY16_LK field. */
#define TRGMUX_RD_DUMMY16_LK(base) ((TRGMUX_DUMMY16_REG(base) & TRGMUX_DUMMY16_LK_MASK) >> TRGMUX_DUMMY16_LK_SHIFT)
#define TRGMUX_BRD_DUMMY16_LK(base) (BITBAND_ACCESS32(&TRGMUX_DUMMY16_REG(base), TRGMUX_DUMMY16_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_FLEXIO - TRGMUX FLEXIO Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_FLEXIO - TRGMUX FLEXIO Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_FLEXIO register
 */
/*@{*/
#define TRGMUX_RD_FLEXIO(base)   (TRGMUX_FLEXIO_REG(base))
#define TRGMUX_WR_FLEXIO(base, value) (TRGMUX_FLEXIO_REG(base) = (value))
#define TRGMUX_RMW_FLEXIO(base, mask, value) (TRGMUX_WR_FLEXIO(base, (TRGMUX_RD_FLEXIO(base) & ~(mask)) | (value)))
#define TRGMUX_SET_FLEXIO(base, value) (TRGMUX_WR_FLEXIO(base, TRGMUX_RD_FLEXIO(base) |  (value)))
#define TRGMUX_CLR_FLEXIO(base, value) (TRGMUX_WR_FLEXIO(base, TRGMUX_RD_FLEXIO(base) & ~(value)))
#define TRGMUX_TOG_FLEXIO(base, value) (TRGMUX_WR_FLEXIO(base, TRGMUX_RD_FLEXIO(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_FLEXIO bitfields
 */

/*!
 * @name Register TRGMUX_FLEXIO, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FLEXIO_SEL0 field. */
#define TRGMUX_RD_FLEXIO_SEL0(base) ((TRGMUX_FLEXIO_REG(base) & TRGMUX_FLEXIO_SEL0_MASK) >> TRGMUX_FLEXIO_SEL0_SHIFT)
#define TRGMUX_BRD_FLEXIO_SEL0(base) (TRGMUX_RD_FLEXIO_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_FLEXIO_SEL0(base, value) (TRGMUX_RMW_FLEXIO(base, TRGMUX_FLEXIO_SEL0_MASK, TRGMUX_FLEXIO_SEL0(value)))
#define TRGMUX_BWR_FLEXIO_SEL0(base, value) (TRGMUX_WR_FLEXIO_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_FLEXIO, field SEL1[13:8] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 1. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FLEXIO_SEL1 field. */
#define TRGMUX_RD_FLEXIO_SEL1(base) ((TRGMUX_FLEXIO_REG(base) & TRGMUX_FLEXIO_SEL1_MASK) >> TRGMUX_FLEXIO_SEL1_SHIFT)
#define TRGMUX_BRD_FLEXIO_SEL1(base) (TRGMUX_RD_FLEXIO_SEL1(base))

/*! @brief Set the SEL1 field to a new value. */
#define TRGMUX_WR_FLEXIO_SEL1(base, value) (TRGMUX_RMW_FLEXIO(base, TRGMUX_FLEXIO_SEL1_MASK, TRGMUX_FLEXIO_SEL1(value)))
#define TRGMUX_BWR_FLEXIO_SEL1(base, value) (TRGMUX_WR_FLEXIO_SEL1(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_FLEXIO, field SEL2[21:16] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 2. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FLEXIO_SEL2 field. */
#define TRGMUX_RD_FLEXIO_SEL2(base) ((TRGMUX_FLEXIO_REG(base) & TRGMUX_FLEXIO_SEL2_MASK) >> TRGMUX_FLEXIO_SEL2_SHIFT)
#define TRGMUX_BRD_FLEXIO_SEL2(base) (TRGMUX_RD_FLEXIO_SEL2(base))

/*! @brief Set the SEL2 field to a new value. */
#define TRGMUX_WR_FLEXIO_SEL2(base, value) (TRGMUX_RMW_FLEXIO(base, TRGMUX_FLEXIO_SEL2_MASK, TRGMUX_FLEXIO_SEL2(value)))
#define TRGMUX_BWR_FLEXIO_SEL2(base, value) (TRGMUX_WR_FLEXIO_SEL2(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_FLEXIO, field SEL3[29:24] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 3. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FLEXIO_SEL3 field. */
#define TRGMUX_RD_FLEXIO_SEL3(base) ((TRGMUX_FLEXIO_REG(base) & TRGMUX_FLEXIO_SEL3_MASK) >> TRGMUX_FLEXIO_SEL3_SHIFT)
#define TRGMUX_BRD_FLEXIO_SEL3(base) (TRGMUX_RD_FLEXIO_SEL3(base))

/*! @brief Set the SEL3 field to a new value. */
#define TRGMUX_WR_FLEXIO_SEL3(base, value) (TRGMUX_RMW_FLEXIO(base, TRGMUX_FLEXIO_SEL3_MASK, TRGMUX_FLEXIO_SEL3(value)))
#define TRGMUX_BWR_FLEXIO_SEL3(base, value) (TRGMUX_WR_FLEXIO_SEL3(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_FLEXIO, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_FLEXIO_LK field. */
#define TRGMUX_RD_FLEXIO_LK(base) ((TRGMUX_FLEXIO_REG(base) & TRGMUX_FLEXIO_LK_MASK) >> TRGMUX_FLEXIO_LK_SHIFT)
#define TRGMUX_BRD_FLEXIO_LK(base) (BITBAND_ACCESS32(&TRGMUX_FLEXIO_REG(base), TRGMUX_FLEXIO_LK_SHIFT))
/*@}*/

