nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * TRGMUX_LPIT - TRGMUX LPIT Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_LPIT - TRGMUX LPIT Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_LPIT register
 */
/*@{*/
#define TRGMUX_RD_LPIT(base)     (TRGMUX_LPIT_REG(base))
#define TRGMUX_WR_LPIT(base, value) (TRGMUX_LPIT_REG(base) = (value))
#define TRGMUX_RMW_LPIT(base, mask, value) (TRGMUX_WR_LPIT(base, (TRGMUX_RD_LPIT(base) & ~(mask)) | (value)))
#define TRGMUX_SET_LPIT(base, value) (TRGMUX_WR_LPIT(base, TRGMUX_RD_LPIT(base) |  (value)))
#define TRGMUX_CLR_LPIT(base, value) (TRGMUX_WR_LPIT(base, TRGMUX_RD_LPIT(base) & ~(value)))
#define TRGMUX_TOG_LPIT(base, value) (TRGMUX_WR_LPIT(base, TRGMUX_RD_LPIT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_LPIT bitfields
 */

/*!
 * @name Register TRGMUX_LPIT, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPIT_SEL0 field. */
#define TRGMUX_RD_LPIT_SEL0(base) ((TRGMUX_LPIT_REG(base) & TRGMUX_LPIT_SEL0_MASK) >> TRGMUX_LPIT_SEL0_SHIFT)
#define TRGMUX_BRD_LPIT_SEL0(base) (TRGMUX_RD_LPIT_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_LPIT_SEL0(base, value) (TRGMUX_RMW_LPIT(base, TRGMUX_LPIT_SEL0_MASK, TRGMUX_LPIT_SEL0(value)))
#define TRGMUX_BWR_LPIT_SEL0(base, value) (TRGMUX_WR_LPIT_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_LPIT, field SEL1[13:8] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 1. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPIT_SEL1 field. */
#define TRGMUX_RD_LPIT_SEL1(base) ((TRGMUX_LPIT_REG(base) & TRGMUX_LPIT_SEL1_MASK) >> TRGMUX_LPIT_SEL1_SHIFT)
#define TRGMUX_BRD_LPIT_SEL1(base) (TRGMUX_RD_LPIT_SEL1(base))

/*! @brief Set the SEL1 field to a new value. */
#define TRGMUX_WR_LPIT_SEL1(base, value) (TRGMUX_RMW_LPIT(base, TRGMUX_LPIT_SEL1_MASK, TRGMUX_LPIT_SEL1(value)))
#define TRGMUX_BWR_LPIT_SEL1(base, value) (TRGMUX_WR_LPIT_SEL1(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_LPIT, field SEL2[21:16] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 2. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPIT_SEL2 field. */
#define TRGMUX_RD_LPIT_SEL2(base) ((TRGMUX_LPIT_REG(base) & TRGMUX_LPIT_SEL2_MASK) >> TRGMUX_LPIT_SEL2_SHIFT)
#define TRGMUX_BRD_LPIT_SEL2(base) (TRGMUX_RD_LPIT_SEL2(base))

/*! @brief Set the SEL2 field to a new value. */
#define TRGMUX_WR_LPIT_SEL2(base, value) (TRGMUX_RMW_LPIT(base, TRGMUX_LPIT_SEL2_MASK, TRGMUX_LPIT_SEL2(value)))
#define TRGMUX_BWR_LPIT_SEL2(base, value) (TRGMUX_WR_LPIT_SEL2(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_LPIT, field SEL3[29:24] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 3. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPIT_SEL3 field. */
#define TRGMUX_RD_LPIT_SEL3(base) ((TRGMUX_LPIT_REG(base) & TRGMUX_LPIT_SEL3_MASK) >> TRGMUX_LPIT_SEL3_SHIFT)
#define TRGMUX_BRD_LPIT_SEL3(base) (TRGMUX_RD_LPIT_SEL3(base))

/*! @brief Set the SEL3 field to a new value. */
#define TRGMUX_WR_LPIT_SEL3(base, value) (TRGMUX_RMW_LPIT(base, TRGMUX_LPIT_SEL3_MASK, TRGMUX_LPIT_SEL3(value)))
#define TRGMUX_BWR_LPIT_SEL3(base, value) (TRGMUX_WR_LPIT_SEL3(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_LPIT, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPIT_LK field. */
#define TRGMUX_RD_LPIT_LK(base) ((TRGMUX_LPIT_REG(base) & TRGMUX_LPIT_LK_MASK) >> TRGMUX_LPIT_LK_SHIFT)
#define TRGMUX_BRD_LPIT_LK(base) (BITBAND_ACCESS32(&TRGMUX_LPIT_REG(base), TRGMUX_LPIT_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_LPUART0 - TRGMUX LPUART0 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_LPUART0 - TRGMUX LPUART0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_LPUART0 register
 */
/*@{*/
#define TRGMUX_RD_LPUART0(base)  (TRGMUX_LPUART0_REG(base))
#define TRGMUX_WR_LPUART0(base, value) (TRGMUX_LPUART0_REG(base) = (value))
#define TRGMUX_RMW_LPUART0(base, mask, value) (TRGMUX_WR_LPUART0(base, (TRGMUX_RD_LPUART0(base) & ~(mask)) | (value)))
#define TRGMUX_SET_LPUART0(base, value) (TRGMUX_WR_LPUART0(base, TRGMUX_RD_LPUART0(base) |  (value)))
#define TRGMUX_CLR_LPUART0(base, value) (TRGMUX_WR_LPUART0(base, TRGMUX_RD_LPUART0(base) & ~(value)))
#define TRGMUX_TOG_LPUART0(base, value) (TRGMUX_WR_LPUART0(base, TRGMUX_RD_LPUART0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_LPUART0 bitfields
 */

/*!
 * @name Register TRGMUX_LPUART0, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPUART0_SEL0 field. */
#define TRGMUX_RD_LPUART0_SEL0(base) ((TRGMUX_LPUART0_REG(base) & TRGMUX_LPUART0_SEL0_MASK) >> TRGMUX_LPUART0_SEL0_SHIFT)
#define TRGMUX_BRD_LPUART0_SEL0(base) (TRGMUX_RD_LPUART0_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_LPUART0_SEL0(base, value) (TRGMUX_RMW_LPUART0(base, TRGMUX_LPUART0_SEL0_MASK, TRGMUX_LPUART0_SEL0(value)))
#define TRGMUX_BWR_LPUART0_SEL0(base, value) (TRGMUX_WR_LPUART0_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_LPUART0, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPUART0_LK field. */
#define TRGMUX_RD_LPUART0_LK(base) ((TRGMUX_LPUART0_REG(base) & TRGMUX_LPUART0_LK_MASK) >> TRGMUX_LPUART0_LK_SHIFT)
#define TRGMUX_BRD_LPUART0_LK(base) (BITBAND_ACCESS32(&TRGMUX_LPUART0_REG(base), TRGMUX_LPUART0_LK_SHIFT))
/*@}*/

