nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * TRGMUX_LPUART1 - TRGMUX LPUART1 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_LPUART1 - TRGMUX LPUART1 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_LPUART1 register
 */
/*@{*/
#define TRGMUX_RD_LPUART1(base)  (TRGMUX_LPUART1_REG(base))
#define TRGMUX_WR_LPUART1(base, value) (TRGMUX_LPUART1_REG(base) = (value))
#define TRGMUX_RMW_LPUART1(base, mask, value) (TRGMUX_WR_LPUART1(base, (TRGMUX_RD_LPUART1(base) & ~(mask)) | (value)))
#define TRGMUX_SET_LPUART1(base, value) (TRGMUX_WR_LPUART1(base, TRGMUX_RD_LPUART1(base) |  (value)))
#define TRGMUX_CLR_LPUART1(base, value) (TRGMUX_WR_LPUART1(base, TRGMUX_RD_LPUART1(base) & ~(value)))
#define TRGMUX_TOG_LPUART1(base, value) (TRGMUX_WR_LPUART1(base, TRGMUX_RD_LPUART1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_LPUART1 bitfields
 */

/*!
 * @name Register TRGMUX_LPUART1, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPUART1_SEL0 field. */
#define TRGMUX_RD_LPUART1_SEL0(base) ((TRGMUX_LPUART1_REG(base) & TRGMUX_LPUART1_SEL0_MASK) >> TRGMUX_LPUART1_SEL0_SHIFT)
#define TRGMUX_BRD_LPUART1_SEL0(base) (TRGMUX_RD_LPUART1_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_LPUART1_SEL0(base, value) (TRGMUX_RMW_LPUART1(base, TRGMUX_LPUART1_SEL0_MASK, TRGMUX_LPUART1_SEL0(value)))
#define TRGMUX_BWR_LPUART1_SEL0(base, value) (TRGMUX_WR_LPUART1_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_LPUART1, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPUART1_LK field. */
#define TRGMUX_RD_LPUART1_LK(base) ((TRGMUX_LPUART1_REG(base) & TRGMUX_LPUART1_LK_MASK) >> TRGMUX_LPUART1_LK_SHIFT)
#define TRGMUX_BRD_LPUART1_LK(base) (BITBAND_ACCESS32(&TRGMUX_LPUART1_REG(base), TRGMUX_LPUART1_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_LPI2C0 - TRGMUX LPI2C0 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_LPI2C0 - TRGMUX LPI2C0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_LPI2C0 register
 */
/*@{*/
#define TRGMUX_RD_LPI2C0(base)   (TRGMUX_LPI2C0_REG(base))
#define TRGMUX_WR_LPI2C0(base, value) (TRGMUX_LPI2C0_REG(base) = (value))
#define TRGMUX_RMW_LPI2C0(base, mask, value) (TRGMUX_WR_LPI2C0(base, (TRGMUX_RD_LPI2C0(base) & ~(mask)) | (value)))
#define TRGMUX_SET_LPI2C0(base, value) (TRGMUX_WR_LPI2C0(base, TRGMUX_RD_LPI2C0(base) |  (value)))
#define TRGMUX_CLR_LPI2C0(base, value) (TRGMUX_WR_LPI2C0(base, TRGMUX_RD_LPI2C0(base) & ~(value)))
#define TRGMUX_TOG_LPI2C0(base, value) (TRGMUX_WR_LPI2C0(base, TRGMUX_RD_LPI2C0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_LPI2C0 bitfields
 */

/*!
 * @name Register TRGMUX_LPI2C0, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPI2C0_SEL0 field. */
#define TRGMUX_RD_LPI2C0_SEL0(base) ((TRGMUX_LPI2C0_REG(base) & TRGMUX_LPI2C0_SEL0_MASK) >> TRGMUX_LPI2C0_SEL0_SHIFT)
#define TRGMUX_BRD_LPI2C0_SEL0(base) (TRGMUX_RD_LPI2C0_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_LPI2C0_SEL0(base, value) (TRGMUX_RMW_LPI2C0(base, TRGMUX_LPI2C0_SEL0_MASK, TRGMUX_LPI2C0_SEL0(value)))
#define TRGMUX_BWR_LPI2C0_SEL0(base, value) (TRGMUX_WR_LPI2C0_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_LPI2C0, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPI2C0_LK field. */
#define TRGMUX_RD_LPI2C0_LK(base) ((TRGMUX_LPI2C0_REG(base) & TRGMUX_LPI2C0_LK_MASK) >> TRGMUX_LPI2C0_LK_SHIFT)
#define TRGMUX_BRD_LPI2C0_LK(base) (BITBAND_ACCESS32(&TRGMUX_LPI2C0_REG(base), TRGMUX_LPI2C0_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_LPI2C1 - TRGMUX LPI2C1 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_LPI2C1 - TRGMUX LPI2C1 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_LPI2C1 register
 */
/*@{*/
#define TRGMUX_RD_LPI2C1(base)   (TRGMUX_LPI2C1_REG(base))
#define TRGMUX_WR_LPI2C1(base, value) (TRGMUX_LPI2C1_REG(base) = (value))
#define TRGMUX_RMW_LPI2C1(base, mask, value) (TRGMUX_WR_LPI2C1(base, (TRGMUX_RD_LPI2C1(base) & ~(mask)) | (value)))
#define TRGMUX_SET_LPI2C1(base, value) (TRGMUX_WR_LPI2C1(base, TRGMUX_RD_LPI2C1(base) |  (value)))
#define TRGMUX_CLR_LPI2C1(base, value) (TRGMUX_WR_LPI2C1(base, TRGMUX_RD_LPI2C1(base) & ~(value)))
#define TRGMUX_TOG_LPI2C1(base, value) (TRGMUX_WR_LPI2C1(base, TRGMUX_RD_LPI2C1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_LPI2C1 bitfields
 */

/*!
 * @name Register TRGMUX_LPI2C1, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPI2C1_SEL0 field. */
#define TRGMUX_RD_LPI2C1_SEL0(base) ((TRGMUX_LPI2C1_REG(base) & TRGMUX_LPI2C1_SEL0_MASK) >> TRGMUX_LPI2C1_SEL0_SHIFT)
#define TRGMUX_BRD_LPI2C1_SEL0(base) (TRGMUX_RD_LPI2C1_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_LPI2C1_SEL0(base, value) (TRGMUX_RMW_LPI2C1(base, TRGMUX_LPI2C1_SEL0_MASK, TRGMUX_LPI2C1_SEL0(value)))
#define TRGMUX_BWR_LPI2C1_SEL0(base, value) (TRGMUX_WR_LPI2C1_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_LPI2C1, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPI2C1_LK field. */
#define TRGMUX_RD_LPI2C1_LK(base) ((TRGMUX_LPI2C1_REG(base) & TRGMUX_LPI2C1_LK_MASK) >> TRGMUX_LPI2C1_LK_SHIFT)
#define TRGMUX_BRD_LPI2C1_LK(base) (BITBAND_ACCESS32(&TRGMUX_LPI2C1_REG(base), TRGMUX_LPI2C1_LK_SHIFT))
/*@}*/

