nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*******************************************************************************
 * TRGMUX_LPSPI0 - TRGMUX LPSPI0 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_LPSPI0 - TRGMUX LPSPI0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_LPSPI0 register
 */
/*@{*/
#define TRGMUX_RD_LPSPI0(base)   (TRGMUX_LPSPI0_REG(base))
#define TRGMUX_WR_LPSPI0(base, value) (TRGMUX_LPSPI0_REG(base) = (value))
#define TRGMUX_RMW_LPSPI0(base, mask, value) (TRGMUX_WR_LPSPI0(base, (TRGMUX_RD_LPSPI0(base) & ~(mask)) | (value)))
#define TRGMUX_SET_LPSPI0(base, value) (TRGMUX_WR_LPSPI0(base, TRGMUX_RD_LPSPI0(base) |  (value)))
#define TRGMUX_CLR_LPSPI0(base, value) (TRGMUX_WR_LPSPI0(base, TRGMUX_RD_LPSPI0(base) & ~(value)))
#define TRGMUX_TOG_LPSPI0(base, value) (TRGMUX_WR_LPSPI0(base, TRGMUX_RD_LPSPI0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_LPSPI0 bitfields
 */

/*!
 * @name Register TRGMUX_LPSPI0, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPSPI0_SEL0 field. */
#define TRGMUX_RD_LPSPI0_SEL0(base) ((TRGMUX_LPSPI0_REG(base) & TRGMUX_LPSPI0_SEL0_MASK) >> TRGMUX_LPSPI0_SEL0_SHIFT)
#define TRGMUX_BRD_LPSPI0_SEL0(base) (TRGMUX_RD_LPSPI0_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_LPSPI0_SEL0(base, value) (TRGMUX_RMW_LPSPI0(base, TRGMUX_LPSPI0_SEL0_MASK, TRGMUX_LPSPI0_SEL0(value)))
#define TRGMUX_BWR_LPSPI0_SEL0(base, value) (TRGMUX_WR_LPSPI0_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_LPSPI0, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPSPI0_LK field. */
#define TRGMUX_RD_LPSPI0_LK(base) ((TRGMUX_LPSPI0_REG(base) & TRGMUX_LPSPI0_LK_MASK) >> TRGMUX_LPSPI0_LK_SHIFT)
#define TRGMUX_BRD_LPSPI0_LK(base) (BITBAND_ACCESS32(&TRGMUX_LPSPI0_REG(base), TRGMUX_LPSPI0_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_LPSPI1 - TRGMUX LPSPI1 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_LPSPI1 - TRGMUX LPSPI1 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_LPSPI1 register
 */
/*@{*/
#define TRGMUX_RD_LPSPI1(base)   (TRGMUX_LPSPI1_REG(base))
#define TRGMUX_WR_LPSPI1(base, value) (TRGMUX_LPSPI1_REG(base) = (value))
#define TRGMUX_RMW_LPSPI1(base, mask, value) (TRGMUX_WR_LPSPI1(base, (TRGMUX_RD_LPSPI1(base) & ~(mask)) | (value)))
#define TRGMUX_SET_LPSPI1(base, value) (TRGMUX_WR_LPSPI1(base, TRGMUX_RD_LPSPI1(base) |  (value)))
#define TRGMUX_CLR_LPSPI1(base, value) (TRGMUX_WR_LPSPI1(base, TRGMUX_RD_LPSPI1(base) & ~(value)))
#define TRGMUX_TOG_LPSPI1(base, value) (TRGMUX_WR_LPSPI1(base, TRGMUX_RD_LPSPI1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_LPSPI1 bitfields
 */

/*!
 * @name Register TRGMUX_LPSPI1, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPSPI1_SEL0 field. */
#define TRGMUX_RD_LPSPI1_SEL0(base) ((TRGMUX_LPSPI1_REG(base) & TRGMUX_LPSPI1_SEL0_MASK) >> TRGMUX_LPSPI1_SEL0_SHIFT)
#define TRGMUX_BRD_LPSPI1_SEL0(base) (TRGMUX_RD_LPSPI1_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_LPSPI1_SEL0(base, value) (TRGMUX_RMW_LPSPI1(base, TRGMUX_LPSPI1_SEL0_MASK, TRGMUX_LPSPI1_SEL0(value)))
#define TRGMUX_BWR_LPSPI1_SEL0(base, value) (TRGMUX_WR_LPSPI1_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_LPSPI1, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPSPI1_LK field. */
#define TRGMUX_RD_LPSPI1_LK(base) ((TRGMUX_LPSPI1_REG(base) & TRGMUX_LPSPI1_LK_MASK) >> TRGMUX_LPSPI1_LK_SHIFT)
#define TRGMUX_BRD_LPSPI1_LK(base) (BITBAND_ACCESS32(&TRGMUX_LPSPI1_REG(base), TRGMUX_LPSPI1_LK_SHIFT))
/*@}*/

/*******************************************************************************
 * TRGMUX_LPTMR0 - TRGMUX LPTMR0 Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_LPTMR0 - TRGMUX LPTMR0 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * TRGMUX Register
 */
/*!
 * @name Constants and macros for entire TRGMUX_LPTMR0 register
 */
/*@{*/
#define TRGMUX_RD_LPTMR0(base)   (TRGMUX_LPTMR0_REG(base))
#define TRGMUX_WR_LPTMR0(base, value) (TRGMUX_LPTMR0_REG(base) = (value))
#define TRGMUX_RMW_LPTMR0(base, mask, value) (TRGMUX_WR_LPTMR0(base, (TRGMUX_RD_LPTMR0(base) & ~(mask)) | (value)))
#define TRGMUX_SET_LPTMR0(base, value) (TRGMUX_WR_LPTMR0(base, TRGMUX_RD_LPTMR0(base) |  (value)))
#define TRGMUX_CLR_LPTMR0(base, value) (TRGMUX_WR_LPTMR0(base, TRGMUX_RD_LPTMR0(base) & ~(value)))
#define TRGMUX_TOG_LPTMR0(base, value) (TRGMUX_WR_LPTMR0(base, TRGMUX_RD_LPTMR0(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_LPTMR0 bitfields
 */

/*!
 * @name Register TRGMUX_LPTMR0, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPTMR0_SEL0 field. */
#define TRGMUX_RD_LPTMR0_SEL0(base) ((TRGMUX_LPTMR0_REG(base) & TRGMUX_LPTMR0_SEL0_MASK) >> TRGMUX_LPTMR0_SEL0_SHIFT)
#define TRGMUX_BRD_LPTMR0_SEL0(base) (TRGMUX_RD_LPTMR0_SEL0(base))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_LPTMR0_SEL0(base, value) (TRGMUX_RMW_LPTMR0(base, TRGMUX_LPTMR0_SEL0_MASK, TRGMUX_LPTMR0_SEL0(value)))
#define TRGMUX_BWR_LPTMR0_SEL0(base, value) (TRGMUX_WR_LPTMR0_SEL0(base, value))
/*@}*/

/*!
 * @name Register TRGMUX_LPTMR0, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_LPTMR0_LK field. */
#define TRGMUX_RD_LPTMR0_LK(base) ((TRGMUX_LPTMR0_REG(base) & TRGMUX_LPTMR0_LK_MASK) >> TRGMUX_LPTMR0_LK_SHIFT)
#define TRGMUX_BRD_LPTMR0_LK(base) (BITBAND_ACCESS32(&TRGMUX_LPTMR0_REG(base), TRGMUX_LPTMR0_LK_SHIFT))
/*@}*/

