nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the PRES field to a new value. */
#define WDOG_WR_CS_PRES(base, value) (WDOG_RMW_CS(base, (WDOG_CS_PRES_MASK | WDOG_CS_FLG_MASK), WDOG_CS_PRES(value)))
#define WDOG_BWR_CS_PRES(base, value) (BITBAND_ACCESS32(&WDOG_CS_REG(base), WDOG_CS_PRES_SHIFT) = (value))
/*@}*/

/*!
 * @name Register WDOG_CS, field FLG[14] (W1C)
 *
 * This bit is an interrupt indicator when INT is set in control and status
 * register 1. Write 1 to clear it.
 *
 * Values:
 * - 0b0 - No interrupt occurred.
 * - 0b1 - An interrupt occurred.
 */
/*@{*/
/*! @brief Read current value of the WDOG_CS_FLG field. */
#define WDOG_RD_CS_FLG(base) ((WDOG_CS_REG(base) & WDOG_CS_FLG_MASK) >> WDOG_CS_FLG_SHIFT)
#define WDOG_BRD_CS_FLG(base) (BITBAND_ACCESS32(&WDOG_CS_REG(base), WDOG_CS_FLG_SHIFT))

/*! @brief Set the FLG field to a new value. */
#define WDOG_WR_CS_FLG(base, value) (WDOG_RMW_CS(base, WDOG_CS_FLG_MASK, WDOG_CS_FLG(value)))
#define WDOG_BWR_CS_FLG(base, value) (BITBAND_ACCESS32(&WDOG_CS_REG(base), WDOG_CS_FLG_SHIFT) = (value))
/*@}*/

/*!
 * @name Register WDOG_CS, field WIN[15] (RW)
 *
 * This write-once bit enables window mode. See the Window mode section.
 *
 * Values:
 * - 0b0 - Window mode disabled.
 * - 0b1 - Window mode enabled.
 */
/*@{*/
/*! @brief Read current value of the WDOG_CS_WIN field. */
#define WDOG_RD_CS_WIN(base) ((WDOG_CS_REG(base) & WDOG_CS_WIN_MASK) >> WDOG_CS_WIN_SHIFT)
#define WDOG_BRD_CS_WIN(base) (BITBAND_ACCESS32(&WDOG_CS_REG(base), WDOG_CS_WIN_SHIFT))

/*! @brief Set the WIN field to a new value. */
#define WDOG_WR_CS_WIN(base, value) (WDOG_RMW_CS(base, (WDOG_CS_WIN_MASK | WDOG_CS_FLG_MASK), WDOG_CS_WIN(value)))
#define WDOG_BWR_CS_WIN(base, value) (BITBAND_ACCESS32(&WDOG_CS_REG(base), WDOG_CS_WIN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * WDOG_CNT - Watchdog Counter Register
 ******************************************************************************/

/*!
 * @brief WDOG_CNT - Watchdog Counter Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This section describes the watchdog counter register. The watchdog counter
 * register provides access to the value of the free-running watchdog counter.
 * Software can read the counter register at any time. Software cannot write directly
 * to the watchdog counter; however, two write sequences to these registers have
 * special functions: The refresh sequence resets the watchdog counter to
 * 0x0000. See the Refreshing the Watchdog section. The unlock sequence allows the
 * watchdog to be reconfigured without forcing a reset (when CS[UPDATE] = 1). See the
 * Example code: Reconfiguring the Watchdog section. All other writes to this
 * register are illegal and force a reset.
 */
/*!
 * @name Constants and macros for entire WDOG_CNT register
 */
/*@{*/
#define WDOG_RD_CNT(base)        (WDOG_CNT_REG(base))
#define WDOG_WR_CNT(base, value) (WDOG_CNT_REG(base) = (value))
#define WDOG_RMW_CNT(base, mask, value) (WDOG_WR_CNT(base, (WDOG_RD_CNT(base) & ~(mask)) | (value)))
#define WDOG_SET_CNT(base, value) (WDOG_WR_CNT(base, WDOG_RD_CNT(base) |  (value)))
#define WDOG_CLR_CNT(base, value) (WDOG_WR_CNT(base, WDOG_RD_CNT(base) & ~(value)))
#define WDOG_TOG_CNT(base, value) (WDOG_WR_CNT(base, WDOG_RD_CNT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual WDOG_CNT bitfields
 */

/*!
 * @name Register WDOG_CNT, field CNTLOW[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the WDOG_CNT_CNTLOW field. */
#define WDOG_RD_CNT_CNTLOW(base) ((WDOG_CNT_REG(base) & WDOG_CNT_CNTLOW_MASK) >> WDOG_CNT_CNTLOW_SHIFT)
#define WDOG_BRD_CNT_CNTLOW(base) (WDOG_RD_CNT_CNTLOW(base))

/*! @brief Set the CNTLOW field to a new value. */
#define WDOG_WR_CNT_CNTLOW(base, value) (WDOG_RMW_CNT(base, WDOG_CNT_CNTLOW_MASK, WDOG_CNT_CNTLOW(value)))
#define WDOG_BWR_CNT_CNTLOW(base, value) (WDOG_WR_CNT_CNTLOW(base, value))
/*@}*/

/*!
 * @name Register WDOG_CNT, field CNTHIGH[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the WDOG_CNT_CNTHIGH field. */
#define WDOG_RD_CNT_CNTHIGH(base) ((WDOG_CNT_REG(base) & WDOG_CNT_CNTHIGH_MASK) >> WDOG_CNT_CNTHIGH_SHIFT)
#define WDOG_BRD_CNT_CNTHIGH(base) (WDOG_RD_CNT_CNTHIGH(base))

/*! @brief Set the CNTHIGH field to a new value. */
#define WDOG_WR_CNT_CNTHIGH(base, value) (WDOG_RMW_CNT(base, WDOG_CNT_CNTHIGH_MASK, WDOG_CNT_CNTHIGH(value)))
#define WDOG_BWR_CNT_CNTHIGH(base, value) (WDOG_WR_CNT_CNTHIGH(base, value))
/*@}*/

/*******************************************************************************
 * WDOG_TOVAL - Watchdog Timeout Value Register
 ******************************************************************************/

/*!
 * @brief WDOG_TOVAL - Watchdog Timeout Value Register (RW)
 *
 * Reset value: 0x00000400U
 *
 * This section describes the watchdog timeout value register. TOVAL contains
 * the 16-bit value used to set the timeout period of the watchdog. The watchdog
 * counter (CNT) is continuously compared with the timeout value (TOVAL). If the
 * counter reaches the timeout value, the watchdog forces a reset. Do not write 0
 * to the Watchdog Timeout Value Register; otherwise, the watchdog always
 * generates a reset.
 */
/*!
 * @name Constants and macros for entire WDOG_TOVAL register
 */
/*@{*/
#define WDOG_RD_TOVAL(base)      (WDOG_TOVAL_REG(base))
#define WDOG_WR_TOVAL(base, value) (WDOG_TOVAL_REG(base) = (value))
#define WDOG_RMW_TOVAL(base, mask, value) (WDOG_WR_TOVAL(base, (WDOG_RD_TOVAL(base) & ~(mask)) | (value)))
#define WDOG_SET_TOVAL(base, value) (WDOG_WR_TOVAL(base, WDOG_RD_TOVAL(base) |  (value)))
#define WDOG_CLR_TOVAL(base, value) (WDOG_WR_TOVAL(base, WDOG_RD_TOVAL(base) & ~(value)))
#define WDOG_TOG_TOVAL(base, value) (WDOG_WR_TOVAL(base, WDOG_RD_TOVAL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual WDOG_TOVAL bitfields
 */

/*!
 * @name Register WDOG_TOVAL, field TOVALLOW[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the WDOG_TOVAL_TOVALLOW field. */
#define WDOG_RD_TOVAL_TOVALLOW(base) ((WDOG_TOVAL_REG(base) & WDOG_TOVAL_TOVALLOW_MASK) >> WDOG_TOVAL_TOVALLOW_SHIFT)
#define WDOG_BRD_TOVAL_TOVALLOW(base) (WDOG_RD_TOVAL_TOVALLOW(base))

/*! @brief Set the TOVALLOW field to a new value. */
#define WDOG_WR_TOVAL_TOVALLOW(base, value) (WDOG_RMW_TOVAL(base, WDOG_TOVAL_TOVALLOW_MASK, WDOG_TOVAL_TOVALLOW(value)))
#define WDOG_BWR_TOVAL_TOVALLOW(base, value) (WDOG_WR_TOVAL_TOVALLOW(base, value))
/*@}*/

/*!
 * @name Register WDOG_TOVAL, field TOVALHIGH[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the WDOG_TOVAL_TOVALHIGH field. */
#define WDOG_RD_TOVAL_TOVALHIGH(base) ((WDOG_TOVAL_REG(base) & WDOG_TOVAL_TOVALHIGH_MASK) >> WDOG_TOVAL_TOVALHIGH_SHIFT)
#define WDOG_BRD_TOVAL_TOVALHIGH(base) (WDOG_RD_TOVAL_TOVALHIGH(base))

