nxp-archive/autobsps32_freertos/FreeRTOS/Demo/CORTEX_M4F_S32K_GCC_IAR/Freescale_Code/platform/S32K144_extension.h
/*! @brief Set the TOVALHIGH field to a new value. */
#define WDOG_WR_TOVAL_TOVALHIGH(base, value) (WDOG_RMW_TOVAL(base, WDOG_TOVAL_TOVALHIGH_MASK, WDOG_TOVAL_TOVALHIGH(value)))
#define WDOG_BWR_TOVAL_TOVALHIGH(base, value) (WDOG_WR_TOVAL_TOVALHIGH(base, value))
/*@}*/

/*******************************************************************************
 * WDOG_WIN - Watchdog Window Register
 ******************************************************************************/

/*!
 * @brief WDOG_WIN - Watchdog Window Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This section describes the watchdog window register. When window mode is
 * enabled (CS[WIN] is set), The WIN register determines the earliest time that a
 * refresh sequence is considered valid. See the Watchdog refresh mechanism section.
 * The WIN register value must be less than the TOVAL register value.
 */
/*!
 * @name Constants and macros for entire WDOG_WIN register
 */
/*@{*/
#define WDOG_RD_WIN(base)        (WDOG_WIN_REG(base))
#define WDOG_WR_WIN(base, value) (WDOG_WIN_REG(base) = (value))
#define WDOG_RMW_WIN(base, mask, value) (WDOG_WR_WIN(base, (WDOG_RD_WIN(base) & ~(mask)) | (value)))
#define WDOG_SET_WIN(base, value) (WDOG_WR_WIN(base, WDOG_RD_WIN(base) |  (value)))
#define WDOG_CLR_WIN(base, value) (WDOG_WR_WIN(base, WDOG_RD_WIN(base) & ~(value)))
#define WDOG_TOG_WIN(base, value) (WDOG_WR_WIN(base, WDOG_RD_WIN(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual WDOG_WIN bitfields
 */

/*!
 * @name Register WDOG_WIN, field WINLOW[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the WDOG_WIN_WINLOW field. */
#define WDOG_RD_WIN_WINLOW(base) ((WDOG_WIN_REG(base) & WDOG_WIN_WINLOW_MASK) >> WDOG_WIN_WINLOW_SHIFT)
#define WDOG_BRD_WIN_WINLOW(base) (WDOG_RD_WIN_WINLOW(base))

/*! @brief Set the WINLOW field to a new value. */
#define WDOG_WR_WIN_WINLOW(base, value) (WDOG_RMW_WIN(base, WDOG_WIN_WINLOW_MASK, WDOG_WIN_WINLOW(value)))
#define WDOG_BWR_WIN_WINLOW(base, value) (WDOG_WR_WIN_WINLOW(base, value))
/*@}*/

/*!
 * @name Register WDOG_WIN, field WINHIGH[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the WDOG_WIN_WINHIGH field. */
#define WDOG_RD_WIN_WINHIGH(base) ((WDOG_WIN_REG(base) & WDOG_WIN_WINHIGH_MASK) >> WDOG_WIN_WINHIGH_SHIFT)
#define WDOG_BRD_WIN_WINHIGH(base) (WDOG_RD_WIN_WINHIGH(base))

/*! @brief Set the WINHIGH field to a new value. */
#define WDOG_WR_WIN_WINHIGH(base, value) (WDOG_RMW_WIN(base, WDOG_WIN_WINHIGH_MASK, WDOG_WIN_WINHIGH(value)))
#define WDOG_BWR_WIN_WINHIGH(base, value) (WDOG_WR_WIN_WINHIGH(base, value))
/*@}*/

/* Instance numbers for core modules */
#define JTAG_IDX (0) /*!< Instance number for JTAG. */
#define TPIU_IDX (0) /*!< Instance number for TPIU. */
#define SCB_IDX (0) /*!< Instance number for SCB. */
#define SWD_IDX (0) /*!< Instance number for SWD. */
#define CoreDebug_IDX (0) /*!< Instance number for CoreDebug. */

#endif /* __S32K144_EXTENSION_H__ */
/* EOF */
